[
    {
        "content": "Allison Gatlin, a Tech reporter with Investor's Business Daily and Investors.com published a story today about some Alzheimer's Research that is making some news. It's an interesting article and although I am quoted in here, it is not the reason for me to post this story -- it's promising. Click here to view the articleExperts see HopeI appreciate Allison's work on this.I'm gearing up for our Walk to End Alzheimer's.  Donations are always encouraged.  Our team raised closed to $17,000 last year and I am hoping we can make the $20,000 mark.  If you would like to help us you can click here:Team Athens",
        "title": "New Alzheimer's Research News"
    },
    {
        "content": "Can you believe that I am posting within a month of my last post?  I can't.  I have tried to get on several times but the thoughts just weren't coming together.  In the past week three more people I know have been diagnosed with Alzheimer's disease.  It is just everywhere.  I am glad they are getting diagnosed and the help they need, but I wish it wasn't happening so frequently.  Next month is Brain Awareness month so you will probably be seeing more things about Brain diseases in the news.I decided to go off one of my medicines.  It was to help me with my concentration.  It was working, but it was a hassle to get and the stress of getting it was too much for me to take anymore so I decided to go off of it.  Now I find myself being more exhausted because it takes so much more of my mind to focus and concentrate.  One trade off for another I guess.Healthline.com has added my blog to their list of \"Best Alzheimer's Blog for 2018\". They sent a badge for me to insert into this blog, but I haven't been able to make it work.  I'll keep trying.On another note, my dear friend, Lisa Genova, who wrote Still Alice, has a new book out about ALS.  The book is \"With Every Note Played\". I urge you to read it -- you won't be sorry.",
        "title": "I'm back"
    },
    {
        "content": "Imagine that -- another post and it hasn't been three or four months -- or longer!  I have had quite a few doctor's appointments this week -- mostly pertaining to my cancer.  Everything is good, just follow ups. I am also seeing my neurologist tomorrow.  My appointments there are a little depressing because there isn't anything he can do for me other than refill my prescriptions.  So, we keep moving on -- maybe not the way we want to go but the way we are destined to go.Other friends are dealing with life threatening diseases as well and that can be a real downer.  We all have our battles to fight -- some being harder to win than others.  One way or another we all get through it -- but family, friends and faith play a major role in that.  I am thankful for all three.",
        "title": "Another Post"
    },
    {
        "content": "It isn't a joke -- one year ago today I had that fateful mammogram that showed my stage 2 cancer. It has been a long year -- one I hope to not repeat.  I go this week for my six month mammogram from surgery.  We are hoping all looks good.  I have seen more doctors, labs, hospitals than I ever wanted to.  I know lots of people coping with much worse than I went through and I salute them.  Praying for everyone's recovery and better days.On another front, the new 2018 Facts and Figures about Alzheimer's Disease is out.  You can view them here :https://www.alz.org/georgia/.  Our Walk To End Alzheimer's is in October so I will be reaching out to many to help us fight the cause.I am getting more time to visit with my little grandson.  He is 16 months old already -- and has the best giggle in the world!",
        "title": "Easter Sunday/April Fools"
    },
    {
        "content": "Yes, that's me now -- grey hair and all! I've been coloring my hair for over 30 years and I told my husband that after the cancer, that however my hair came back it was going to stay that way.  So now it is grey and curly.  This photo is about a month old and it has grown longer, but this is the new me. Take it or leave it.My grandson Ian is now 13 months old and always brings a smile to my face.  For the love of children.  He is a pretty huggable guy but he stays \"busy\" as I like to say.I am hoping that 2018 will be a healthier new year for me.  I certainly wasn't expecting the cancer diagnosis last year and I am hoping there are no surprises for me this year.I'm heading off to New Orleans this week to an Alzheimer's Association Leadership Summit. Hope to learn some new things and be able to post when I return.Thanks for bearing with me last year......here is to a healthier, happier 2018!",
        "title": "A New Year -- A Better Year?"
    }
]