[
    {
        "content": "To all my followers, friends and family.  I appreciate your love, support and friendship all year!",
        "title": "Happy Holidays"
    },
    {
        "content": "Pfizer and the Alzheimer's Association are teaming together for a float in the Tournament of Roses Parade on New Year's Day. The Float will be titled \"It's Time to Face Alzheimer's\".  You can go to this websitehttp://www.TimetoFaceAlz.organd check out the float and to also share your story of dealing with Alzheimer's in your family.",
        "title": "It's Time to Face Alzheimer's"
    },
    {
        "content": "Some people are made for traveling, others are not.  I like to travel and see new things.  It's much harder to travel by myself these days especially to new places.  But, I think my days of traveling to new places with my husband is over.  He's not a traveler.  I can no longer be the \"responsible\" one on the trip -- seeing to everything because my mind doesn't work that way any longer.  He has always relied on me to do that -- and he isn't capable of doing it.  He might be capable of doing it, he just doesn't want to do it.  Plus, as I've mentioned before, he is very negative.  With him, the glass is never half full or half empty -- it's always empty.  there are always a million reasons why we can't do something, or he is worrying about things that are totally out of his control, which makes a trip more trying for me and way too stressful.  Taking a trip is suppose to be fun -- not stressful.I loved Cancun -- it just wasn't the relaxing trip I was hoping for.  And, I couldn't help but think that at some point in probably the not too distant future I won't remember it.  So, if you look at it that way, I guess it doesn't really matter in the long run whether it was a good trip or not. But, since I have to live in the now I wish it would have been a more enjoyable trip.  I'll have to pick another traveling partner next time.",
        "title": "Traveling"
    },
    {
        "content": "We just returned from five days in Cancun -- it was really beautiful and a lot warmer than Georgia. We visited the Mayan Ruins in Chichen-Itza and some of those photos are here as well.",
        "title": "Cancun"
    },
    {
        "content": "I haven't been MIA -- I've been in Cancun Mexico for the last five days.  I'll post photos soon. While I was gone lots of things happened including the passage in the house of representatives of the NAPA bill.  For more information see herehttp://www.alz.org/join_the_cause_21243.aspThanks for all that called on their legislators for this to pass.  The President now needs to sign off on the bill.",
        "title": "Not MIA"
    },
    {
        "content": "We went to UGA and had a Christmas luncheon with the women's basketball team and then we helped assemble bikes for some needy children. We've done this for several years and it is nice be able to give something back to the community. Each player has a person who does a scrapbook of the season for her. I have a nice young lady, Ronika Ransford, from Washington DC that I am doing the scrapbook for. She is pictured here with me. Int he first photo the girls are attempting to sing We Wish You a Merry Chritmas but they had to read the words because they didn't know all of them.  Then they wanted to know what \"figgy pudding\" was -- that makes me feel old!",
        "title": "christmas spirit"
    },
    {
        "content": "Yesterday the Senate passed the National Alzheimer's Project Act -- now it goes to the House of Representatives.  This act is so important to keep Alzheimer's up front and to make it a national priority.  Let your house of representative member know that you want this passed. A little more about the National Alzheimer's Project Act here:http://www.kintera.org/atf/cf/%7BB96E2E84-AF7D-4656-9C86-285306F00E19%7D/NAPA%20Fact%20Sheet%209-16.pdf",
        "title": "good news"
    },
    {
        "content": "Don't ever take them for granted.  That's what gets me by. I know I'll forget them, but they haven't forgotten about me -- and I'm grateful for that.",
        "title": "Friends"
    },
    {
        "content": "Three times to Atlanta this week -- third time today --going with friends to see the UGA women's basketball team play Georgia Tech.Thanks to Dr. Glass' class at UGA for sending such a nice card to me.  They were thanking me for speaking to their class and it was such a pleasant surprise to get the card and read all their notes.  I really appreciate that!  I'm speaking to a pyschology class this week at UGA -- that's a new one for me so we'll see how it goes!My sister-in-law's niece died yesterday in Illinois in an automobile accident.  She was 26 and had her two boys 8 and 9 in the car with her.  They are currently in the hospital but don't have life threatening injuries.  What a shame -- the weather is probably to blame as it was snowing and icy.  Not sure what is going to happen to the children now as their father is not in the picture. i know my sister in law was close to them and I feel so bad for the family and those children -- especially here at Christmas time.  Please keep them in your prayers.",
        "title": "Busy Week"
    },
    {
        "content": "As man of you know from reading my blog, the two young men pictured above, used to work for me almost ten years ago now. Chris (left) is in med school in Florida and was in town visiting for the holiday. Josh (right) is the young man who was injured in Afghanistan a few years ago that I have written about frequently.  Josh lives nearby now and when Chris comes to town I am so honored that they spend what little time they have to see me and have lunch.  Their wives Katie and Melissa are great and we spend a lot of time laughing when we are together.  Thanks to all of you for sharing your life with me.",
        "title": "A Favorite Time"
    },
    {
        "content": "I had every intention of posting before Thanksgiving, but got a little sidetracked.  I'm working on a project for someone and I got too involved in it.  Hope all had a great day.  We had a quiet day but the pleasure of having lunch with some friends.....we like to consider them extended family since we have known them for 30 years!   I made a bad mistake though when taking my seat at the dinner table.  There were nine people -- three people on each side of the table, two on one end and another at the head of the table.  I sat on the side of the table in the middle position.  It wasn't long before I was caught in crossfire conversation.  I started to have a panic attack because of the noise coming at me.  I didn't want to get up and leave (although if I did they would have understood) but it was extremely difficult for me to sit there.  I couldn't speak and had no idea how to handle it.  I didn'thave my earplugs because I had not taken my purse.  Obviously, I made it through but it was so difficult.  It caught me really off guard and I was mad at myself for putting myself in that position.  Spoiling a perfectly good time with friends, because I sat in the wrong chair.  Sounds pretty simple doesn't it? Not wanting to correct myself in front of my friends was probably a mistake, but that old pride kicks in and it is hard to combat.But, I'm thankful that I was able to be with them, I'm thankful for good friends, I'm thankful for everyone's patience.",
        "title": "Thanksgiving"
    },
    {
        "content": "Please link on the story below and vote for the Alzheimer's Association. MetLife is donating $500,000 to four different charities and your vote determines how much money each organization receives. This is just during this week, so please vote today.http://www.alz.org/news_and_events_21075.asp?utm_source=twitterfeed&utm_medium=twitter&utm_campaign=News&utm_content=Twitter",
        "title": "Please vote"
    },
    {
        "content": "for all your emails and posts lately to everyone.  Carol I think it is great you are going to Disney -- I hope you have a wonderful time.  You're unique that you can look at your situation the way you can -- give your husband a hug from me!",
        "title": "Thanks"
    },
    {
        "content": "to Dr. Glass at the Gerentology Dept. at the University of Georgia for having me over to speak to her class this week.  I appreciate the opportunity and your students were great!",
        "title": "Thanks"
    },
    {
        "content": "Personal mail -- something we don't get very much of anymore.  Most people know I like to make cards and have always been a letter writer.  Young people these days don't understand that and if my son is reading this he is probably rolling his eyes. So, it was very refreshing to receive a beautiful hand written note from a young lady in California.  She had emailed me a few weeks back and she was working on a project for a class on Alzheimer's.  She asked if I would answer a few questions for her via email.  She was very sweet in understanding that I might not be able to answer all of them and to only answer the ones I felt comfortable with.  I did the best I could and this week I received a hand written note from her thanking me for my time.  She could have just as easily emailed me back with a thank you but she took the time out of her day to get a card, write a note and send it to me.  Thank you Kirsten -- that meant the world to me and I hope your project went well.I miss the letter writing.  I don't do very well with it these days so I hope that my cards speak for themselves.  I'm old fashioned that way I guess.Today my husband and I had lunch with a lovely couple. Both of these people had been my son's teachers in high school.  While my son was on the Academic Decathlon team he spent more time with them than he did with us, but considering they went to nationals each year and he learned so much we were so glad he got the opportunity.  And, what great role models they were for him. I couldn't think of two nicer people for my son to be around.  They will always mean a lot to me and to our son.In the last few days several people have asked me about my Alzheimer's and \"where I'm at with that\".  Some people don't want to ask because they really aren't sure how to either broach the subject or they are not sure that I want to talk about it.  But, I respect these people in their approach -- they have started by asking something like \"would it be inappropriate for me to ask about your Alzheimer's\".  That is so considerate and it is nice to know they are interested.  So many people act is if it is like a big elephant in the room and it is so much easier to talk about it than to have it hanging over your head.Our Memory Walk team raised the most money in the state......or at least we did until a company in Atlanta found out about it and matched it!  But, that is good, because more money was raised by them matching it!  A challenge is on for next year!",
        "title": "Mail and friends"
    },
    {
        "content": "I have had the best three days. My husband has been out of town and it has been wonderful. I know that sounds bad, but he knows what I mean. It is so quiet, I don't have to listen to the tv or the radio, I don't have to have a conversation if I don't want to. I'm not as tired when he is gone. I don't realize what a difference it makes until he is gone. But my three days of peace is coming to an end.....I hate it, but back to trying to deal with reality!Another nice thing that happened this weekend that I was invited to Augusta to speak at the Memory Walk. They did a really nice job and had about 1,000 people there. It was a little chilly to start out with but turned out to be a beautiful day. An added bonus was my long time friend, Suzanne went with me and we were able to catch up in the car. I'll post photos when I get them. Thanks to Kathy, Dee Dee and Kimberly in the Augusta Alzheimer's Association office.",
        "title": "Bliss"
    },
    {
        "content": "OK -- I know it's only Tuesday but this week doesn't shape up too well for now.  And, last week wasn't that great either. In the last 9 days a neighbor has died (way too early), two other friends are battling some extreme situations, I didn't have good doctor reports at either the neurologist or the orthopedic doctor dealing with my knee.This weekend (so far) is looking good -- my husband is heading out of town for a few days and I cannot wait for the quiet in my house.  It will give me time to rest and regroup.  However, last night he told me there was a chance he wasn't going.  He is hardly ever gone and I so look forward to when he leaves for a few days.  I'll have to wait and see how things go.I am looking forward also to going to Augusta this weekend.  They have asked me to come and speak at their Memory Walk on Saturday morning.  I haven't been there in a long time and I am anxious to see the staff down there.Hope everyone gets out to vote today.",
        "title": "Not a good week"
    },
    {
        "content": "Memory Walk was this past Saturday and it was a beautiful day. I've posted some various photos but I don't have one of our whole team yet. I'm waiting for someone to send me that! But thanks to my whole team for coming out, raising almost $15,000 for the cause and all those that donated! I love you all!",
        "title": "Memory Walk"
    },
    {
        "content": "appeared this morning on ABC's new program This Week this morning to talk about the Shriver report which I mentioned in my post below.  If you missed it, here is the link -- just click on the Maria Shriver photo for the video.http://abcnews.go.com/thisweekMs. Shriver's complete report will be released on Tuesday October 19th.  The Shriver Report main emphasis is the role women play in Alzheimer's.  I was privileged to be part of this report.  If you care about Alzheimer's -- please get a copy of this, share with everyone you know. The more we discuss this, the better off we will be.She makes some compelling arguments. The government needs to pass the legislation of the National Alzheimer's Project Act (NAPA). We are the only civilized country that does not have a plan to deal with Alzheimer's.  That is sad.  Urge your federal legislature to sign on to this bill. For more information  on this please go tohttp://www.alz.org/national/documents/Alz_Project_Act_2-24-10.pdf",
        "title": "Maria Shriver"
    },
    {
        "content": "Many of you may have some press today about \"The Shriver Report\" titled \"A Woman's Nation Takes on Alzheimer's\". It was released today by Maria Shriver and the Alzheimer's Association. You may know that Maria's father has Alzheimer's and she has championed the cause.There will be a series next week on ABC News about Alzheimer's and it is on the cover of Time Magazine this week. A lot of work has gone into this and you may enjoy reading it.Here is link to the report on the Alzheimer's Association website.http://www.alz.org/shriverreport/index.html",
        "title": "Alzheimer's in the News"
    },
    {
        "content": "My son is coming home the weekend of the 9th -- it will be a quick trip -- less than 48 hours actually, but I'm glad he's coming home. Sometimes you just need to see your kids -- it's been about 5 months since I have seen him and even though that isn't a long time in many ways, it can sometimes seem a lot longer than that. We share October birthdays and we have always tried to be together as close to those dates as possible -- sometimes it works, sometimes it doesn't. But, even if it is for just a short weekend, it will be nice to have him home.Our Memory Walk is less than a month away now. So many people have put so much into it -- I'm just hoping for no rain this year. Last year was the first year we encountered rain and it was miserable.In a few short weeks The Shriver Project will be out. It will focus on Alzheimer's disease and as it gets closer to release, I'll fill you in more about it. First Lady of California Mary Shriver is behind it and a lot of work has been put into the report. I'm anxious to see it come out.It's finally cooled down here in the south -- no more 90 degrees day for awhile.",
        "title": "This and That"
    },
    {
        "content": "Today, September 21st is World Alzheimer's Day.  Give someone you know with Alzheimer's an extra hug today.  The Alzheimer's Association has put out a new report that can be found here regarding Alzheimer's impact on the World.http://www.alz.org/news_and_events_world_alzheimers_day.asp#ReportI've been out of town for a few days and haven't been able to post.  Will be posting photos soon of new arrivals into our family in Illinois.  Got to visit two new precious babies!",
        "title": "World Alzheimer's Day"
    },
    {
        "content": "in posting I know.  Have been busy -- and have a bum knee. Went to the doctor and he has me on crutches for a few weeks.  After already having had a couple of knee surgeries and a broken foot, I'm used the crutches, but I still hate them.  We'll see how things go.Was in Atlanta a few days this week on Alz. business.  Things are gearing up for Memory Walk -- although it is a little over a month away, there is still plenty to get done.  I'm just hoping for no rain this year.USA Today is doing a story on Alzheimer's -- think I mentioned it in a previous post -- it is due out next Thursday the 16th so be watching out for it.  The writer, Mary Brophy Marcus has been working on it for some time and she has certainly done her research. Should be good.",
        "title": "A Little slow"
    },
    {
        "content": "This has not been a good week for me. I've been \"off\". It's so hard to describe but it seems like I am about five steps behind where I should be all the time. I was having an extremely hard time explaining things this week. I was trying to work on a few of my projects around the house and needed some help from my husband. Before I asked him I told him that it wasn't a good day for me and I it was going to be difficult for me to explain what I needed so he just needed to stay with me. He doesn't hear what I am saying most of the time and he caught the part that I needed help, but not the part about my having a hard time explaining what I needed. So of course, we got into a huge argument because he was mad that I couldn't explain exactly what I needed. I got upset, he was mad and it was just not good. I told him I would figure it out somehow -- I have yet to do that, but I can't go back to that scene again! It is just so frustrating to not be able to communicate efficiently. I wonder that as this disease progresses and it gets harder to actually convey anything, that will it be clear in my head and just not be able to get it out? Just not being able to communicate?Lots of little incidents like that happened this week. Then, I happened across something that I shouldn't have and it bothered me. It bothered me a lot and while I can't say what it was, it has played on my mind over and over and I can't reason it out. It's like I'm obsessed with it and can't really do anything with the information. I'm not sure I could explain it to anyone even if I could, but it disturbed me and that has been bothering me.So, I've tried not to ask for help when I don't absolutely need it. I'm frustrated, my husband gets frustrated and then we are at a standstill. I hate this.I've also had a difficult time doing things on the computer this week. I just couldn't get things right. Several people have been kind enough to forward things to me and I wasn't sure that I could get it all down properly so I have waited. Here are a few things that have been brought to my attention.NPR - National Public Radio -- This week a story aired from StoryCorps. To learn more about StoryCorps here is a linkhttp://storycorps.org/initiatives/mliIt was developed several years ago for people experiencing memory loss. It is a way for families to talk with their loved one, share stories of their past and to record a legacy of their life -- among other things. I have known several people that have taken advantage of this and it is a wonderful program. This week this story airedhttp://storycorps.org/listen/stories/robert-patterson-and-his-wife-karenAnother story that ran on NPR was about the early testing for Alzheimer's that has been in the news lately -- I have a related post to that in my blog. Also, USA Today is working on a big story on this subject and it will be out soon. The story from this week on NPR is at this linkhttp://www.npr.org/templates/story/story.php?storyId=129454412And lastly, I received an email from a gentleman by the name of Norrms and he lives in England. He has younger on set Alzheimer's and he has a blog and has written a book. I will admit that I have only glanced over his site, so I can't say much about it at this point. I intend to spend some more time on it when I can concentrate a little better. But, his blog address ishttp://norrms.web.officelive.com/default.aspxI have had several other people contact me this week regarding books, DVD's etc. and I will try to sort through them soon. Thanks for reading, thanks for your comments and thanks for your support.",
        "title": "Foggy Foggy Days"
    },
    {
        "content": "I've mentioned this before but it is so frustrating I could scream.  Twice this week I had a problem shopping and dealing with money.  Everyone knows that I can no longer make change -- and I usually give the clerk a $20 and I get my change back, or I use plastic.  I've been trusting of clerks to give me the correct change, because I couldn't tell you whether they were or they weren't!!!  Anyway, on Monday I went to get my hair trimmed and it was $12.00.  I gave the lady a $20.00 and she gave me $8.00 back.  I decided that I was going to check it -- stupid me.  I kept insisting that she gave me too much money back -- I thought she should have given me $7.00 back -- so I kept giving it back to her and telling her she gave me too much money back -- she was very patient with me and tried to explain several times, counting the money back to me several times.  I became frustrated and she was really patient.  Then I decided that if she insisted that I gave her too much, I must be wrong.  It was so confusing for me.Then today I went to the grocery and although I was using my debit card, I was using coupons.  I didn't think the clerk rang it up correctly with my coupons.  She went over it with me several times and I was holding up the line so I decided not to argue any more.  I'm sure she was right but I can not explain clearly enough what I am trying to say when it comes to the coupons and money off -- it is so simple, yet so hard.  I feel like such a fool.  I don't know why I try -- but sometimes I get that stubborn streak in me that \"I am going to figure this out one way or another\" -- i usually don't and become even more frustrated.  You think I would have learned by now!",
        "title": "Money, money, money"
    },
    {
        "content": "I'm sure many of you have heard about the new article out about using spinal fluid to use as an indicator in diagnosing Alzheimer's. If not, here is a link to the Alzheimer's Assn. page that gives their take on it.http://www.alz.org/news_and_events_statement_regarding_biomarkers.asp.This was an interesting article to me, because eight years ago when I was going through my diagnosis, I actually had this procedure done and these exact things were looked at. My results showed that I had levels of tau and beta amyloid protein that were \"consistent with a diagnosis of Alzheimer's\". A genetic test was also done at the same time and it came back that \"this individual possesses an ApoE genotype that indicates with high specificity that Alzheimer's disease is the cause of or a contributor to the observed dementia. We know that just because one carries this particular gene doesn't mean that you will develop Alzheimer's. Also, the absence of this gene does not rule out the diagnosis either.We will be hearing much more about this study I'm sure. I think my neurologist had these tests done on me because I was so young at the time of diagnosis and this was one more tool she could use. Although during my whole diagnosis the words \"Alzheimer's Disease\" rarely came up in conversation with the doctor, it was looming in the back of my head the whole time. And, although I was bracing myself for this diagnosis, to see the lab results come back with the actual words Alzheimer's, caught me off guard. I was actually seeing some data that said it might be likely. When I received the results of my neuro-psychological exam it said the same thing, I was still a little rattled. But all of that is behind me now and we move on.I just thought that these tests were the norm. But, I do recall talking to others with younger onset Alzheimer's and asking them if they had a spinal tap most of them said no. I guess we will see what happens with this new information.If we can just work as hard now to find a cure.Thanks to those that have made a donation to the Memory Walk in my behalf. It's not too late to do so, you can follow this linkhttp://memorywalk2010.kintera.org/faf/donorReg/donorPledge.asp?ievent=335312&lis=1&kntae335312=B3061F795CDC456CB15F2442D5F61337&supId=48686180",
        "title": "Alzheimer's news"
    },
    {
        "content": "Well, the heat has been unbearable here lately.  And, it looks like high 90's and 100's are in the week to come.  Last weekend, we went to a  professional tennis tournament in Atlanta.  It was 96 degrees and on the tennis court it was registering 140 degrees!  We weren't that far from the court, so you can just imagine how hot we were.  After 10 minutes in the stands, our clothes were soaked through.  When we left our seats and came back, you couldn't sit on them they were so hot.  Thank God they were wood, or we would have never been able to sit down.  Ralph poured some water on the wood to try to cool it down and it actually boiled!!   I know the tennis players are in a lot better shape and much younger than I but I don't know how they do it.  One player did have to get an IV of fluids after his match -- I'm thinking others must have as well.  The newspaper said that there were 39 people in the stands that had to have medical attention due to the heat and several were taken to the hospital over the course of the tournament.Yesterday, we played golf but we rented a cart and didn't walk.  It was still hot, but not bad when you are riding in a cart.I've had a couple of \"writing assignments\" if you will for things for the Alz. Assn. lately and they have been really tough for me.  Getting words out (even doing this blog) is getting harder and harder for me to do.  I know what I want to say, I just can't get my thoughs collected enough to put on paper.  It takes way too long to do it.  Thanks to Alan and Jennifer for being my editors on one piece --- it's so frustrating to me.   I think that is why I haven't been posting much, it is just too hard to get the thoughts out in an intelligent way......people already think you are stupid if you have Alzheimer's ......by reading my writing and it not making sense will add fuel to that fire!So, thanks for reading even I don't make sense some time.",
        "title": "Lazy days of summer"
    },
    {
        "content": "Last March when I was in Washington at the Political Action Summit, one of the things we were asking our legislators to do was to sign on to a bill called the Alzheimer's Breakthrough Act as well as the National Alzheimer's Project Act.  These bills basically asked congress to make Alzheimer's a priority and to ask for $2 billion for research. This week, A bicycle ride is taking place where riders are riding from California to Washington DC to raise awareness for the Alzheimer's Breakthough Act.I'm asking that you please go to this link and sign the on-line petition to support this legislation.  it doesn't cost you anything but a few minutes of your time.  We are hoping for 50,000 signatures and so far we are at 22,000 -- we need your help and it only takes a minute -- to make a big difference.  Here's the linkhttp://www.alz.org/research/breakthroughride/overview.aspThank you!!",
        "title": "Alzheimer's Breakthrough Act/National Alzheimer's Project Act"
    },
    {
        "content": "The USA Today has an article about a couple dealing with Alzheimer's disease at an early age. I had the pleasure of getting to know Marilyn and Steve several years ago when we served on an Alzheimer's committee together. They are a delightful couple and you can read about them here.http://ee.usatoday.com/SUBSCRIBERS/LandingPage/LandingPage.aspx?href=VVNBLzIwMTAvMDcvMTM.&pageno=Mzc.&entity=QXIwMzcwMQ..&view=ZW50aXR5You are probably seeing a lot about Alzheimer's these days in the news. The annual International Conference on Alzheimer's Disease (ICAD) is being held this week. For all the news that is happening please go tohttp://www.alz.org/. Lots of announcements are being made this week.",
        "title": "Lots of news about Alzheimer's"
    },
    {
        "content": "A few weeks ago I told you all about Jan's Story. A book written by Barry Petersen, a CBS news reporter whose wife has younger on-set Alzheimer's. It's a wonderful book. It was a little hard to get through for me because it hit a little too close to home, but it is definitely worth reading. Barry shares his wife's personality so well, that you think you know her quite well all throughout the book. I know it must have been hard for him to write it. A few weeks ago this story aired on CBS Sunday morning. It's a good introduction to the book.http://www.cbsnews.com/stories/2010/06/20/sunday/main6600364.shtml?tag=mncol;lst;2I ordered my book through Borders.  But, you can also order it through Amazon.  If you have a loved one that is dealing with Alzheimer's or you yourself are, please take time to read the book.  It might be hard to get through, but you'll be glad you did.",
        "title": "Jan's Story"
    },
    {
        "content": "This spring when I went to the Political Action Summit in Washington DC one of the things we were asking our congressional representatives was to support the National Alzheimer's Project Act. This Act would fund an office being set up within the Office of Health and Human Services to be responsible for coming up with a Plan to fight Alzheimer's and an interagency Advisory Council on Alzheimer's research and Treatment. Many countries already have an office such as this to coordinate the effects of Alzheimer's disease in their respective countries. We need this to make Alzheimer's a priority instead of brushing it under the carpet.You can help. The link below will send a director message to the Secretary of the Health and human Services agency, Kathleen Sebelius. You just need to fill in the blanks and hit your send key. Please take a moment to do this -- it will help everyone!http://www.kintera.org/siteapps/advocacy/ActionItem.aspx?c=mmKXLbP8E&b=6089303",
        "title": "Need your help"
    },
    {
        "content": "Yesterday, on CBS Sunday Morning, Barry Peterson did a story about his wife dealing with younger onset Alzheimer's.  I can't get the link to work here, but if you go towww.cbsnews.comand click on Sunday morning and the link to \"Jan's story\" you will see it.  It's wonderful.  I've ordered his book and I'll let you know what I think if I can get through it!",
        "title": "CBS Sunday Morning"
    },
    {
        "content": "I've been gone awhile -- I can't believe it has been so long since I last posted -- and I said I was going to do better. We have been to DC to see Jennifer and Alan. I've posted a few photos. We did some things that we haven't done before -- we went to the Kennedy Center and saw a concert, went to Wolftrap to see a show, and we went to the Capitol Visitors Center. I've tried to go there a couple of times and didn't make it. We had a nice visit.The first photo was taken from the old Post Office in downtown DC. We had a beautiful morning with clear skies.  Then two from the Kennedy Center, Alan and Jennifer at the Eastern Market on Capitol Hill, Ralph and I at the Visitor's Center and the last photo taken on the Washington monument as we were paddle boating in the Tidal Basin.  Thanks to Jennifer and Alan for their hosptality.I did o.k on the trip.  Crossing the streets in large cities is a problem for me but I always had someone with me.  And, we had a harrowing experience getting to the airport in time for our flight -- 10 more  minutes and we would have missed it.  Then on the way back we had our planed delayed four hours.  It is always something traveling these days isn't it?We returned to hot hot weather here in the south.  We played golf this morning and I don't know what I was thinking!!! I guess I wasn't -- my concentration was pretty poor and I did awful.  And, it was really too hot to play......but like idiots we did.",
        "title": "Back from DC"
    },
    {
        "content": "As I said in my last post, the NCAA men's and women's tennis tournament is currently in Athens.  I've been going every day.  As someone who has played tennis all her life, I can appreciate the way these college students play since I'll never be able to play that way!  It's been hot out there watching -- it was in the 90's all day yesterday.  But, it is tiring sitting there for four or five hours at a stretch.  Last night going on about the fourth hour of watching the tennis I realized my brain was so tired that I couldn't follow what was going on and I couldn't keep track of the score.  I was looking at the scoreboard but it didn't make sense to me. I had to ask my husband which numbers I needed to look at.....sad -- very sad -- for me.",
        "title": "Long weekend"
    },
    {
        "content": "The Alzheimer's Association has just released a new report regarding the trajectory of Alzheimer's Disease. This is important information -- if we don't do something now, this will tell you what is going to happen. For more information go herewww.alz.org.That is why our fundraising efforts are so important.",
        "title": "New Information"
    },
    {
        "content": "to all of you that have sent emails to me lately, wondering about my whereabouts on this blog.  Sorry I haven't written -- I'm here.  Just having a problem getting my thoughts in order and typing them out.  I seem to have a problem lately with getting my thoughts organized and out whether they are in written or verbal form.  I went to the neurologist last week and he told me that he thought that I had gotten a little worse in my \"delayed speech pattern\". Which basically meant that I was having a hard time getting my words out.  I told him I thought so too, but then he looked at me and said, \"you know, there isn't anything I can do for you\". Which although I know that is true, it's hard to hear sometimes.It's frustrating for me when I can have whole conversations in my head that I want to have with someone, but I can't get the words out.My husband has been gone for about a week.  He's home today.  I know I have said it before, that when he is away and I am home alone, it is so much easier on me.  He knows this too so I'm not saying anything out of line.  I am amazed at how much easier it is -- not from the physical things I usually do like cleaning, cooking and dishes, but mentally.  I find that I can stay up longer at night because I'm not as mentally tired from having someone around all the time. And I get much more stressed when my husband is around, not sure what that is all about, but I would probably be stressed with anyone around --that isn't aimed at him!  My husband doesn't talk much, but he is a pacer -- he paces all over the house during the day. I'll be in one room trying to \"do my own thing\" and he will come in there many many times during his pacing.  Each time it interrupts what I am doing and although he says he doesn't want anything, it's still an interruption in my brain.  It's amazing how these little things will get to me.  And, of course, the noise is an issue -- which it gets worse and worse.  I think I might have had the television set on a total of about 5 or 6 hours during the entire time he was gone.  Counter that with the almost non-stop television set being on when he is home, it sure makes a difference.  He is getting better about wearing earphones with the televsion set, but it is still bothersome.  A friend of mine with AD, just had some custom made ear plugs made that he says blocks out all the noise except for conversations.  He says he can ride in the car with his wife with the radio on and not hear the radio but he can hear her when she talks.  I might look into that. We have finished converting my son's old bedroom into a \"quiet room\" for me and it has certainly been a great place for me to go to achieve some peach and quiet.On another note, my friend Carol and I went to Macon last week to an Alzheimer's fundraiser with the band Diamond Rio.  It was lots of fun to be away together and the concert was really nice.  Thanks Carol -- for being my chaueffer and most of all my friend for all these years -- Sainthood might be up there for you too! Carol will certainly understand this.",
        "title": "Thanks"
    },
    {
        "content": "They always say - it's not how old you look, but how young you feel, right?  Well, how come it aggravates me to no end, that when I go grocery shopping on Wednesdays, they always give me the senior citizen discount, when it doesn't apply to me!!!! It's just the principle of the thing.",
        "title": "The Principle of the Thing"
    },
    {
        "content": "Well, I'm back -- tired but back. The trip was really good -- weather was great and we had a good group from Georgia that went. In all we had 8 people from several congressional districts with us. Our goal was to go to Capitol Hill and ask our leigslatures for increased money for research, a coordinated plan to deal with Alzheimer's nationwide and a better way to improve detection, diagnosis and care planning. Rep. David Scott had already signed on for these things and when we returned we got word that Sen. Chambliss had signed on to the bill representing a coordinated plan to deal with Alzheimer's. We met with Representative John Lewis and he was the most gracious man to us. What a civil rights pioneer he has been and it was a pleasure to meet him. He is also very supportive of what the Alzheimer's Association is doing and gives us his complete support.I'll post some more photos next week -- I'm collecting them from other members that went with us. Thanks to Ginny and Kathy in the state office for setting up interviews and to the national office for putting this together.I have posted one photo on top though. This photo was taken from Rep. Lewis' office -- rather breathtaking isn't it? The reason I am posting it is that to the right (the round corner building) is the building my son works in. I was going to walk from the Capitol over to meet him for lunch and to meet the judge he works for. I've mentioned the fact before that I have a problem crossing the street -- there are too many visual signals that confuse me. But, I didn't really think much about it when going to see Alan. I walked about 10 minutes from the Capitol and got down to the intersection you see in the photo near that building and I didn't know what to do. I couldn't cross the street. There were a few people milling around but they weren't much help. I thought about calling Alan but he said that he would come down to meet me so I didn't have to go through security twice. So, I stood on the sidewalk and waited for him. He finally emerged from the office building and started walking across the street toward me so I walked toward him. I feel so stupid not being able to do this, but it's just one of those quirky things. I wouldn't have attempted to do that if I knew that he wasn't going to be on the other end. I travelled alone to Washington DC but Alan and Jennifer picked me up at the airport and got me to the hotel just fine.I got to meet many folks that I have been corresponding through email or through this blog at the conference. That is always great to be able to put a face to an email address.Diane -- you asked about a scholarship -- I did get a scholarship from national and our state office to attend. I wouldn't have gone without it.I will write more about the conference and add some more photos next week. Thanks for reading.",
        "title": "Back from DC"
    },
    {
        "content": "I'm in DC for the Alzheimer's Political Action Summit. Last night we had a candlelight vigil and David Hyde Pierce was there. We had 11,000 people also join us at the Lincoln Memorial on line through the virtual candlelight vigil as well. Alan and Jennifer joined us and Jennifer shot this group shot and then someone got a shot of them with the Washington Monument behind them. Today we had a luncheon that honored Social Security Commissioner Astrue for his work on adding Early On Set Alzheimer's to the Compassionate Care Allowance. It's been a good meeting so far -- we are off to Capitol Hill for talks with our legislatures tomorrow,",
        "title": "Political Action Summit"
    },
    {
        "content": "It's been a busy time -- we just returned from Florida, and I'm headed to Atlanta for a few days and then off to DC to the Political Action Summit the Alzheimer's Association is having.  I'm doing it pretty much alone (traveling alone) but since my wonderful son in Washington DC I know he will look out for me.  I need to remember to pace myself though as I get so tired so quickly.I'm anxious to get to DC to see many of my Alzheimer's friends -- I \"talk\" to them a lot over email but it will be nice to see everyone and see how they are doing.  And, the staff is so great and accommodating that it will be nice to see them as well.  Our state delegation will be heading to Capitol Hill on Tuesday to see our legislators and to ask for more money for research. There is so much more to be done.I'll try to post while I'm away.",
        "title": "Busy Time"
    },
    {
        "content": "We just returned from a few days in Florida -- where it was nice and warm -- in the low 80's. We returned and this morning it was 24 degrees outside!We first went to Gainesville where we saw our beloved Lady Bulldogs lost to the University of Florida in basketball. A disappointing loss to say the least.Then we headed about four hours south and went to Ft. Myers. My first cousin Laura and Ken live there six months out of the year (the other six months in Wisconsin). I hadn't seen them for many years and we decided that since we were that far south we would go the extra miles and visit. We had a great time and I want to thank them so much for showing us around and being so gracious with their time. A few photos are posted on top -- Ralph and I by a banyon tree on the grounds of Thomas Edison's estate in Ft. Myers along with a few other photos from there. We also went out to Captiva Island and Sannibel Island. The homes there were gorgeous -- it kind of reminded me of a cross between Martha's Vineyard and Hilton Head!Several things I saw there that I had never seen were a cinnamon tree and an allspice tree. I guess I never knew those spices grew on a tree -- had never really given it much thought but was surprised by them.Thanks again to Ken and Laura for our royal treatment!Another thing, I went to Florida with only one of my two Alzheimer's medications -- I forgot them -- imagine that.  I did ok since it was only a couple of days, but I'm glad I wasn't alone!",
        "title": "Florida"
    },
    {
        "content": "This is something that we have been fighting for for a long time!  Great victory for Young on-set Alzheimer's patients.  Social Security disability earlier. See details herewww.alz.org.",
        "title": "Great news!"
    },
    {
        "content": "Well, I'm glad I'm not living in DC like my son and daughter-in-law. I am too old for all that snow -- having been a former midwesterner I've \"been there done that\". But I told my son that he will be able to tell his grandchildren about this storm. My daughter in law Jennifer has taken some beautiful photos of the snow and I have posted a few here. The government has been shut down again today -- but Alan has still been going to work.",
        "title": "Weather"
    }
]