[
    {
        "content": "to everyone.  Thanks for all your cards, messages and letters this holiday season.  I have had so many thoughts of what I want to write in this blog since Christmas that I can't get them all organized.  I hope to do that soon.In the meantime, my best to you for a great New Year.",
        "title": "Happy New Year"
    },
    {
        "content": "From our family to yours!",
        "title": "Happy Holidays!"
    },
    {
        "content": "It's Christmas Eve and we have just finished a great meal with Alan's fiance, her sister, and her parents.  It's nice they were able to share some time with us.Tomorrow, our Christmas morning, will be the last one with just the three of us.  Next year, Alan will be a married man and he will be starting his own Christmas traditions.To all of our friends and family -- we say -- the happiest of holidays to you.  Thanks for reading my blog this year and your sincere comments, support and love you have shown me and my family.  I love you all.",
        "title": "Christmas Eve"
    },
    {
        "content": "I have tried to sit down and write something all week but every time I do I have so many thoughts that I can't sift through them all.  So, I get up from the computer desk and don't post anything.  But this morning, I decided to post even if some of the things I am writing don't seem to make sense.  I just need to get them written down.1. My son came home this week.  It is so nice to have him home.  We laugh a lot when he is here and I miss that.  It's a little harder for me to concentrate when he is around because that is one more person in the house that I am not used to having around, but I'll take it anyday if I can be with him.2. I have been amazed at some of the cards, notes and gifts that have been appearing on our doorstep.  I love getting cards at Christmas and yes, I am one of those people that love getting the Christmas letters from everyone.  I forget what is happening in their lives during the year and it is always so nice to catch up with what they have going on.  This year, when I sent out my Christmas letter, I decided to spare some people from reading it, so I didn't enclose a letter in many cards because I just figured that they might not care what is going on in our household.  How wrong I was -- I have gotten several cards and notes from people saying,  \"we missed your letter this year and what is happening in your life\".  That kind of shocked me but I should be pleased that friends are interested in us.  I suppose many thought perhaps my illness prevented me from writing something this year.  And, it was definitely hard for me to come up with something but I did.  I will follow up with these friends later.  And, thoughtful gifts, from people I never expected to get something from have arrived, with basically, a thinking of you message.  Friends are so important and I love everyone of mine!3. My on going struggle with Social Security is back in the picture.  The social security office is now ready to work my case.  I got a letter from them and my attorney asking for all this information \"immediately\". Of course, getting it over the Christmas holiday and trying to track down the records \"immediately\" might prove to be a little difficult.  And, I certainly would have appreciated them looking at my files \"immediately\" instead of almost 30 months after they were submitted!4. I've got to try to get into the dentist today.  There is definitely something wrong with my teeth -- it is very weird -- I can't pinpoint the problem but I feel like all of my teeth hurt. I know that sounds funny, but that is the only way to describe it.  I'm not sure if he can help me, but I'm hoping maybe he can give me something for the pain to get me through Christmas.5. Going back to the cards -- one thing that certainly humbled me, was that an agent I used to work with when I booked performances sent me a card.  She left the business several years ago when she had a baby.  But, on the back of the envelope of her card, she put a note saying that I had inspired her and to read her Christmas letter - she hoped I didn't mind.  After opening the envelope and reading her first paragraph, I was touched.  She told her friends that she wasn't going to write a Christmas letter this year, but after reading mine and realizing how important mine was to her, that she decided to write one.  We became friends even in our crazy business days that I truly admire her.6. Tomorrow, I am going to meet my two \"surrogate sons\" as I have called them in previous blogs.  These two young men worked for me and I went to one of their weddings this year.  I had posted a photo of them on my site last summer.  One is in the army in Texas and another works in Pennsylvania. They will both be home for Christmas and we are getting together for lunch.  They are about a year older than my son and I have really enjoyed getting to know them not only as employees but as individuals.  We have shared many a laugh together.  The other one is getting married this year, and unfortunately he is getting married the same day that my nephew is gettng married in Illinois so I won't be able to get to his wedding.  The Army is sending one to Iraq come July.  It will probably be a long time before the three of us are together again since I won't be at the wedding.  Just like my son, I hate that they are not close by. I enjoy being around them and I am grateful they have kept me in their life.OK -- Ineed to stop now.  I realize much of what I have written probably doesn't mean much to most people but it does to me.  But thanks for reading.  If I don't get a chance to post again before Christmas --- my very best to everyone for a safe and happy holiday!",
        "title": "Long post!"
    },
    {
        "content": "My friend Rich from LA sent this article regarding Social Security Disability. It's so sad that people are having to go through this!http://www.nytimes.com/2007/12/10/us/10disability.html?_r=1&hp&oref=sloginOn a lighter note -- next week my son will be home for Christmas.  I'm looking forward to the laughter he brings to the household.",
        "title": "Disability"
    },
    {
        "content": "I'm here -- I've just had to slow down a little.  I have managed to wind up withpneumonia so I've been resting.  The doctor gave me some antibiotics and some cough medicine which I think have helped.  I've certainly been sleeping a lot.  I'm trying to push myself a little to do a few things, but I get tired very quickly.  I was due for some down time, but I'm not sure this is what I thought it would be!",
        "title": "Slowing Down"
    },
    {
        "content": "has a great program called \"The Infinite Mind\".  A friend that is on our Early Stage Advocacy Group is interviewed as well as Peter Reed from the National Alzheimer's Association.  The program is an hour long, but worth listening to if you have the time.James is a great person.  He and I have spoken a couple of times together at conferences.  He was in charge of the IT program for American Express when he was diagnosed with Early Stage Alzheimer's.  James has two daughters that go to Northwestern University.  He has a great sense of humor, and although we consider him a \"techie\", he is very outgoing and a great speaker.  I love his analogies when he speaks and I think -- why couldn't I have thought of that!Here is a link to the programhttp://lcmedia.com/mindprgm.htm",
        "title": "American Public Radio"
    },
    {
        "content": "My trip to South Carolina for the Town Hall meeting was good.  I got to meet some new people but, as always there is never enough time to talk to everyone.  There were about 100 people at the Town Hall meeting.One of the speakers, was a lady from South Carolina who has early stage Alzheimer's.  I enjoyed laughing with her as she talked about her ways of coping.  One thing she said she did as soon as she was diagnosed was to go and put names on the back of all of her photographs so everyone would know who they were.  I did that exact same thing!  That is what led me into doing scrapbooking.  We are all so different in how the Alzheimer's affects us but it seems like we respond in so many like ways.Before I left on Saturday I was writing some notes to people, and I just couldn't spell.  Every five minutes I was asking my husband how to spell things -- and I am a good speller.  I haven't figured out how to use the spell check in the blog program and since I have such a problem with synonyms (sp?) it wouldn't tell me if I was using the right word.  How frustrating this is to me.  It's getting much worse.  I have to write and re-write just to make sense of what I am trying to say.  And, if you are reading this I am sure at times you become just as confused as I do.  I've also noticed that it is getting more difficult to type correctly.  I've always been a very fast typist and I realize I make a lot more mistakes now.  It's so frustrating I tend to scream about it at times!I've managed to catch a pretty good cold.  I've been sleeping most of the day.  A few more days of rest is what I need.More soon -- thanks for reading!",
        "title": "The weekend"
    },
    {
        "content": "Here is a photo of our Memory Walk Team. Thanks to everyone, we raised over $15,000.00!",
        "title": "Memory Walk Team"
    },
    {
        "content": "This week has been a long one.  There is so much to write that I have been putting it off.  But I decided that this weekend's adventure to South Carolina for the Alzheimer's Town Hall meeting would be a separate entry so I thought I should go ahead and fill in the rest of this week.Several weeks ago when I was going to Chicago to speak, I took the airport shuttle from Athens to Atlanta.  There were 10 women in this shuttle (poor driver) and of course you can imagine there was a lot of talking!  Someone asked me what I was going to Chicago for and I said a meeting.  Then she asked me what kind of meeting.  I told her.  Then she asked me why I was going to the meeting. I told her I was speaking.  She asked me what I was speaking about and I told her.  As always, that opens up a new conversation.  And, as always, most everyone knows or has someone in their family with Alzheimer's.  The lady asking me all the questions had a mother with the disease and the lady sitting next to me had a brother (age 64) with Alzheimer's.  He was in an assisted living home.  Obviously, the topic revolved around Alzheimer's for the rest of the ride.  I kept noticing that a lady in front of us kept turning her head to listen in on the conversation.  Eventually, she turned around and joined us.  Turns out she is with the Gerentology Dept. at the University of Georgia.  She had participated in our Athens Memory Walk.  She also asked me if I would come and speak to her class.This past Monday night, I went to Dr. Glass' class and spoke.  What a great experience it was.  The head of the department, Dr. Poon, spoke before me and talked of his research with Centenarians.  It was very fascinating. The class was a graduate level class and the students varied greatly in what fields they were heading into.  I enjoyed speaking with them and I am hoping that I will continue to be in contact with them and they can possibly help in some future fund raising opportunities for Memory Walk.  I really appreciated the opportunity to visit with them and to get to spend some time with Dr. Poon.  We talked a little about the \"cognitive reserve\" that I have mentioned in my blog several times.  He thought it would be useful to keep track every day of where \"my tank\" was on reserve and to highlight the reasoning behind it.  I think it is a good idea, I just haven't gotten around to start logging it yet!Going back to Chicago, a very similar thing happened to me as I was sharing a cab to the hotel with a lady from Boston.  She asked me a lot of the same questions the lady in the van asked me and eventually asked me to come to Boston to speak to a group of people.  She evidently works in the field of health care with an emphasis on aging.  She thought it would be interesting to get some of her staff and associates together to hear what I had to say.  Interesting how these things come about.Earlier this week I went to Atlanta to visit with the Alzheimer's Assn. Chapter President, Jan Bequeath.  After eleven years with the Association she is stepping down at the end of this month.  Jan has been someone I have admired both as a friend and a leader.  Her staff has always been there for me and she will be sorely missed.  I wish her well.  That same night I attended the \"Better Start Living\" concert -- it was a benefit concert for the Alzheimer's Association at a new venue in Atlanta.  Song writer Monte Powell started organizing this about a year ago.  Monte is a prolific writer and has many many No. 1 songs for country artists across the board.  His family has been affected by Alzheimer's and he wanted to do something to help raise money.  One of the performers he writes for is Keith Urban, so he invited Keith Urban to town for an acoustical show!  It seemed to be a success and I hope a lot of money was raised.  There will be other \"Better Start Living\" concerts to come -- possibly to a town near you!All of my cognitive reserve was completed by yesterday.  I got home from Atlanta and I think I slept the rest of the day!  I was pretty out of it.  I'll rest some more this morning and then this afternoon I'm off to Spartanburg SC for the Town Hall meeting Saturday morning.  Someone from the Chapter office is driving me over there so I shouldn't have to call on \"that reserve\" until this evening when I meet with the staff from Chicago and Washington DC for dinner.  I'm excited about the Town Hall meeting tomorrow.  I hope the turnout will be good.More when I return.",
        "title": "Lots going on"
    },
    {
        "content": "I have an Alzheimer's function to speak at on Friday morning so I am off to Chicago in the morning.  It is suppose to be 41 degrees with 23 mph winds.  That is a little chillier than Athens this time of year!Had another meeting in Atlanta this week.  As I said in my last post, I'm tired.  Next week there isn't too much going on for Thanksgiving so I'm looking forward to resting and getting caught up on some things around the house.More when I return from Chicago.",
        "title": "Off to the Windy City"
    },
    {
        "content": "I had a bad day yesterday.  I have been out of my routine for several days and I am tired.  I was anxious the whole day -- fighting off panic attacks. I have lots of undone projects and feeling stressed to finish them when I have plenty of time.   My words weren't coming out right and I had a very hard time concentrating.  I need to slow down a little and get some rest.",
        "title": "Bad Day"
    },
    {
        "content": "Sometimes I feel overwhelmed.  It used to take a lot to make me feel that way but not anymore.  There are lots of loose ends on some projects I am working on and that is always unsettling to me.  And, the loose ends are because I am having to wait on others to tie them up.  I hate that -- I'd rather do it myself and know that it is done.  I'm not a procrastinator and those that are drive me crazy.  I also don't like people who are late -- but that is a whole different blog subject!Anyway, this week we have our wrap up meeting for the Memory Walk.  We are still taking in money but I'm not sure we are going to make our $75,000 mark.  We'll see.  I also have to go to Atlanta for another Alzheimer's meeting.  I'm working on a speech for a meeting in Chicago the week after that.I'm also starting work on another project with some colleagues from the Early Stage Advocacy Group.  It will be some work but something to look forward to.  I only hope that I can contribute as much as everyone else does.  I feel inferior sometimes when working with this group as they are all so accomplished, driven and intelligent.  My husband keeps telling me that I fit into that category but I don't think I do.  Perhaps I don't feel as focused because I have been fighting this disease for five years. I'm not sure what the reason is but I know that a lot of work still has to be done and I'm willing to do my part as best I can.",
        "title": "Busy Week"
    },
    {
        "content": "I know I haven't posted in awhile.  I've been kind of lazy and tired.  I finally got caught up from the Memory Walk and then I was off to Atlanta for a couple of days.  I'm also working on a couple of projects for the National Alzheimer's office so that is keeping me busy.My friends from the Early Onset Advocacy Group, held their Early Memory Loss Forum last weekend in LA and from all accounts it was a huge success.  You can read about it here -www.alzforum.org/new/detail.asp?id=1675Hopefully, other chapters will pick up the ball and continue running with it.It has turned cool here in the south finally.  The leaves are starting to turn but with the drought we have had this year they are not so colorful.  We are going to play golf today and I'm not sure how many balls we will lose in the leaves!The UGA women's basketball season opens up tonight with an exhibition game.  As you know from following this blog I'm a big fan.  Our team is ranked #10 in the pre-season polls.  We have lots of players this year -- it seems like we are always low in numbers because of injuries, but hopefully we will remain healthy this year.  I do have my problems going to games though. Some days I can't go because of the noise.  It is way too distracting to me.  Sometimes we have to come home early because I can't deal with it all.  I try -- I really do but it many times just too overwhelming.  A friend of mine who recently retired has talked to me about going to some away games with her and the prospect of it sounds great -- I am just not sure how many of those games I can do.  However, the crowds at the arenas around the league are not as large as our crowds (except a couple which we wouldn't be going to anyway) so it might not be so bad.  My friends are getting used to traveling with me so that is good!Next week I'm off to an Alzheimer's meeting in Atlanta and then off to Chicago for a few days the week after that on Alzheimer's business.  I will try to enter a little more frequently.",
        "title": "I'm here"
    },
    {
        "content": "The piece on Spencer Johansen was great on NBC Nightly news. I hope you got a chance to watch it. If not, please check it out on their website athttp://www.msnbc.msn.com/id/3032619There is a little more on the website.I think they did a good job and Spencer did a great job.  Hopefully we will see more of this type of coverage in the weeks and months to come.As always, I'm asking you to send feeback to NBC nightly news thanking them for their coverage.  Emails can be sent to nightly@nbc.com.",
        "title": "Nightly News on NBC"
    },
    {
        "content": "of Rich's interview is now on Alzforum.  Here is the linkhttp://www.alzforum.org/I have heard from many of you that you have enjoyed reading about Rich and his \"adventures\" -- my word, not his!  I really like the part about reading the headline in the paper and not being able to undertand it.  This happens to me all the time.  I hate it!  And, then having to re-read the articles to have them make sense.  I don't do movies anymore either -- too hard to follow.I really appreciate Rich putting into words what some of us cannot.",
        "title": "Part III"
    },
    {
        "content": "on Monday night (Oct. 22) is suppose to have a feature on one of the members of our Early Stage Advisory Group -- his name is Spencer Johansen.  He is still working as a police chief in the small town of Lexington Illinois.  Not far from my home town in Illinois.When Spencer announced he had the early stages of Alzheimer's and announced it to his community they were very supportive.  The media has taken a look at this and wants to discuss the fact that he has alzheimer's and carries a gun.  We'll see how the news piece handles this.Please watch if you can.",
        "title": "NBC Nightly News"
    },
    {
        "content": "Thought I would share a few photos from yesterday. The weather was beautiful!",
        "title": "Memory Walk - 2007"
    },
    {
        "content": "The Memory Walk was today.  It was a great day -- lots of people and the weather was beautiful.  We had over 450 walkers registered before the day started, $45,000 raised before the day started and 39 teams.  I don't know where we ended up money wise but we'll know soon enough.  The goal for our walk was $75,000 and I think we will make that.  It was a great event.  Having said that -- I'm glad it is over.When I came home I told my husband my body and my brain were so tired I didn't know what to do.  I rested, took a good nap, and rested some more.  It will take my brain a few days to recover.  I bring this up, because there has been much discussion lately about \"cognitive reserve\".  I never really knew it had a name, but I figured that someone would come up with it.  It is where you can store up all this brain power for something and then it is shot and gone for several days.I am putting a link in here that I hope you will all read if you are caring for someone with Alzheimer's -- or have it yourself.  Rich Bozanich is a friend from California that serves on the Early Stage Advisroy Group with me.  Rich is a journalist and can put into words so eloquently what I can't.  The Alzforumhttp://www.alzforum.org/has an interview with Rich that to me is amazing.  The interview is going to be in five parts with the first two posted at this link.  Rich and another college Jay Smith have worked tirelessly for the last 15 months to put together an early memory loss forum in Los Angeles.  It is next week and it is sold out with 350 people signed up.  They've done a great job in putting this together and I know that they will be totally exhausted when it is over.  Many people will be better off having attended this seminar I know.  I wish I could be there with them, but they know I am there in spirit.  Please take a few minutes to read Rich's interview.  It is very enlightening.  I hate it that my words don't come out like Rich's -- but at least someone can do it!   I especially like Rich's comments in the second part of the interview when people are trying to make themselves feel better by trying to make you feel better.  I kind of had to laugh out loud because we have all been there.  Thanks Rich!Hopefully I can get my brain wrapped around a few more thoughts and write some more about the walk soon.  My team did a great job -- they raised almost $15,000 and we still have money coming in -- so we might make it yet.",
        "title": "Cognitive Reserve"
    },
    {
        "content": "You might have read an article about a new blood test designed to detect Alzheimer's much earlier than can now be done.  It is going through testing and is expected to be on the market by 2009 and if everything goes well.  One member of our National Advisory group was on CBS news last night in relation to a story about this new test.  He did a great job!The national office called me yesterday to see if I could do an interview with ABC news, but I had to make my way to the ABC affiliation in Atlanta in exactly three hours from the phone call.  At the time of the day they called me if would have taken me too long to get ready and to get to Atlanta during rush hour traffic to make it, so someone else was called to do it.  The networks sometimes don't give the national office a lot of time to react.  Luckily, there are many on our advisory group that live closer to a large city where this can happen.Here is a link to another story popular yesterday -- this discusses several different things in the pipeline to help us.http://www.msnbc.msn.com/id/19177355/",
        "title": "Lots of News on Alzheimer's"
    },
    {
        "content": "It's been a busy week.  I think I have one more busy week this week and then I can coast for awhile.Thanks to all who called me this week or sent emails.  I appreciate your thoughtfulness and remembering me.  I haven't gotten around to returning a lot of the emails but I will!I've been eating way too much lately and have to get back on the wagon.  When it gets a little cooler I turn to comfort foods and those are not always as healthy as they should be.Many of you have been asking if Alan and Jennifer have set a wedding date yet.  There's no long answer -- the short of it is no.  I'll be sure to let you know when they do.Have lots of meetings and planning for the walk yet to do this week.  Saturday is our big day.  My team -- Team Athens has raised over $10,000 now and I think that we'll top out over $12,500 -- or at least that is what I am hoping for.  We are suppose to get some much needed rain later in the week -- and if it rains on Saturday that will be o.k. -- because we need the rain so much.",
        "title": "The Week"
    },
    {
        "content": "The weather has finally turned a little cooler and hopefully it will stay that way for awhile! It was nice to have the doors open today and actually feel a little chilly!The photos above are from the trip I took with my friend Carol to Nashville last weekend. We had a great time -- it was nice to get away. But, I realized on the trip how much I rely on my husband these days. He can pick up when I need help and steps right in. I felt bad having to ask Carol to count my change out for me at a restaurant or to steer me in the right direction when we were going somewhere. She is a true friend let me tell you!Things are gearing up rather quickly for the walk.  It will be here in about 8 days.  Our team, Team Athens has raised almost $10,000 and we will have met that total and more by the time the walk rolls around next weekend.Next week, is another conference call with the advocacy group that I am on from the National Alzheimer's office.  It is exciting to hear all that is happening out there and how engaged the whole group is in their work to help fight this disease.  I know that several major news outlets are planning some stories about Alzheimer's in the coming months. That's about all I can say about that for now but I'll be able to report more later.Ralph and I just returned from S.C. where we played golf at a state park.  It was enjoyable but after a few holes I lose my concentration and it gets difficult.  But I enjoy being outside and it was a beautiful day. Since my golf isn't that good to begin with I always say it is just another \"walk in the park\" for me.",
        "title": "Cooler Weather"
    },
    {
        "content": "I've been gone for a few days with a girlfriend for a girls weekend away.  We went to Nashville and had a great time.  I'll write about that later -- I need to rest up!But, I did want to bring a few things to the attention of many of you who read this blog on a regular basis.Two colleagues of mine that serve with me on the Early Stage Advocacy Group are doing something pretty special.  They are organizing an Early Stage Alzheimer's Conference in Los Angelese, CA on October 27th.  The LA Times had an article about them this week and I have posted the link.  (you will need to register for the LA Times but it is free). The link ishttp://www.latimes.com/news/printedition/california/la-me-dementia30sep30,1,6421737.story?page=2&coll=la-headlines-pe-californiaFor more information about the conference you can go towww.alzla.org/earlystageforumIt's only $25.00 for those with the disease and $75 for professional caregivers.  If you are in the LA area and can attend this event I urge you to do so.  Rich and Jay know what they are doing and I know that you would find it valuable.Another event that is a few months away is the next Town Hall meeting put on by the National Alzheimer's Association.  This Town Hall meeting is meant and designed for people that have Early On-Set Alzheimer's.  The meeting is being held on December 1st in Spartanburg, SC. I attended one of these in Chicago and it was great.  For more information on this meeting go tohttp://www.alz.org/townhall/and register.",
        "title": "Events"
    },
    {
        "content": "I know you have all read my rants and raves about my social security disability ventures.  Well, nothing has really changed, I'm still waiting to see a judge for a hearing.....it has been over 24 months we have been waiting and still don't know when we'll get our hearing.  I was just informed of a new bill being introduced by a Congressman from New Mexico, that will change the two year waiting period for those on Social Security Disability to get Medicare.  I know that I have heard from many of you on this subject through email and your comments.Thought you might like this link so you can follow its movement in the house and senate.http://bingaman.senate.gov/news/record.cfm?id=284284",
        "title": "Social Security/Medicare"
    },
    {
        "content": "My husband has been gone for a few days visiting his brother in St. Louis.  I cannot believe what a difference having him gone has meant to me.  This isn't suppose to sound bad, although I know when you read it, it will  sound that way.  I forgot what it was like when he wasn't around all the time.  I am not as tired as I usually am.  I think that not having to deal with him all day really makes a difference.  And, by \"dealing with him\" I mean, just having him around talking to me, having the television set on most of the time and knowing that my brain should at least be engaged all day takes a toll on me.  I don't think the television set has been on at all since he has been gone other than to watch the Georgia football game on Saturday.  The constant noise of the television wears on me.It wasn't so bad when my husband was working because I could have all that quiet time to myself during the day.What a difference a little noise makes!",
        "title": "Peace and Quiet"
    },
    {
        "content": "We returned from Washington DC and I'm still trying to process all the information from the meeting we attended.  I'm not sure how much of the information we learned is proprietary so I don't want to say a whole lot at this time.The meeting had a lot of heavy hitters in the room and the topic was basically about trying to get a handle on what everyone is doing in the realm of dealing with Alzheimer's and how we can work together.  I was privileged to be there and am thankful that they solicited the input of those with the disease and the families that are caring for them.  I know that this is just the beginning and with the energy in the room I am hopeful that a lot of minds will be working on how we move forward at this point.Ralph is leaving for St. Louis today to visit his brothers.  I'll be working on some Memory Walk projects while he is gone.  And, resting -- I can't believe how long it takes me to get back to what I consider \"normal\" after a trip.",
        "title": "Washington DC"
    },
    {
        "content": "I'm sure my son is going to read this and figure that this post is for him. But, it isn't.  I'm still in Illinois visiting my brothers but will be heading home later today.  I have been able to see lots of folks that I haven't seen for awhile.  While visiting, there seems to be a theme in what we talked about -- disappointment in things not going the way people were hoping for.It's hard to understand why some things don't go our way.  I've never been real religious but I do believe that things happen for a reason.  Or at least, in my life I believe they do.  It might be hard to see at the time, but later on I have been able to look back at things and realize why I didn't get a certain job, a certain grade, a certain opportunity.  It might have been a few days later, a few months later or even a few years later, but the reason has always presented itself.  In talking with friends here (as well as my son this week) they have shared some disappointment in something not going their way.   Most of the time, when things have not gone my way, it has been for the better.  I wasn't always happy about it at the time, but when looking back it definitely was for the better -- I wouldn't have had a chance to meet some people, or to make as much money or to be happy.I've often written about my husband being very pessimisstic.  His response to that is \"if I don't get my hopes up about something,  then I won't be disappointed if things go bad.\" I'm not sure that is the right way to look at things, but each to his own I guess.I think you have to be positive and then live with what happens as bad as it might hurt or not feel right at the time.  Everything is not going to go your way every time.  You just have to hope that you can handle what is thrown at you.  I certainly didn't want to get Alzheimer's -- but it has happened for a reason and I accept that. I don't see many other alternatives at this point so you make the best of it.  I've certainly grown as a person and value my time with my friends and family so much more.I think, too, that we have to learn from all of these opportunities.  It certainly won't be the last time we are disappointed by something and hopefully the next time it happens you will be ready for it -- or at least realize that it is not the end of the world.  Learn from it and move on.  Life is way too short.",
        "title": "No son, this is not for you"
    },
    {
        "content": "Boy it sure took me a lot longer to recuperate from my trip to Chicago.  I was so tired after only being gone a few days.  It has been hard to get back into my daily routine -- thought I was coming down with a cold, but it just turned out to be exhaustion.  I'm traveling to central Illinois to visit my brothers at the end of this week, but I know I will have more downtime than when I was in Chicago so hopefully, that will not be as bad.I went to the UGA football game last night.  We don't have season tickets, but a friend of mine called and had an extra ticket so I was his date.  I haven't been to a game for a couple of years so it was nice to go.  Some friends of mine that go to every game gave me a ride and stayed with me until I caught up with my friend.  Then my friend walked me back to a meeting place for my ride home so I wasn't alone.  The stadium was sold out which means over 92,000 people were in attendance, so I was glad I wasn't alone!  I really got tired after the half and it was hard for me to follow the game.  Having the game in the evening was also hard for me because I'm not at my best in the evening.  But, I'm glad I went -- it will probably be the only game I go to all season and it was a nice night for a game.  And, we won!",
        "title": "Long Week"
    },
    {
        "content": "We returned late last night from Chicago where we had our first meeting of the Early Stage Advocacy Group for the Alzheimer's Association.  Fourteen people with Early Stage Alzheimer's had been selected to serve on this committee.  We have had a conference call to get to know each other a little better, but this weekend was the first time that all of us actually got to meet each other (except one who had another committment).  I was not sure what to expect.  Let's say that I was overwhelmed at the other people on this committment.  What top notch people to be serving on an advisory board such as this.The committee is composed of three women and eleven men.  We have retired architects, doctors, IT specialists, banking and finance executives, artists, musicians -- you name it.  I'm not sure that I quite measure up to everyone but I'm certainly going to do my best.  I was so impressed by this group and I am certainly honored to be among them.One of the members of our committee is still working and he is a police chief in a small town in Central Illinois -- not far from where I am originally from.  He is very articulate.  He has gotten a lot of national press because there is curiosity out there about him having Alzheimer's and carrying a weapon.  I would be more than happy to rely on him for my defense if I ever needed it!And, he said, after one of our meetings, that he felt that he has found a whole new community and lifelong friends after meeting for just a few hours.  I whole heartedly agree with that and am certainly looking forward to working on the tasks put before us.Those tasks will be many as there are things to be looked at like advocacy work, programming and awareness.  I appreciate the Alzheimer's Association so much for asking us to do this and getting our feedback.Now as to the bad news -- A new drug called Alzhamed has been in clinical trials for some time and many of us have been hoping that this drug would be a big breakthrough in treatment.  The optimistic side of this drug was that it had the potential to help slow the progession of Alzheimer's.  Well, the trials have not shown these results and basically the drug is not an option.  There are some other drugs in the pipeline, but much further down the pipeline -- we were all hoping for such great things. It's very sad news.Here is a link to a news story about ithttp://www.reuters.com/article/health-SP/idUSN2638111620070827",
        "title": "Great meeting and bad news"
    },
    {
        "content": "The heat is still here.  It's hard to do a lot when it stays in the 100 degree mark every day.  Hopefully, next week we will get some relief.I am getting ready for my trip to Chicago next week for the Early On Set Advisory group meeting.  I'm really anxious to be able to meet everyone. All of my other colleagues sound so ambitious, I hope I can keep up!Memory Walk work is starting to heat up as well.  Although our walk isn't until October, it is amazing how quick it will be here.  I hope you have been seeing all the advertising the national office has been doing on the Memory Walk.  It certainly has generated some interest.My son and his fiancee and her parents are visiting this weekend.  We haven't all been together since last December, when my husband fell and broke his elbow while we were ice skating.  It will be nice to see everyone again.  My son finishes his internship up next week in Atlanta and will be heading back to California for his remaining year in law school.  The summer has certainly gone quick.",
        "title": "The Same"
    },
    {
        "content": "is awful.  I know it is hot in many places. Today it reached 105 degrees in Athens, GA -- a new record.  I think it is suppose to be just as hot tomorrow.  The heat is getting the best of me.  We went out and played golf a few days ago. We walk the course because we like the exercise.  We finished up around 12:30 and it was close to 100 degrees at that point.  I don't know what we were thinking -- I guess we weren't thinking if truth be told.  The heat never used to bother me much -- but I certainly feel it now.I guess the \"lazy days of summer\" will continue for awhile.",
        "title": "The heat"
    },
    {
        "content": "My \"word\" problems are really annoying me. I have posted before that I am having problems finding the right words, understanding things I read and using the wrong words. I've noticed lately that I have a real problem with words that sound the same but are spelled differently and mean different things -- I can't remember the name for these words -- for example, meat and meet, right and write -- you get the idea. I know the word I mean when I write it (I had to think about that) but I'm not sure which is correct after I put it down on paper -- see how I avoided that? I will use the tools on the computer sometimes to check myself, and the last few times I was wrong. It's so frustrating when communications has meant so much in my life. So, chalk it up to this disease if you read something silly I've written.On another note, the Alzheimer's Association is hosting some \"Town Hall Meetings\" about Alzheimer's. The first one was last week in Oakland California. I will be part of one in Chicago at the end of the month and there will also be one in Spartanburg, SC and Washington DC. If you are close to any of these areas I would encourage you to attend. Here is a link to the Alzheimer's website that tells you more about it. -- it's important for us to keep the dialogue open about Alzheimer's.http://www.alz.org/news_and_events_townhall.asp",
        "title": "This and That"
    },
    {
        "content": "I wrote several weeks ago about my acceptance into an Early Stage Advocacy Group out of the national office of the Alzheimer's Association.  Well, last week, we had our first conference call that consisted of Alzheimer's staff as well as the fourteen people that comprise the group.  All of us have Early Stage Alzheimer's and the majority are Early on-set (under the age of 65).  It was interesting to hear their stories and to share our thoughts.  We will be meeting face to face at the end of August at a meeting in Chicago.  I'm anxious to meet all of them as we all share the passion to do what we can to help fight this dreaded disease.Our role will be to act as advisors to the Association as well as to be national spokespeople for the cause.  It seems we are all rather out spoken and we each have our own little niches that we interested in.  Many are interested in helping to educate the medical field more about what we go through, some are intersted in lobbying congress for more money, everyone wants to help educate the public and raise awareness to help get funds for research.It's a very diverse group and I am honored to be one of the fourteen.One major initiative this year for the Association is to have regional town meetings to discuss Alzheimer's.  There will be one in Chicago while we are there, state chapters will have them and there will also be virtual town meetings.  If you are interested in any of these, you can check out more information on the National Alzheimer's website at www.alz.org.",
        "title": "More New Friends"
    },
    {
        "content": "Last night my husband and I went out to dinner with a couple from the Atlanta area.  The man has early on-set alzheimer's and is close to my age.  We had a good time over dinner getting to know them and learning more about what they have been through.  I hope this is a start of a new friendship for us.....we really enjoyed being with them and we certainly can relate to their situation.I've been playing golf a few times over the last week and got some tennis in with my son over the weekend.  Didn't do real well at either but at least it is exercise!  It's amazing how quick my concentration can go.  But, I try to hang in there.Things have been a little slow.  I'll post more soon.",
        "title": "New Friends"
    },
    {
        "content": "Thanks to all who voted in the American Express Members Project.  The \"Cure for Alzheimer's\" project has made it into the top 25.  There are four days left to vote again to make it to the tope 5 projects.  I'm reposting this information for you to vote again -- but please note -- there are two projects for Alzheimer's listed.  The \"Cure for Alzheimer's\" is the initiative sponsored by the Alzheimer's Association that I am encouraging you to vote for.  Here is the information again --Help Make Alzheimer's the American Express Members ProjectTAKE ACTION!All you have to do to cast your vote is visit www.membersproject.com. Users who have already registered can search forCURE for ALZHEIMERSor Project ID 01909.You'll be directed to the project details page, where you can click \"Vote For This Project\" at the top of the page. That's all there is to it!If you haven't already registered, have your American Express card number ready and go to www.membersproject.com. From there, you'll be asked a series of questions, and after completing them you'll be able to vote.Spread the word to make sure we advance to the next round: Forward this information to your family, friends and colleagues and ask them to help more the cause forward today by registering and voting for our project.Someone new develops this disease every 72 seconds in the United States alone. A few clicks of your mouse can help us move closer to a world without Alzheimer's -- vote today!",
        "title": "Time to Vote Again"
    },
    {
        "content": "I've been getting lots of feedback from some of my posts.  Some of them have been added to this blog -- others not for various reasons.  Thanks to all who have taken the time to submit a comment.  Lots of interest in the Early Stage advisory group I described recently.  Many have specific questions and if you would like to email me at krisbga@hotmail.com I would be more than happy to answer them individually.  This is the second year of the Association having the advisory group and many areas were identified last year that need to be addressed.  The whole group will be meeting in Chicago at the end of August for our first meeting I will have more to report at that time.In the mean time if you check out the alz.org website you find some events that are upcoming relating to this group. Specifically, there will be a series of town hall meetings held across the country to open up the dialogue on Alzheimer's.  I would encourage you to go if there is one in your area.",
        "title": "Feedback"
    },
    {
        "content": "If you have seen the American Express television commercials touting the \"members project\" you'll know what this blog entry is about.  American Express is asking people to name their top projects they would like to see funded and American Express will donate up to $5 million to a project selected by card holders.  \"Cure For Alzheimer's\" has made it into the top 50 projects and needs to make the next cut to 25.  If you have an American Express card, I urge you to go vote for the Alzheimer's cause.Here is more information from the Alzheimer's Association.Help Make Alzheimer's the American Express Members ProjectThanks to hundreds of American Express cardholders who are champions for our cause, the Alzheimer's Association has been chosen as one of the top 50 projects in The Members Project, a new initiative from American Express that will award up to $5 million to a project selected by American Express cardholders.Now is your chance to put your VOICE into action again: Vote from now until July 15 to make sure the Cure for Alzheimer's Project is selected as one of the top 25 projects!TAKE ACTION!All you have to do to cast your vote is visit www.membersproject.com. Users who have already registered can search for CURE for ALZHEIMERS or Project ID 01909.You'll be directed to the project details page, where you can click \"Vote For This Project\" at the top of the page. That's all there is to it!If you haven't already registered, have your American Express card number ready and go to www.membersproject.com. From there, you'll be asked a series of questions, and after completing them you'll be able to vote.Spread the word to make sure we advance to the next round: Forward this information to your family, friends and colleagues and ask them to help more the cause forward today by registering and voting for our project.Someone new develops this disease every 72 seconds in the United States alone. A few clicks of your mouse can help us move closer to a world without Alzheimer's -- vote today!",
        "title": "America Express Member Project"
    },
    {
        "content": "to everyone.  My week has been kind of quiet -- which is a good thing since we have been on the go.  It has been good to rest for awhile.  We don't have any major plans to travel any more this summer, until the end of August.My son is now in California only to return in a couple of days to Atlanta.  He just ended his first \"summer associate\" program in Washington DC and will be started a second one next week at a law firm in Atlanta.  Although I know I won't see him much while he is here -- it will be like when he was at Georgia Tech for four years -- I knew that he was close enough that I \"could touch him if I needed to\". When he moved to California to Stanford that was a little harder for me to take.I've been trying to play golf and tennis.  My concentration lags a good bit but I keep at it.  I love being outdoors and I'm getting some exercise to boot.  I'm so competitive that I hate losing -- so that is the hardest part! I'm getting over it though -- or trying to at least.",
        "title": "Happy Fourth"
    },
    {
        "content": "Last year, the National Alzheimer's Association created an Early Stage Advisory group to deal with the particular problems those of us with Early Stage Alzheimer's have to deal with.  Some of our issues are different than those in late stages mainly because we are still somewhat functional, many still work, and many are in their 40's and 50's.  Insurance, disability, social security, job security, family issues come in to play and need to be dealt with in a different way.  I was so pleased that they came up with this and in their first year were very aggressive in the areas they addressed and wanted to help change.This year, I have been invited to be on this Advisory Panel.  I'm please to have been selected and hope that I can do it justice.  We will be engaged throughout the year as advocates and spokespersons for the association and Early Stage Alzheimer's.  I know from many of your comments and emails that I have received from others in the same boat that there are issues out there you want addressed as well.  I hear you and will definitely bring those to the table.  Feel free to leave me a comment if you have some of your own ideas.",
        "title": "Early Stage Alzheimer's"
    },
    {
        "content": "Every month we go out to dinner with three other couples.  Each month a different couple gets to pick where they want to go.  Last night was one of our dinner nights.  But, I had had a bad day with panic attacks and noise bothering me a good bit.  I was at the gym and had a major panic attack, but I stuck it out and then came home.  Last night as we were eating dinner I several small attacks just because of the noise I think and I just felt a \"little off\".  I was quiet I know and it was difficult to carry on a conversation.  I always try to sit on the end of the table becasue then I don't have conversation coming from both sides at me.  But, that didn't help much.After dinner, one of the couples invited us over for dessert and I couldn't go.  I made my husband go without me and I felt bad about that.  But I just needed to be home where I felt \"safe\". Hopefully, my friends understand that.  I hate it when that happens.",
        "title": "Social Time"
    },
    {
        "content": "We just returned from a few days in Washington DC to visit our son.  He's working for a law firm there for just two more weeks (see above).  Then in July he will be coming to Atlanta to start a job there with a law firm.  It's nice to have him on this side of the country for awhile.We had a good time visiting and checking everything out in Washington DC again.  We tried to go places we hadn't been to before.  I certainly felt like the ball at the end of the chain though.  I certainly couldn't have done that trip by myself -- way too confusing.  I got tired pretty quick and tried to stay up with everything but it was hard.The one thing I realized when we were there though was that you can tell when your child has become an adult when he reaches for the check at a restaurant before you do -- and then actually pays!While we were visiting him, his fiancee's parents were visiting her and her sister on the west coast. Jennifer's sister took an internship in California and is staying with her this summer.  We were glad to hear that and we are glad they are all getting a chance to visit.Promise more soon -- I need to rest!",
        "title": "Washington DC"
    },
    {
        "content": "Today, Monday, some new research is going to be unveiled in Washington DC regarding some new drugs that are on the horizon to fight Alzheimer's.  I've been hearing about them for several years and I'm anxious to hear the results of the testing.  I've heard some rumors that the research is not going to show the kind of results that I was hoping for, but I hope that is just a rumor.  In the next few days you will be hearing a lot about several drugs that are in the pipeline.And, I'm told that Newsweek is going to do be doing a cover article on Alzheimer's in the next couple of weeks.",
        "title": "New information coming out"
    },
    {
        "content": "I just got back from Knoxville TN where a man I admire greatly was inducted into the Women's Basketball Hall of Fame -- UGA Women's basketball coach Andy Landers.  It was quite an honor for a man who certainly deserved it.  I went up with friends and there were two days of activities planned around the induction ceremony which culminated in a black tie event on Saturday night.  Andy is shown above receiving his award.  The UGA Athletic Department surprised Andy with a reception with his current team, old players and assistants and about 50 booster club members in attendance.  I was glad to be a part of the weekend and to help honor a true leader and great friend.But, it was a tough weekend for me. Lots of people in small areas, lots of panic attacks or near panic attacks.  I'm grateful I had friends that helped to look out after me, because I certainly needed it.This week we head off to Washington DC to see our son.  After that, my traveling is about over for the summer which is probably a good thing.",
        "title": "Big Weekend"
    },
    {
        "content": "On Wednesday, I visited my neurologist.  After my last visit we decided it was time for another MRI since my language problems had become persistent.  The MRI revealed that on a whole there was some atrophy of my brain from the last MRI but there was significant atrophy in the area of my brain that controls my verbal communication.  Needless to say, I wasn't pleased, but I guess it is what I expected considering my problems. I have been upset about it for the last day and I know I need to get over it because there isn't anything I can do about it.  I need to live one day at a time.",
        "title": "Neurologist VIsit"
    },
    {
        "content": "Today, I spent the morning with others from Georgia, filming a national television spot for the Alzheimer's Association. The shoot took place in Piedmont Park in Atlanta. Although it was hot, there was a breeze and we found some shade. I thank those in charge for letting me shoot my segment and getting out early. Here are some photos from the shoot and perhaps you'll catch it on tv when it runs!",
        "title": "Memory Walk Television Commercial"
    },
    {
        "content": "I've had one of those weeks where it has been really hard to concentrate....forgetting lots of words and organizing things have been difficult.  Last year I started making note cards from some of my scrapbooking left overs.  I am selling them with the proceeds to go to the Memory Walk.  I had a big order from someone and sat down to do it and realized how hard it was to actually put them together.  All I could concentrate on was some cutting and pasting (which I flunked in kindergarten) some of the embellishments that went on the cards, I just couldn't figure out how to assemble them.  So that is what I did for awhile.  I was able to get my order out with what I had in stock pile, but it was frustrating to not be able to do what I enjoy.Tomorrow I am heading to Atlanta to shoot a national tv spot for the Alzheimer's Association for this year's Memory Walk.  It is going to be shot in Piedmont Park and really pretty area right in downtown Atlanta.  It is going to be in the 90's so we will see how \"cool, calm and collected\" I will be!I'm off again this weekend. And, while I'm gone, my son will be flying in for a very brief span of time to attend a retreat in North Carolina.  Hopefully, I'll get to visit with him for a few hours when he gets escorted back to the Atlanta airport on his return trip to Washington DC.More after the weekend.",
        "title": "The Week"
    },
    {
        "content": "We went to Hickory NC over the weekend. We visited some friends that used to live in Athens and attended a wedding of a friend of mine. Many of you have been following my blog for awhile and may recall that last year, I wrote about a young man that had a skiing accident in Colorado and almost died. He had some head trauma, lost sight in one of his eyes as well as many broken bones. His fiancee was finishing up her studies at Georgia and went to be by his bedside for several months and still managed to graduate on time. She is a remarkable young woman. I got to know her through Memory Walk here in Athens. She chaired the event and did a marvelous job. Due to the accident the wedding was put on hold, and finally, this weekend, they tied the knot. It was an extremely emotional weekend for everyone, because of the severity of Brad's accident.I'm so pleased they allowed us to share in their special day.But it was a long weekend for me and I have to rest for awhile. I just wanted to share this story.",
        "title": "Hickory NC"
    },
    {
        "content": "I have finally rested a little after my trip to Minneapolis.  It was a great trip even though it was so short.  I was part of a panel that spoke to a group from Golden Clinical Services, part of Golden Ventures.  It was a training session for their employees on Alzheimer's Care.  They were so nice to us.  Also on the panel were two gentleman from Minnesota that I have been working with for a few months on this and it was nice to finally meet them.  I really appreciate this company working with their employees to understand this disease.  Thanks for having me.To my Illinois friends out there, just wanted to say that I'm sorry for you that Illinois didn't win the NCAA Tennis tournament against Georgia.  However, this capped off Georgia's undefeated season so I am glad they won.  Illinois made a great move by beating some top ranked teams to get to the final.  They had a lot of supporters in the crowd and were very vocal!We are off to a wedding in North Carolina this weekend.  And, get to see an old friend that used to live in Athens.",
        "title": "Minneapolis"
    },
    {
        "content": "I'm gearing up for a few busy weeks.  As I tired as I get I need to pace myself.  Next week I am going to begin volunteering for the NCAA women and men's tennis tournament to be held here.  The men's tournament has been here for many years and we always go to watch.  This year both the men's and the women's tourney is being held at the same time and they needed some people to work.  I can't do much that requires a lot of concentration for a long period of time, but at least I might feel useful.In the middle of that I'm going to Minneapolis to speak to a group on what it is like to have Alzheimer's.  There will be several people on a panel and I'm anxious to go and see some old friends.  It will be an exhausting trip for me and I know I will need a few days to recover.Over the Memorial Day weekend we are going to a friend's wedding in North Carolina.  This lovely young lady that is getting married was the Chair of our first Memory Walk here in Athens. She was going to UGA at the time and her sorority, Sigma Kappa, supports Alzheimer's as their philanthropic interest and she was in charge. She is a remarkable young lady.  She now lives in Denver and works for a pharmaceutical company.  I'm so glad she is getting married and I haven't seen her in over a year so I'm glad that we will be part of her special day. I just have to remember to pace myself!In June we finally get to see the kid in Washington DC.  It seems like he is settling in to his new job at the law firm up there.  I'm sure he will have lots to show us and tell us.Speaking of the Memory Walk -- the date for Athens' is Saturday October 20th.  Your support is definitely needed.  And, if you get a chance, check out the national Alzheimer's Website atwww.alz.org.  They have a great new ad campaign that is coming out and hopefully will help raise awareness.  Some big names have lended their support to the program and I am excited to see that happening.The best of Mother's Day to all of you out there.",
        "title": "Busy weeks ahead"
    },
    {
        "content": "Yesterday I attended a wedding of a former employee. Pictured above is me with him (right) and another former employee who was the best man. They are both just a little older than my son and came to work for me when my son had left for college. I guess I kind of looked at them as my \"surrogate sons\" when they worked for me and they have sinced stayed friends of mine. They are great guys and I am so glad that our paths crossed in life and I can consider them \"family\". They have moved away so I don't see them very often, but I do see their parents and we stay in touch when we can.Friends are important in life....don't forget that!",
        "title": "Weddings"
    },
    {
        "content": "I know many of you are aware of the trouble I have had getting my social security disability.  I don't understand why some get it right away and others have to wait so long.  I've been denied many times and \"my case\" is suppose to go before a judge in Atlanta to determine whether or not I will get it.  My disability insurance company told me I had to apply when I started receiving my disability checks.  After gettting rejected several times they hired an attorney to help us through the process.When the attorney initially contacted me, he sent me letters telling me that a judge should hear my case within 90 days of application but because the Atlanta Social Security hearing offices were so backlogged it could be as long as a year before they heard my case.  It is now 21 months later and still nothing!I received a letter from the attorney yesterday telling me that it will be \"several more months\" before they even begin working on it.  My file remains unworked and unassigned at this time.My attorney also sent this notice to me:\"There are 141 Social Security Hearing Offices in the US.  As of January 2007, Downtown Atlanta is at the very bottom of the list -- Number 141!  The other local hearing office, Atlanta North, is Number 131 in terms of the longest delays.The Atlanta North hearing office now has a docket of over 11,000 cases.  To deal with this staggering case load, they have seven fewer employees than several years ago when they were dealing with a 2,500 case backlog.  To make matters worse, two of the nine judges are retiring soon, and there are no current plans to replace them. \"I'm o.k. for now, but what about all those people that rely solely on Social Security Disability?",
        "title": "Social Security"
    },
    {
        "content": "Hug your kids, hug your families -- the tragedy at Virginia Tech reminds us once again how precious life is.  What a senseless act.  My best friend from college has a son that goes to Virginia Tech and he is an engineering major.  I have tried to contact her but I haven't been able to get in touch with her yet to see if her son is o.k.  Life is just too short for some.",
        "title": "Virginia Tech"
    },
    {
        "content": "was our 27th wedding anniversary.  The time certainly flies.  I guess none of us knows what we are getting into when we marry ...... I just wish my family didn't have to carry this burden with me.Yesterday also brought a trip to the neurologist.    He's changing up my medicine a little and it is time for another CT scan of my brain.  It's been awhile so we'll see if we can find some changes.  I have had increasing problems with finding the right words for things lately.  That is so frustrating. I can see it in my head but I can't find it!",
        "title": "Yesterday"
    },
    {
        "content": "I had a busy week last week and got out of my \"routine\".  I noticed that my panic attacks were worse last week.  We had a garage sale with several other families and it was held at our house.  We had the opportunity to do a lot of spring cleaning, but at the same time, it created upheaval around our house because things weren't where they were suppose to be.  The house was a mess, our garage was full of \"stuff\" and things were just not \"normal\".  It is amazing how this affects me. But it is over now and the money we raised from the garage sale is a start for our Memory Walk this year.Also, the mother of a close friend of my son's, passed away last week and that always gets me much more emotional than I used to be.  She was only 55 too and it was such a shock to everyone.  She had four children and Alan's friend read a eulogy that one of her other sisters had written.  It was so sad.  Those things stick longer with me now -- I don't know if it is the disease or the fact that I am getting older and people are passing away that are close to my age or just before their time.",
        "title": "Routine"
    },
    {
        "content": "my son and his girlfriend of almost five years got officially engaged last week.  They went to Hawaii for Alan's spring break and he finally popped the question.  Details to follow, but now I'll have another female in the family.  Have two brothers, my husband having two brothers and me having a son -- it will be nice to have a female as part of our family.....welcome Jennifer Lee.And, even though this is being written on April Fool's Day -- it is not a joke.The pollen in the south has been horrendous.  The yellow green color that it leaves everywhere literally can take your breath away.  We are suppose to have rain today and that will certainly help.This week I had a test done at a local hospital on my left leg.  The leg has been swelling and at first there was reason to believe that I had a blood clot in my leg.  But after tests for that it was determined that was not the cause.  Now the doctors believe that the problem lies in my lymph system.  Anyway, I went to the hospital to have this test done -- I don't remember the name of it -- but it entailed having some fluid injected into my feet and then they watched the fluid stream through my body.  It doesn't sound so bad, but the shots were given between my toes on each foot!!!  Sounds awful.....it was awful.  I have had several cortisone shots for various things over the years and it was very close to that -- which caused me excruitating pain.  And, it also topped right up there with getting two spinal taps during my diagnosis for Alzheimer's.  What fun I have had.  Results will be in next week on my leg.  It's not life threatening -- just a nuisance more than anything.",
        "title": "It's official"
    },
    {
        "content": "Many of my friends have recently passed some milestone birthdays so I guess that always makes me feel older too.  And, with it comes stories of failing health in some form or another.  Do we just neglect ourselves in all that we have to do, do we overdo things because our bodies are what they used to be or is it \"just getting old\"?I've tried to keep remember what some doctors have told me about my Alzheimer's.  That they are hoping with the drugs out there today and some to come on line soon, that their hope is for people like me to die of something else rather than the Alzheimers.  Of course, I hope this is true as the downward spiral for someone with Alzheimer's isn't exactly pretty. But some other diseases are not either.Spring has sprung in the south and with it comes the dreadful pollen.  I have never seen it this bad although my husband says it has been.  I suffer from allergies and when you can't go outside because the pollen is so thick in the air it is bad.  The range for the pollen is up in the 5000 range (whatever that means) and if you consider that the \"high range\" is 150, you realize how bad it is.  The streets, cars and any surface outside are covered with this yellow green dusting.  I remember when I was playing tennis with this pollen that you can see where the ball bounced because it would leave a mark in the pollen.  We are hoping for rain to help clear some of it out.I'm having some circulation problems in my left leg so am going to the hospital for some tests tomorrow.  The name of the test is too long for me to remember, but they will basically be shooting dye up my leg to watch the flow of it.  The doctor thinks I have lymphodema -- which isn't life threatening -- more of a pain and a nuisance.On a lighter note, my son and his girlfriend are in Hawaii on his spring break right now.  Ever since moving to California they have wanted to go since it is a lot cheaper if you are starting out in California.  I hope they have a good trip.  They have both worked hard to get there.",
        "title": "Getting Older"
    },
    {
        "content": "from Minneapolis.  It was really cold up there!  Our team won two games and now they are on to the Sweet Sixteen in Dallas.  I'm going to have to bypass that trip -- it is just too hard for me.  Thankfully, I had my husband and some other good travel companions with me on this trip to help me get through.I'll post some photos soon.  Thanks for everyone's comments.  I promise to post more when I get some rest.In asnwer to someone's question, I am 51 years old and I was diagnosed at 46.",
        "title": "I'm back"
    },
    {
        "content": "I feel like I am at a crossroads in my life.  And, I can't find the right words to express what I'm feeling.  It's very frustrating. That is partly the reason that I haven't entered anything into this blog lately.  I'm just confused and it is hard to explain.  It's hard to ask for help when you can't describe what you are feeling.  Hopefully, this too shall pass.",
        "title": "Crossroads"
    },
    {
        "content": "I have had somewhat of a \"writer's block\" lately so I apologize for not blogging more lately.  Soemtimes it is just hard for me to come up with the right words.When I was first diagnosed with Alzheimer's I made it a mission of mine to get into scrapbooking of some sort.  I had lots and lots of photos and they were catalogued or captioned and you probably know the drill.  It was always something I was going to get to.  Well, I decided that while I could still remember some things I would really work at getting all those photos and kid's drawings and momentos in a scrapbook.  It took me several months but I finally got caught up.  I was relieved when it was over, because at least I knew that my family would have some memories of our life even if I couldn't remember it.My project of late has been to work on a scrapbook for a friend of mine.  It is a secret so I won't go into who it is for and what the purpose is, but since I know this person doesn't read the blog I think it is pretty safe to talk about it in general terms. I have solicited letters, stories and photos from friends to include in the scrapbook.  At times, I feel a little guilty in reading all the letters and stories about this person's life because they are so personal.  But at the same time, I am taken back by how much this person has meant to so many people during their lifetime.  You never really know what kind of an impact one person has on another until you read stories about them.  We take that kind of friendship for granted too often.I look back and I can pinpoint several people during my lifetime that changed the way I am (was) and sometimes it is not the people you expect that change your life.   I'm not sure when I was growing up we called these people Mentors like we do today, but just the same they are important in our lives.  Sometimes we don't realize what an impact they had on our lives until way after the fact.  If there are people in your life that have affected you for the positive, let them know it, before it is too late.  There's no time like the present.",
        "title": "Friends"
    }
]