[
    {
        "content": "It's the day after Christmas and I survived another one!  It wasn't so bad considering we had Ian to make us smile!He was one month old on Christmas and a delight -- although his mom and dad probably don't think that when he is crying.One nice thing about my son being on paternity leave is that he is a little more accessible to us and was able to go with me and my husband to my neurologist appointment on Friday.  I was really hesitant about getting a new doctor, but being stressed out with my other doctor took more of a toll on me.  But we loved the new doctor -- he spent a lot of time with us and we talked about a lot of things, some options available to me and it was such a relief. I'm glad my son had an opportunity to meet him, as he may be dealing with him some day and at least they have met face to face.Enjoy the rest of the holidays!",
        "title": "Surviving Christmas"
    },
    {
        "content": "Just wanted to be sure to wish all of you a happy holiday season. And, a new photo of Ian -- wouldn't you like to know what he is thinking?I'm seeing a new neurologist this week.  Lots of reasons to change right now -- I sure hope we like him!My best to you for a happy and healthy new year.",
        "title": "Happy Holidays"
    },
    {
        "content": "Ian Lee Bakowski entered the world last Friday, November 25th. He was a week early but we are glad he is here.  His mom had a long labor but everyone is doing fine and they are home from the hospital.  I wasn't exactly sure what I was going to think when I saw my son holding his son for the first time, but it pretty much took my breath away. Thanks to all of you who have sent their well wishes to Ian and his family and to Ralph and I.",
        "title": "Ian has arrived"
    },
    {
        "content": "Great job everyone!  Team Athens raised over $15,000.00 for the Athens Walk To End Alzheimer's.  Thanks to everyone who came out, donated and supported us in this year's event.  You are great!",
        "title": "TEAM ATHENS"
    },
    {
        "content": "I've had a problem in getting logged into this Blog for awhile but now I have been able to get back in, so I hope to be posting more.  Thanks for all your comments lately.  I have heard from so many people that have great questions and need information.  This month is Alzheimer's Awareness Month. Today was actually World Alzheimer's Day.  I've had lots of requests to speak recently, but all have required some pretty long distance travel.  Usually, that isn't a problem, but one required me going to LA one day and returning the next.  With other things I have going on, there just wasn't anyway I could do that.  Traveling takes a pretty good toll on me and I know that those interviews I had to turn down, were covered by very capable people. I'm glad that Alzheimer's is getting some news time.We had our annual Walk To End Alzheimer's.  I was so proud of my team -- we raised close to $15,000.  Our Walk in Athens actually surpassed its goal this year for the first time in many years.  So excite about that and thanks to all of those that donated, walked and gave your support to my team.In about a month a new Bakowski will be joining the family.  My son Alan and his wife Jennifer Lee are due with a baby boy.  We are looking forward to this joyous occasion.Communication has become more of a problem for me.  I find it much harder to talk on the telephone, preferring emails or skyping with family.  It helps for me to be able to see the person when they are talking.I plan in the next week or so to share some new reading material about Alzheimer's so stay tuned!",
        "title": "Blogging"
    },
    {
        "content": "has been a long time to post.  I have gotten a lot of comments and emails lately about my journey with this disease so I will try to go back a little to give some perspective to it and answer some of the questions people have asked.Question 1 -- What were your first symptoms?I began having problems at work -- I was the manager of a 2,000 seat performing arts theatre and found that after 8 years I had problems doing familiar tasks, multi-tasking, trouble with working with numbers and dealing with season ticket holders and staff.  I first thought it was stress and being tired but I finally went to see a doctor when my symptoms got worse and I found myself somewhere and didn't know where I was or how I had gotten there.Question 2 - What kind of tests did you have to determine your diagnosis?I had about 8 months of testing which including all the usual lab tests, blood work. Then I had a spinal tap and that showed a build up of tau in my brain (which cause the tangles in your brain with this disease) and also a gene that carried the Alzheimer's disease.  I also did intense neuropsychological testing.  I was \"lucky\" from the standpoint that I was diagnosed at an extreme early stage of the disease.Question 3 - What kind of medicine are you on?I take Exelon (patch) and Namenda.  I have some other medicines I take that are off label that help with some of the symptoms.Question 4 - How are you still so functional?I get this question a lot.  I know many people that have been diagnosed longer than I have and are more functional than I am.  As I said, this was caught early in the disease process and I personally think that makes a difference -- although medical personnel may disagree -- that is only my take on it.  I work at it -- try to stay active both physically and mentally.  There are many many things I cannot do and I won't go into them but I struggle just like everyone else.  It isn't easy -- but I do the best that I can.It has taken a lot of effort to put down on paper what I have just written.  I used to do this with such ease and now after many hours thinking this through and writing it out several times (with help) I was able to get it this far.I appreciate everyone's comments and only hope that if you or someone you know is dealing with this disease that you get help somewhere -- there are lots of resources out there. I work closely with the Alzheimer's Association but there are others as well.  Check them out on the web and get some advice -- it doesn't cost anything to do some research and ask a few questions.  It has helped me and helped my family.On a lighter note -- we are expecting our first grand child this fall -- and I am hoping that I will be able to enjoy the little one for a long time.",
        "title": "Two months"
    },
    {
        "content": "We were delighted to learn on Mother's Day that our son and his lovely wife are going to be parents in November.  It will be our first grand child and I can't wait to see what is in store for our family.But this month has also brought deaths. Just yesterday I attended a funeral for a 32 year old (same age as my son). And although this beautiful young lady had health issues it is still hard to mourn her loss and that of her parents. Today, I received word that a friend of many years lost her valiant fight with cancer.  She was so tough and a real trooper through all of it.  My heart is broken about it.  She was brave and posted not long ago on her Facebook page that we must all love while we can, live while we can and stay in the moment.  This is so true -- a devastating illness shouldn't have to teach us this -- but many times it does.I am finding it harder and harder to do things and it is getting me down.  I know I am to expect this considering how well I am doing, but it is frustrating. It is hard to admit to friends that many things that are so simple are beyond my reach -- what more can I say?",
        "title": "Ups and Downs"
    },
    {
        "content": "to the Athens NARFE (National Association of Retired Federal Employees) group that had me speak yesterday.  They were a very gracious group and I appreciated the time they gave me.My friend Lisa Genova sent me a message telling me that Greg O'Brien (a friend of her that has Alzheimer's and has written a book about it) will be on NOVA on PBS Wednesday night.  He will be with Rudy Tanzi -- an Alzheimer's researcher.  I've got it set to record -- hope you can catch it too.",
        "title": "Thanks"
    },
    {
        "content": "since I lasted posted.  All my intentions of sitting down at the computer and adding some meaningful things to this blog seem to fade away before I actually sign in to this blog.  Anyway, thanks again to those who do follow this thing. All the time I swear to do better and then I don't.Obviously a lot has happened since I last logged in.  I have lost several friends in the last few months to cancer and other things.  As we get older I guess we should expect that but it is still hard.  And, when I go to their funerals or memorials I always think about what people will say when I am gone.  I know what I would want them to say -- but that probably isn't what they will say!I have had a few more \"episodes\" as my husband calls them.  I am having some much harder days and have had to ask for a lot more help.  I am finding it more and more difficult to talk on the phone these days -- I think it is easier for me to see the person I am talking to.  Email and text messages work so much better for me because I can go back and re-read them if necessary.  Sometimes the most mundane things are hard -- like sorting things by color or trying to understand something I read.  I had my first real case of \"wandering\" which took my husband by surprise. I find it is much harder to control my emotions and I will say things that I have always thought, but not allowed to get from my brain to my mouth!  That gets me into trouble, but trying to filter what I say is much much harder now.  I try to rationalize it that I am getting older and it is hard to be politically correct and to be \"nice\" but I know that isn't the real reason my outbursts explode!I am still working through that bucket list of mine.  Tomorrow, one more thing will be crossed off as I have finally gotten my brother to Georgia and we are going to the Masters together.  I have been several times and I was fortunate to have my oldest brother (now deceased) come about 20 years ago and go with me.  So, it has always been my goal to get my brother Tom here for that experience.  We golfed as kids with two brothers and my dad it made for a good foursome.  My oldest brother played golf in college and my other brother and I have played sporadically over the years.  I used to be half way decent but I don't play enough now.  I am just glad that I am able to experience this with my brother after all these years of trying to make it happen.",
        "title": "Gracious -- it has been a long time"
    },
    {
        "content": "Happy New Year.  It has been so long since I posted.  Those thoughts don't come as readily as they used to!  Hope everyone had a good holiday.  Our holiday was a little on the quiet side which was good for me.  My son and daughter-in-law spent the Christmas Holiday in Taiwan visiting Jennifer's extended family.  So, we didn't put as many decorations up and that suite me fine.  I don't like everything around the house because \"it isn't the same\".  Routine is important you know and little things like that can make a difference.I was reflecting back on the year and realize it has been a quiet year too.  No big trips, no big surprises, no disasters --- which is a good thing.  Sad to say I lost a few friends and several friends are dealing with life threatening illnesses which is hard. Others have fought their battles with illnesses and came out on top.  As we get older, I guess that is to be expected.I turned the big 60 this year.  I need to go back and review my bucket list.  My son gave me one of the items on my bucket list \" an IOU for a skydiving trip\". Something I have always wanted to do --we were going to try it last year but timing didn't work out for us.  He has promised this will be the year.I am grateful to be doing as well as I am.  Still trying to stay active, and keep the brain active as well. I have really had to say \"no\" a lot this year to give myself some breathing room.  Activities wear me out quickly so I have to cut back on some things -- but I am still plugging along.I have been reconnected with many old friends this year and that is so nice.  It is hard to believe that I have known these people over 50 years -- that is a long time!    But it has been fun catching up with them and comparing our lives after all these years.There are lots of things to look back on and wish we had done things a different way.  But, it is the new year and I hope all of you will look forward to a productive year.",
        "title": "2016"
    }
]