[
    {
        "content": "I have been trying to get back to this blog for a long time and just keep getting sidetracked. I am still here! The last few years the holidays have made me anxious so I guess I am not looking forward to them like I used to. I guess to many people, too much noise, too much of a lot of things, so I have to keep that in mind while going about my usual routine.I have heard from many people recently about recent Alzheimer's diagnosis or people just looking for help.  I am glad people are reaching out instead of trying to cope on their own.  I was recently made aware of a new book Not All Who Wander Need Be Lost: Stories of Hope for Families Facing Alzheimer's and Dementia by Lisa Skinner.  It is an easy read and filled with lots of advice and ways of coping with people like me!  Lisa looks at everyday problems families face and offers some great solutions on dealing with certain situations.  It is definitely a book I would recommend to those having to care for someone with Alzheimer's or dementia. The book can be found on Amazon.Several friends have been dealing with some different health problems and I guess as we get older that is going to happen.  I don't think we necessarily see ourselves as older so sometimes thinking about my friends and what they are dealing doesn't seem possible. But then, they probably say that about me too.I don't know if many of the things I am experiencing now are just due to old age or the disease but many of the things I am experiencing aren't pleasant for me and I am sure they are not pleasant for my friends.  I hate it -- my emotions are all over the place and I never know how I am going to react to things.  Sometimes it just isn't pretty.  I know I am thankful that I still have friends -- despite how awful I must seem to them at times.",
        "title": "Thanksgiving is Upon Us"
    },
    {
        "content": "And into the sixties......that will be me tomorrow.....I am finally turning 60. I will take it -- considering what I thought my lifespan would be after getting my Alzheimer's diagnosis.  I am still around -- for better or worse -- and have the best support group of family and friends I could have. Thanks to all of you for helping me through the tough times and celebrating the good times.Someone asks me the other day if I remember thinking 60 was old when I was younger. I don't think I really did -- but I never really thought about getting old. It was going to come whether I was ready for it or not. So, 60 is here tomorrow and hopefully, I will be too!",
        "title": "Out of the fifties......."
    },
    {
        "content": "It always takes me by surprise how long it has been between my posts.  It doesn't seem that long.  Thanks for hanging in there with me, guys.  Not a lot of new things to report.  I have had a lot of comment on the Atlanta Magazine article.  It has certainly reached a lot of people and a lot of good has come from it.I'm longing for a vacation at the beach -- which probably won't happen.  But I would really enjoy getting away and doing nothing.  I'm seriously thinking of trying to go by myself to the beach just for some alone time.On another note, health problems hit all of us I guess in some way or another.  I just hate it when a bad diagnosis comes to good people. Today I learned of such a diagnosis for a close friend.  She will get through it -- I have no doubt.  She has a great support network and loads of friends that she is always helping out when they are in need -- so they will be there for her -- as will I.  Luckily, medicine has come a long way in what she needs and I feel great about a positive outcome.  I wish it were that way for everyone.",
        "title": "Back at it"
    },
    {
        "content": "The July issue of Atlanta Magazine is all about health this month.  I was fortunate enough to be asked to join a round table discussion about Alzheimer's for this issue.  Thanks to the editors for tackling this subject.  If you are coming to this blog from that article -- thank you.  If you are struggling with this disease -- know you are not alone.  There are many many resources out there to help.  I work with the Alzheimer's Association but there are other groups as well.  This disease isolates not only you but your family so try to reach out for help.  It is hard to ask for help -- believe me -- I know all about it.  But once you get over that hurdle the first time, it gets easier.I haven't written in awhile.  So many attempts at sitting down at the computer and organizing my thoughts have failed lately that I just gave up.  Today, I guess I am on a roll.The Longest Day -- a promotion by the Alzheimer's Association -- was held recently on June 21.  Groups are asked to do something for a day -- to help raise awareness and funds for Alzheimer's.  A gentleman in my community, Joe Sinkey, hosted a bridge tournament which he has done for several years.  It is part of a national program through a bridge association but this year Joe's tournament was in the top ten in the nation for funds raised.  So proud of him for doing this every year.  Thanks so much.I have been experiencing major issues with vertigo lately and have undergone some tests.  My balance has been affected by the Alzheimer's but this is a different.  Am awaiting the results from my doctor. But, I am still trying to play pickleball when I can to get that exercise in.  Certainly can tell a difference when I do. Hope all of you are staying active -- remember what is good for the heart is good for the brain.Thanks for reading my blog -- more soon.",
        "title": "Atlanta Magazine"
    },
    {
        "content": "Yesterday was not a good day. I was playing Pickleball with my husband. I usually play about three or four times a week, so that wasn't unusual. But some days it is hard for me because there are too many people and too much noise. I had played a few games and was doing o.k., but then I was playing with my husband (fortunately he was my partner) and all of a sudden it was like the walls were closing in on me, I got confused, didn't know what I was suppose to do and I had a full blown panic attack.  It has been awhile since I had one and I can usually feel them coming on, but not this one. I had to get out of the gym as fast as I could. My husband realized what was going on and helped to get me out. it was as if the whole world was spinning around me and I could not get off the carousel. It is hard to explain, but it can be terrifying if you do not know what is happening for you. I went outside to get away from everything, but I couldn't set foot back in the gym. My husband took me home and I had another one at home -- which isn't unusual for me -- seems like If I have one, I have another or several.  But I was feeling better because I was in a safe place. It was a long day.",
        "title": "And the walls start to cave in"
    },
    {
        "content": "I have been doing lots of things, but not found the organizational skills to put it down in writing.I spoke to a wonderful group out in Crawford Georgia -- the Democratic Party hosted me for a talk.  There were some great questions out of that group and I appreciate the opportunity to talk with them.The Public Policy Forum for Alzheimer's was held in Washington DC in the last few weeks.  A lot of really good information came out of the sessions.  I wasn't able to attend this year, but if you are interested in some new statistics here is a link to the2015 Alzheimer's Facts and Figures. What stuck out to me the most is the diagnostic rate of Alzheimer's.  In a nutshell, it says that only 45% of the patients are actually getting a diagnosis of Alzheimer's from their doctors.  We knew this, but now there is data to back it up.  This is a shame for a lot of reasons -- the biggest one to me is that for those diagnosed early, it hinders their ability to get Social Security Disability and other forms of help they so desperately need.  This, also doesn't help the stigma situation with the disease.  So much needs to be done in this area.Last week, I met with several other people with a reporter from Atlanta Magazine.  They are doing a Health issue in July and Alzheimer's will be featured in one of the articles.  As part of our panel discussion, we were able to call my friend Lisa Genova - author of Still Alice for her take on what has happened since she first wrote the book and since the movie's release.  By the way, Lisa has a new book out this week about Huntington's Disease.  I haven't read it yet, but if it is as good as the rest of her books I will be recommending it.I have had lots of comments and emails in the last few weeks from readers of the blog and I have been really slow to respond.  I promise I will try to get to everyone this week.  I appreciate all of your feedback.",
        "title": "Since my last post"
    },
    {
        "content": "It has been awhile since I have posted.since that last post several things have happened-- I tore my MCL-- I went to Little Rock AR to see the SEC women's basketball tournament-- We had ice and six inches of snow while in Little Rock-- We stopped in Scottsbor, AL on the way home to visit Unclaimed Baggage Center -- you need to check them out!-- my sister-in-law in Illinois fell and broke her leg at the ankle requiring surgery and a stint in the hospital with blood clots -- she is now rehabbing at home.-- my son and daughter-in-law brought my great niece to Athens (she lives in Atlanta and attends Emory University) to see a UG gym meet for the first time. My niece is a member of the Emory gymnastics club team.since I posted about the SEC tournament, I wanted to mention that the women's basketball coach for the University of Georgia, Andy Landers retired this past week. he has been the only full time coach UGA has ever had. I am proud to call Andy a friend and will is seeing him on the sidelines next year. I intend to write more about Coach Landers in another post I just haven't gotten it all sorted out in my head yet. I was surprised by how much his retirement has affected me -- he has been the coach for the last 36 seasons -- exactly the number of years we have lived in Athens. But, Andy has been much more than a coach to not only his players, but his fans as well. He will be a hard man to replace.",
        "title": "Spring is here"
    },
    {
        "content": "Here is a photo of my lovely friend at the Oscars last night.  Lisa Genova, author of Still Alice. She is beautiful.So happy for her and Julianne Moore for winning best actress award last night.",
        "title": "The Oscars!"
    },
    {
        "content": "Many of you have asked me about Still Alice and I have received numerous emails and messages regarding the movie.  I think I want to see it again -- it takes me awhile to catch on to everything you know.There were several things in the movie that I think only those with the disease would understand.  For instance, when Alice is out running she gets confused as to where she is -- the movie shows her looking around and everything is a blur to her.  Now I am sure many of you can relate to what this is trying to say, but I think it is also a commentary on what is happening in our brain -- it is out focus as well.  There really isn't anyway to fight it -- you just have to hope that it passes quickly.  Then when Alice returned home her husband asked her about going out that night and she looked afraid and said she wanted to stay at home.  I feel safe at home.  When I am having a bad day I can't get home fast enough.  Home is familiar, home is where you feel comfortable, home is where no one can see you, home is peace.  I remember many times being on the treadmill in the gym and I have this sudden panic attack when I am not sure what is happening and I have had to immediately come home to feel \"normal\".I don't go out much at night.  Things look different at night and I get too confused. I used to be the one in the family that wanted to go out and do everything.  Now I am content staying at home in comfort and contentment.I urge everyone to see the movie -- I am sure that I will have more to say as the days go on.  I do hope that Julianne Moore wins the Oscar this weekend. So well deserved.Thanks for reading.",
        "title": "More Comments on Still Alice"
    },
    {
        "content": "On Sunday, my husband, son, daughter-in-law and I went to see Still Alice.  If you have been following this blog you know that I have told everyone to read the book.  It took me a very long time to read the book, because as I saw myself in the pages, it scared me. \"Alice\" was (is) me.  I would read a little, put it down for days, pick it back up only to put it back down immediately.  When I finally finished it I was so glad the book had been written -- it so aptly described my life and those living with Alzheimer's disease.My family had not read the book before we saw the movie.  I was anxious to see their reaction and to gauge my own.My reaction -- at first I thought someone \"had hit me in the gut\". Watching Alice cope with things, knowing what was going through her mind was wrenching for me.  The words she spoke were the exact same words I have spoken to my family or friends. It was almost scary to see it -- to have her feel what you have felt and not being able to communicate it to others.  It is very moving -- I didn't cry until close to the end.  It was when Alice's daughter gives birth to twins and Alice goes to visit her in the hospital. When she asks to hold the baby her son-in-law gives his wife a look as if he is saying \"is she capable of holding the baby?\".  Alice very quickly says \"I know how to hold a baby\" and the new father gives her one of the babies to hold.  This got to me because I have had this same scenario in my mind many times.  My son and his wife don't have children yet, but I have silently worried that if and when they do -- they won't feel as if I will be capable of holding the baby or being an appropriate grandmother.  After that scene, the floodgates opened for me.  There were many tears in the theatre that day. I was emotionally spent after the movie.At the end the screen goes white and people literally just sat in their seats and stared at the screen.  It was very emotional.On the way back to my son's house, not much was said in the car.  Everyone was just trying to digest what they had seen.  Since they hadn't read the book, I think the impact of the movie was pretty strong.Many who read this blog don't actually know me -- but if you see Still Alice -- you will know me. Thanks to Lisa Genova, the author of Still Alice (and a friend of mine) for writing such an epic novel. She had no idea when writing this book several years ago what an impact it would have on the Alzheimer's community. I am so grateful to her and her work.Still Alice is still in limited release but by the end of February it should be in many more theatres. Don't miss the opportunity to see Julianne Moore's portrayal of Alice.",
        "title": "Still Alice -- the movie"
    },
    {
        "content": "I have started this post many times and deleted it. this time it is going to be published whether it is \"polished\" or not.as my Alzheimer's progresses my emotions get out of control. My feelings get hurt very easily. I have written before how it has been hard for me to let go of things. I don't know why I can't keep my emotions in check. I don't know if I am imagining things, reading into things wrong, or just losing it at times. But it really affects me when I am left out, forgotten or people just don't care enough, when I have put my heart and soul into a friendship that people do some of the things they do. If I say something to them, they think I am being petty -- but it isn't petty to me. We all have our thresholds I guess and mine is pretty low.a couple of weeks ago I had two funerals in one day. It brought sorrow and joy into my life -- sorrow for losing two individuals  so young, but joy to know how well they were loved and by getting to see so many people that helped celebrate their life. Tomorrow brings yet another funeral. I guess as we get older, funerals become the norm, but it is still hard.This week I suffered a head injury and the doctor has deemed it a concussion. Can't say I have ever had one of those, but it isn't pleasant.Also this week I sat down and wrote several letters -- yes, actual letters. I like writing letters \"the old fashioned way\". One of the letters was to a man that I went to college with that has had a lasting affect on me. Every time I went back to Illinois I would say I want to go by and see him. I never got around to it. so, I finally decided to sit down and tell him what our friendship meant to me and how he showed me a different way of thinking and how grateful I was to have had him as a friend. I am glad I did that.I am hoping next week will be better.",
        "title": "a bad week"
    },
    {
        "content": "is in the books and we are greeting 2015. I started reflecting on the last year and was going to write all kinds of things, but realized they are probably only meaningful to me so I am going to spare you from that post right now.But the past year took many people from my life and probably yours as well.  And, sickness has overcome many and some are not looking at real bright outcomes. I guess as we age that is to be expected.  I am so thankful I am here so long after my Alzheiemer's diagnosis.  I guess that is why I seem to define my life in \"time\".  Time matters. We take it for granted.  I want to spend my time doing things that matter to me not because someone expects it of me.  Everyone defines their life differently and as we mature we change those definitions every now and then.  Although my husband would never admit it, he defines his life by things.....what he has, what he wants, what he doesn't have.  He likes to be able to touch things, covet things and get better things.  I know that probably stems from not having much growing up. And, I'm sure that my definition comes from never feeling like I had time to be with some members of my family -- like my dad.  My father always worked nights so he was home when we were in school and then he would be off to work when we came home.  I know I worked alot when my son was growing up and wasn't around as much as I wanted to be and I regret that.  I know that he probably does too. So, it is something I will continue to work on -- to be there for my friends and family as best as I am able to.For Christmas this year, I asked for nothing other than time.  I asked my son to spend time with me on Mother's Day (the actual day of Mother's Day).  I know that sounds silly but sometimes due to circumstances (or distance) we weren't together and I was bothered by that.  The actual day shouldn't make a difference, but for some reason I can't let that go.  So, for Christmas my son has already made arrangements for us to be together on Mother's Day.  From my husband, I asked for acknowledgement. I asked that he acknowledge my birthday this year. That sounds pretty silly too - doesn't it?  But it doesn't cost anything and I will be grateful if he will do this.Speaking of letting it go -- I have had a hard time with that this year.  I think I have had a drastic shift in my thinking on this.  For so many years, I let things go that bothered me because I didn't want to confront it, didn't want to deal with or just couldn't be bothered.  But then I found it festering in me and getting upset with myself that I didn't deal with certain things and then found myself resenting people because of my inaction.  So now, I'm holding on to things too long and becoming frustrated so I have to find a happy medium.  Hopefully, I can do that soon.I am so thankful for my friends.  I have made a lot of new friends this year and it has opened up some things for me that I didn't think were possible.  I am truly grateful for that.I have had to make quite a few changes in my life this year and that hasn't been comfortable for some of those around me.  But, it has freed me up and I guess I am to the point where I am selfish enough now, to do things for me -- not others.  It has taken me almost 60 years to figure that out -- but better late than never -- right?Happy New Year!",
        "title": "Another year"
    }
]