[
    {
        "content": "Today I got to meet the talented lady behind \"Cake Pops\".  She does some amazing things with cake and when I grow up I want to be her!  She made a stop today at the UGA bookstore and did a book signing.  Her books about Cake Pops and Holiday Cake Pops can be purchased through Amazon or at your local Barnes and Noble.I wish I had the patience to decorate these little nuggets like she does, but mine never turn out like hers!  Maybe one day............ but it exercises my brain and that is a good thing -- even if I can't makethe magic like she does.Here are some examples of her work --Thanks for your time today Bakerella I enjoyed meeting you.",
        "title": "Cake Pops and Bakerella"
    },
    {
        "content": "I know I have been a little MIA lately.  Lots of things going on and not able to get my thoughts together like I want to.I haven't taken the opportunity to thank everyone who donated to the Walk To End Alzheimer's.  And, those on my team that raised so much money.  Thanks from the bottom of my heart for helping fight the fight.Tomorrow will be a day filled with family, fun and laughter.  We are heading to Atlanta to be with my son and daughter-in-law and her delightful family (including her sister who has flown in from San Francisco).  We are blessed to be able to be all together because for so many years we were not.  It makes it even more special for us.This year, the Classic Center (where I used to work) has installed a portable ice rink which will be open for public skating in December.  I'm excited about that -- I love to ice skate.  I was a figure skater when I was much much younger!  When I moved to Athens almost 34 years ago I thought it was horrible that I could no longer skate.  There were a few rinks tucked away in Atlanta but they were not close enough.  Although my husband had skated as a youngster, skating really isn't his thing -- you may remember several years ago when he decided to go skating with us (Alan, Jen and her family) and fell and broke his elbow -- no more ice for him.  He is now a bystander!  Anyway, I have found places to skate in Atlanta that are a little more convenient although I don't go nearly enough.  But now that the rink is here for at least a few weeks I can enjoy it without having to go too far!  Now, how many of my friends will join me on the ice?  We'll see who my real friends are won't we?  And, Carol -- if you are reading this you cannot come skating -- even if you wanted to.  That poor boy you traumatized by running over him on the Rockefeller Center rink 15 years ago or so is probably still traumatized! To mark the occasion of skating in Athens I crafted a pair of skates out of scrapbook material.Happy Thanksgiving to everyone!",
        "title": "Happy Thanksgiving to everyone"
    },
    {
        "content": "This past weekend we went to a musical that the Atlanta Bar Association put on.  It was a fundraiser and we enjoyed the talent.  Our son was Superman -- a \"Super Lawyer\" in the show.  It was lots of fun and a good time.",
        "title": "Superman"
    },
    {
        "content": "I have two friends in particular that are a lot like me -- maybe that is why we are friends!  Anyway, it is not uncommon for us to buy the same presents for each other on special occasions.  And, when shopping for these two friends, I know that what I like, they will like.I met with one of these friends this week for a belated birthday celebration for me.  This friend is always dressed perfectly, her hair is always perfect, her house is always decorated perfectly -- well you get the picture.  If I didn't love her I would probably hate her.  Anyway, I will never look like her and be as polished as she is.  But, for my birthday she gave me some soap and cream that she uses all the time and swears by it.  I have wanted to try it but it was expensive and I don't usually indulge myself in such things.  My friend certainly looks no where near her age and I guess this has been her \"secret formula\".  So now, although I won't be like her -- I'll smell like her and maybe get rid of some of these wrinkles in the mean time.",
        "title": "Friends that are like me"
    },
    {
        "content": "I am so happy that my friend Lisa  Genova's book, Still Alice is being made into a movie.  filming begins in February and Julianne Moore has been tapped to play Alice.  I am so excited  for Lisa.  If you haven't read Still Alice, you need to TODAY!  It is a fiction book about a young Harvard professor that is diagnosed with Alzheimer's. Lisa and I did not know each other at the time she wrote this book, but that is my life.  It was eerily scary to read for me, but it is a fabulous book.  Congratulations to my friend!",
        "title": "Still Alice the movie"
    },
    {
        "content": "Over the last six months or so, I have come into contact with a whole new set of people by joining a new organization.  And, having found myself in a social situation with many of these people, I never know if it is appropriate to share my Alzheimer's diagnosis with them or not.  I see no reason to, until an opportunity arises.  However, on several occasions, that opportunity passed and then I thought if I said something after the fact it would be awkward.I do find that as I am getting older, and those around me are older that the conversation turns to Alzheimer's in one form or another -- usually someone talking about their parents or a friend having the disease.  I'm afraid if I say something at that point that it becomes a sensitive subject and people will not feel free to discuss it.  But then on the other hand, if they find out I have it, then they wonder if they said something that might have offended me.  That isn't usually the case, but if the circumstances were reversed I could see how this would be.So, I am never quite sure when to speak up.",
        "title": "When to Tell and When Not To Tell"
    },
    {
        "content": "Check this one off of my bucket list -- Thanks to my friend Sandi!",
        "title": "Corn Maze"
    },
    {
        "content": "To Dr. Anne Glass at UGA -- for having me talk to her Gerontology class again this semester.  It's always a joy to talk with her students.And, a big thank you to my friends John and Shirley, for inviting me to Lanier Village Estates last night.  There was a great crowd there for my presentation, and it was topped off with a delicious meal.  I really appreciated this opportunity to meet some new people and visit with some of the residents after my talk.Thanks again!",
        "title": "Thank you"
    },
    {
        "content": "Last week I was in New York City.  Since I have been to NYC so many times I am pretty comfortable.  Although the crowds still get to me.  I had a little breakdown on the ferry to the Statue of Liberty.  The people, the noise were just too confusing to me.I wasn't on my own too much while in the city. But one of the problems I have chronicled here is having a problem crossing the streets.  The signals are confusing for me.  Since there is little consistency in Walk Lights, I get confused.  I think the blinking of the walk light in conjunction with the traffic signals, the traffic noise and all the people is overload on my brain.  So, I do better when I am with someone to cross the street than on my own.Despite my problems, I still enjoyed the trip.Thanks to all for the birthday wishes.  My son turns 30 today.  That makes me feel old.  But I am glad I am still able to spend some quality time, as I know down the road it won't be as easy.Two speaking gigs this week -- a class at the University of Georgia and a retirement community in Northeast Georgia.Thanks for reading and keeping up with me.",
        "title": "This week"
    },
    {
        "content": "I am in NYC this week.  I just found out the the ice rink at Rockefeller Center opened today!  I am so excited ---  I love ice skating and I can't wait to get to the rink.",
        "title": "New York city"
    },
    {
        "content": "Next week is my birthday and my dear friends, Suzanne and Joe took my fishing for a birthday present.  With the help of our friend William, we went to Lake Russell and caught some fish.  My friend Suzanne caught the first \"big\" fish -- a 23+lb. hybrid bass.  That was a great catch.Suzanne and William with her prize catchThen I caught a large mouth bassThen Suzanne and I caught a couple of small fishThen I caught a 23+lb. striped bassJoe caught some fish too -- but we didn't snap a photo of him.  He and William helped us reel those big ones in -- they fought us most of the way but we did it.Thanks to everyone for a great birthday present -- not only fish, but fun, laughter and a beautiful day with beautiful friends!",
        "title": "Birthday perks"
    },
    {
        "content": "My mind is doing crazy things lately and that is why I haven't posted.  I thought the topic of this post was funny -- go figure.  I'm working on several projects right now that require writing and I am struggling big time. I have all these thoughts going through my head and if I could put them together I would have a great story!  Maybe I need an editor. I know a few but they are busy.I have been traveling a little lately.  Went to Illinois to my 40th high school reunion.  It wasn't as traumatic as people kept telling me it was.  In fact, it was nice to see some old friends.  My brother had some more surgery while I was there so times was spent at the hospital.  Since my last visit I have had a new great nephew born so a visit with him was necessary as well as all my other relatives.  My other brother got a new Pekingese and since he has three they are his children so of course a visit to see \"Charlie Brown\" was also on my agenda.  One of my best friends, Pody, also came up from Champaign to visit for a short time. I was only there about four days but I saw a lot of people.When I came back I had some meetings in Atlanta for the Alz. Association and also went to the FEDEX Cup golf tournament at East Lake for tow days.  Beautiful weather and lots of fun seeing the pros play.  Here are a few photos from the trips.  More soon.Me and my brothers before Bill's surgeryCharlie BrownNicholas StaggMy friend PodyTiger WoodsJim FurykAdam ScottDustin JohnsonPhil MickelsonSteve StrickerNick Watney and Brandt SnedekerJason DufnerMatt KucherKeegan Bradley and Steve Sticker",
        "title": "\"Gone but not forgotten\""
    },
    {
        "content": "started yesterday -- during the whole month of September you will be seeing lots of things about Alzheimer's in the media.  Starting on the 3rd there will be a series by Maria Shriver on NBC's Today Show.  Katie Couric will be opening her season with a special program on memory and Alzheimer's.Here is a link to another article on the following websites.....Clinical GeriatricsandAnnals of Long-Term Care:Thanks to Allison Musante for writing this one!http://www.clinicalgeriatrics.com/article/alzheimers-in-her-own-words",
        "title": "Alzheimer's Awareness Month"
    },
    {
        "content": "I spent last weekend with some \"thirty something\" friends.  One said she had been thinking about her bucket list since I have mentioned mine many times.  I'm glad that she is thinking about it now, while she is young and has more time to fulfill that bucket list.I have started to re-evaluate mine every few months.....adding a few things as I go. As I have mentioned before -- some of these probably should be on my bucket list because they are out of my control, but I can wish for them just the same.Bucket List -- out of my control -- kind of in order of priority if I could make them happen!1. Get tickets for myself, husband, son, daughter-in-law and brother to go to the Master's Golf Tournament in Augusta.  I've tried for years to get tickets and \"it ain't happenin\" as they say in the south.2. Become a grandparent -- definitely out of my control.3. Make a hole in one -- technically I guess I could be in control of this, but yet again, as they say in the south \"it ain't happenin\".4. Find a cure for Alzheiemer's -- definitely out of my control.Real Bucket List1. Go Skydiving2. Go to a corn maze3. Go to Denver and see a concert at Red Rocks4. Travel to Europe again5. Go on a girls weekend somewhere for fun6. Own and red Mazda Miata7. Add a screened in porch to my house8. Be skinny9. Make a difference to someone10. Have more patience with myself and my family.11. Go to Wimbledon again12. Go to ItalyI am sure in the next few months this list will change.On another thought........I have been thinking about this whole memory loss issue.  In thinking about short term memory loss, is it the fact that we cannot remember or is it the result of not processing the information?  I have found that I have a difficult time processing information, so when someone tells me something or I read it, I don't fully process that information, so I couldn't recall it if I never understood the information in the first place. I wonder if this isn't the case sometimes, rather than just forgetting something.  You can't forget something you never had in the first place.  This probably only makes sense to me!",
        "title": "Bucked List Update/Random thoughts"
    },
    {
        "content": "Thanks to Bonnie Wortheim for this post on Mashable.comhttp://mashable.com/2013/08/11/alzheimers-blog/",
        "title": "mashable"
    },
    {
        "content": "Look at this precious face!  I want to be able to remember it forever......but I know I won't. What a shame. Thanks to Chris and Katie for sharing this little one with me this weekend.",
        "title": "Can't forget this face"
    },
    {
        "content": "......gnats, gnats and more gnats.......a hawk......gnats, gnats and more gnats.....two sandy beaches......gnats, gnats and more gnatsWhat I didn't see on the golf course --.........any other birds.........a snowman..........water to go with the beachThe golf course played me today. Silly game.",
        "title": "Seen on the Golf Course today"
    },
    {
        "content": "Franklin County Rotary ClubThanks so much to the Franklin County Rotary Club for having me up to speak to their group today.  I appreciated their hospitality and support.  And, thanks to my friend Judy for going with me.",
        "title": "Thank you!"
    },
    {
        "content": "There is a reason this blog is called \"Creating memories\".  It's because when I was first diagnosed with Alzheimer's the first thing I realized was that my \"memories\" would fade over time. So, I set out documenting things like the boxes and boxes of photos we had accumulated over the years.  I re-evaluated my \"bucket list\" to see how many things I could accomplish and realized that I had short time to \"create new memories\" for my family.This all came to mind when I was with my son this week.  I shared something with him that I thought I had told him long ago, and his response was \"you never told me that\".  Then he started to laugh as he recounted all the times in his almost thirty years that he had said that to me.  You honestly don't think to tell your children everything that happened in your childhood.  And, since we don't live near relatives there are not many people around recounting stories of what I did or did not do growing up.When I look back at my life growing up I realize a lot of it surrounds sports.  My oldest brother was an athlete in high school playing football and basketball.  I don't remember a lot of that because he was so much older than I was (I was in kindergarten when he went off to college), but I do remember some of his broken bones from football.  Long after my brother was out of college he returned home and by then I had taken up many sports including figure skating, tennis and golf, to name a few.  My brother played golf on his college team so when he came home we started playing golf together. When I started working full time, every morning at 5:00 a.m. we would meet at the golf course and play nine holes before we would go off to work. That's how I really got to know my older brother.My other brother who is two years older than I am was always playing baseball, bowling, basketball or golf.  I was a tomboy and always wanted to be out in the school yard next to our house to play with the guys.  He would put me in the outfield (knowing I hated it), and then would complain to my mom that I was out there turning cartwheels instead of paying attention to the game (which I was).My dad loved to fish.  He fished almost every day of his life.  He was really into tying his own fishing flies.  My brothers didn't like to go fishing -- they said it was boring.  I wanted to go with my dad, just because I wanted to spend time with him.  He worked nights and would come home and make himself some breakfast, go fishing, come home sleep, get up and start all over again.  So, when I was in school he was  fishing or sleeping and when I was home, he was at work.  So weekends were my time to go fishing with my dad.  He also accompanied my brother and I out on the golf course. Since my dad passed away over thirty years ago, those memories of just the two of us in the boat on hot summer days are precious to me.  I hate to think I will lose them.My sports were figure skating (and the competitions that went along with that), tennis and golf.  I played an occasional summer league of softball every now and then, but girls were not encouraged into sports when I was growing up.  I loved to be outside so sports is what I was doing, whether on a frozen pond in the winter, or a tennis court in the summer (plus indoor tennis in the winter in Illinois).The reason I went into this is that many of my \"memories\" of growing up revolved around sports.  (I was also heavily involved in theater and music but that is for another blog entry.) On my bucket list there are many sporting events that I still want to see and experience with my son.  I'm only reminded of this as this week I received my annual \"you did not get tickets in the lottery for the Master's tournament\" again -- I've been trying for a long time.  I want to experience that with him as well as my brother -- and although we all enter the lottery every year we don't get tickets.  I also put in the lottery for tickets for an NCAA Final Four men's basketball tournament.  I've experienced a Final Four women's tournament with my son, but the men's side is more exciting.  So, we will keep trying and hope that those items come off that bucket list while I am still able to enjoy them.When we think of \"memories\" it is mostly about experiences.  My husband doesn't enjoy \"experiences\".  If I could spend my money any way I wanted I would travel and experience some of the things the world has to offer as well as those sporting events I would like to see.  My husband enjoys \"things\".  He wants to be able to look at something, hold it, and cherish it.  He didn't have a lot growing up so this is important to him.  We didn't have a lot growing up either, but we had tennis rackets, ice skates and baseballs!  So, we argue a lot in our house about vacations versus things. Making memories is not that important to him.  Fortunately (the way I see it anyway) my son is on my side when it comes to experiences -- he tries to buy gifts for us like tickets to a show, sporting event or to an event we would like to see.So, I will try to experience what I can and hopefully my son will have fond memories of some of our experiences together -- long after I will be able to remember them.",
        "title": "Memories/Experiences/Sports"
    },
    {
        "content": "It's been a weird week.  I seem to be about a step behind in everything I do.  I'm very unsettled and I don't do well when I am.  And, I can't pinpoint the problem, it just happens.  I have a lot on my mind and since my mind doesn't function properly, it's like these things get stuck in my mind and there is no room for everything else to go into it. The things on my mind are weighing heavily on me right now.  I used to be able to let things go, but that is more difficult for me now.  I focus on them so much that they eat away at me.  My patience wears thin and I can get pretty cranky.  When I was young and someone would tell me that I was cranky I would go take a nap and that seemed to help.  Taking a nap these days doesn't help so much.I just re-read this and it rambles -- sorry about that.  Can't seem to capture the words the way I want them today.",
        "title": "Weird Week"
    },
    {
        "content": "I have lots of things to write about but I'm having one of those days where I can't get what is in my brain to the keyboard.  So, probably most of it will have to wait.But, I wanted to tell you that you may be seeing lots of information in the next few days about Alzheimer's research.  The Alzheimer's Association is hosting their annual Research conference in Boston and it brings people from all over the world together to talk about what is being done to find a cure for Alzheimers.  I attended one of these meetings once and was blown away by how much is being done internationally.  For updates on the meeting you can go to www.alz.org.Promise to be back soon.",
        "title": "This and That"
    },
    {
        "content": "thanks for everyone's comments and emails I have received about the PRR.  Robyn --I would kill for your finishing time.  Good job!",
        "title": "Comments"
    },
    {
        "content": "I look pregnant in these photos because I have my \"fanny pack\" in front.",
        "title": "Photos from Peachtree Road Race"
    },
    {
        "content": "I promise that other than posting some photos later this is the last you will hear of the Peachtree Road Race from me this year!Thanks to all those that encouraged me and had to listen to me complain about doing this Race.  Thanks to Katie and Robyn for the running tips. Thanks to my son and daughter-in-law for including me in the race with them.  Thanks to the rest of my family and friends for having faith in me for knowing that I could do it when I wasn't sure that I could.I would have never put this event on my \"bucket list\", but I am glad I did it.  Will I do it again?  Maybe.I'm not one of the flag waving Americans that tout my freedom all the time.  But, as I was walking/running yesterday I was proud to be able to do that knowing that our freedom is many times taken for granted. I was so humbled by many that I saw walking and was proud to have been among them.Here are some things I observed during the day and things I will remember for a long time:The Giant American Flag at the beginning of the race (television doesn't do it justice)The friendliness of all the runnersThe many funny slogans on the backs of people's shirtsThe families watching with their young ones along the wayThe men running in their kiltsRunning through \"holy water\" at one of the churches and having a priest throw \"holy water\" on youThe bands that played along the routeAn older man stopping me to ask me to dance in front of a dixieland band (which I did)A radio station booth along the side of the route playing \"frosty the snowman\"Couples holding hands as they walked the courseA 92 year old man walking the route with help from friends and familyThe little girls and boys along the route wanting to give you a high fiveThe colorful tutus that many of the girls and women were wearingThe two firemen that were dressed in full fire gear to honor those fire fighters recently killed in ArizonaThe Shepherd Spinal Center patients in their wheel chairs out high fiving and encouraging us on -- very movingthe hunky firemen that were in one spot and all the pretty girls wanting their photos taken with them - I'm not sure who had the bigger smiles!The mud at Piedmont Park at the end of the race -- I actually got stuck in itThe sweet and juicy peaches at the finish lineI didn't do my personal best as far as time is concerned, but I was fine with my time.  My coveted Peachtree Road Race shirt will now get framed!",
        "title": "Reflections on the Peachtree Road Race"
    },
    {
        "content": "If you see this graphic on someone's back at the Peachtree Road Race, that would be me.",
        "title": "Walk, Don't Run"
    },
    {
        "content": "Isn't there a saying that says if it wasn't for bad luck I wouldn't have any luck?  Now I have a cold and a fever of 101, that is keeping me from pounding the pavement.  This too shall pass.",
        "title": "Bad luck"
    },
    {
        "content": "I mentioned a few posts back about a few friends who are dealing with some major medical issues.  One of those people, my friend Chris D. Is battling stage four colon cancer.  I have known Chris for about fifteen years.  We met through a professional organization.  She lives in Atlanta so I don't see her too often.  But, we have lots of things in common.  Chris is a lot of things but \"fighter\" comes to mind first and foremost.  Another thing she is is an athlete.  Looking at this petite woman you wouldn't really think that.  Among other things she is a marathon runner.  When I am out running, I constantly think about Chris.  She keeps me going when I don't think I can go any longer. I know she is going to beat this cancer, because she is so determined and strong.  although she is probably younger than I am, I want to be her when I grow up.  thanks for keeping me going Chris. You are an inspiration and motivator.",
        "title": "My friend Chris"
    },
    {
        "content": "This morning, my daughter-in-law and I did the Peachtree course.  I walked most of the way and she ran most of the wait.  she was kind enough to wait up for me in spots, so I defintely slowed her down.  But we did 6.5 miles in 1:45.  My goal is to finish in two hours so if I can hold to that I should be o.k. I have a few more weeks to train.  thanks to Jen for going with me.",
        "title": "The first running of the Peachtree"
    },
    {
        "content": "",
        "title": "T Minus 20 Days And Counting"
    },
    {
        "content": "My husband said since I have been outrunningwalking to get ready for this race I don't \"jiggle\" as much!  For those that know my husband, that is a compliment.  You take them however you can get them!",
        "title": "Funny things my husband says"
    },
    {
        "content": "I just haven't had a very good spring/early summer. Today I had a tumor removed from the inside of my cheek. Don't really know how long it has been there -- I thought a few weeks.....the doctor thinks longer.  Anyway, since I am a little high on pain meds, I'll leave it at that.  Won't get a biopsy report for a couple of weeks.",
        "title": "It's always something"
    },
    {
        "content": "As I try to train for the Peachtree Road Race, I have lots of time to think.  That's probably not a good thing.  But, some of the things I have thought of lately are:If I set a goal to come in last at the Peachree I can probably achieve that goal.Was wondering if I could take my number off during the race and give it to someone else that would finish faster and have them carry it across the finish lineMake a sign to put on my back that says\"  Caution StudentDriverRunner -- Expect DelaysToo much time to think.",
        "title": "Peachtree Road Race"
    },
    {
        "content": "As I try to prepare myself torunwalk the Peachtree Road Race in July, it seems like a big hurdle to jump.  I'm not a runner, never been a runner.  But, as I diligently trudge my old overweight body out to the streets to  try to run -- the hurdle seems to get taller and taller.  However, as I trudge up and down the hills I think of two of my friends battling breast cancer, another friend who just lost her 61 year old husband, and another friend that just found out she has stage four colon cancer.  Those are big hurdles.....mine is not.",
        "title": "Hurdles in Life"
    },
    {
        "content": "It's hard for me to write this, but considering this is a blog about Dealing With Alzheimer's I must.  This past Monday was really hard.My husband was in St. Louis visiting his family.  those of you that follow my blog know that I usually enjoy my time alone when he leaves -- it's real quiet and peaceful!  And, it had been for several days. But then Monday morning came around.I had purchased a new fishing rod and reel on Sunday.  On Monday morning, I went to adjust the line and get it in working order.  When I started to do it, it confused me.  I couldn't quite figure out how to do it -- but it's pretty simple you know?  I got frustrated pretty quickly and thought I'll just put it aside and come to it later.  I then decided to go into my craft room and try to clean and straighten up the mess I had in there.  When I went into the room, I couldn't clean it.  I looked at everything -- there were stacks of paper everywhere, scissors, scraps of paper on the floor, etc.  I knew that eventually I had to run the vacuum in that room, but I couldn't figure out how to pick things up off the floor in order to vacuum.  I couldn't pick up the stacks of paper I had laying around and organize them or even straighten them to put away in their nice cubby hole.  How hard is it to pick something up off the floor?  But I could not do it.   I decided to try something else.I then went to do some laundry.  I got the clothes in the washing machine, but I couldn't figure out how to turn the washer on.  I should be able to do that in my sleep right?I decided to leave that task and go outside for some fresh air. I had a major panic attack and couldn't go outside.I had become a prisoner in my own house and couldn't do anything. I realized I was not in a good situation with all of this happening.  I called several friends at home and at work and either they were not home or they weren't in their office.  So, I broke down.  I'm not a \"crier\", but I started to cry and I didn't stop.  I tried to call my husband in St. Louis -- he knows how I get when things like this happen.  But he wasn't answering his phone.  Then I called my son.  He has not experienced me this way and I am sure I scared him.  When I am like this, I can only tell you that \"I can't do anything\".  I am not capable of telling you all the things I can't do -- all I can get out of my mouth is \"I can't do anything\".  I'm sure when my son picked up the phone and I was sobbing out of control he figured something had happened to me or his dad.  He offered to come over but I told him no I just needed to hear his voice.  After that phone call I finally got in touch with my husband, and although he wasn't here with me, he understood what was happening to me and it made me feel better.  But it makes me feel so stupid when I can't do the simplest things. Logically, I know I am not stupid, but I can't get that out of my mind.  I had thought of calling a neighbor to come help me but I didn't want to tell them that I couldn't turn my washer on!   I feel like I have a big \"S\" on my head for stupid.The thing about these episodes is that I know what I am suppose to do, but I cannot physically do it.  It's like the instructions are written in a foreign language. The thought is in my brain but it can't be relayed into action. As you can imagine it is very frustrating.  Things like this happen to me all the time, but not usually all at one time. Luckily, I didn't have anything that I absolutely had to do that day and of course I didn't.  I honestly don't remember much of the rest of the day other than my husband and son both called to check on me.  I was still crying a lot during the day which is not like me.The rest of the week has been much better compared to my Meltdown Monday.",
        "title": "Meltdown Monday"
    },
    {
        "content": "to everyone out there.  I had some nice time with my son.  I miss our \"date nights\" we used to have, so this probably came pretty close to those days.  I appreciated him taking time for me today.",
        "title": "Happy Mother's Day"
    },
    {
        "content": "several people asked me a question today and I found myself lying because I didn't want to admit the truth. that is kind of sad.",
        "title": "dodging the question"
    },
    {
        "content": "I'm so proud of some of my young friends who are graduating in the next few months.  My beautiful great neice Amelia (pictured below) is graduating at the top of her senior class at the ripe old age of 16 -- yes, 16.  We are so proud of her.  She has been accepted to several universities -- two in Atlantaso we are hoping to see more of her.  She'll be majoring in bio medical engineering.My friend Christopher will be graduating from med school, and my friend Josh has decided to go for his PhD.  I'm proud of everyone but as I write this I think that it also makes me feel old!Today I had the privilege of going to a breakfast put on by the Grady College of Journalism at UGA.  A friend of mine received a \"Lifetime Achievement\" award.  While there I was re-acquainted with many people that I have worked with on various projects throughout the years.  Two of them told me they read my blog and I was amazed -- but thank you both for telling me that you do click on here occasionally and keep up with my upside down world. It was nice to see everyone and congrats to my friend who certainly deserved it.",
        "title": "Graduations, Awards and Rewards"
    },
    {
        "content": "When most people think about Alzheimer’s many only think of\npeople losing their memory.  But it is so\nmuch more.  It’s getting confused about\nthe simplest things, not being able to make change in a store, not being able\nto follow a conversation, having a problem crossing the street, not being able\nto productive.   Memory is still a big\npart of the whole picture, but medicine has been somewhat helpful for me.I worry about the memories yet to be made.  I worry about the things I will forget – like\nweddings, graduations, first steps, birthdays and vacations.  We all tend to take them for granted.Several years ago I went to the local card store looking for\na card to send to my son Alan on\nMother’s Day.  I wanted to thank him for\nbeing a good son and making me the mother I was – be it good or bad! But\nHallmark hadn't caught on to that, so I expressed my feelings another way.So as Mother’s Day approaches I wanted to “remember” some\nthings from my experience as a mother so if you’ll indulge me in this I have a\nfew things to say to my son –Dear Alan –I remember ---Reading\n     Curious George books to you over and over and overYou\n     correcting me if I missed a word here and thereYour\n     kindergarten teacher calling to tell me she didn’t feel comfortable\n     reading a story your wrote about how babies were made because it was too real for the other children\n     to hear – you have your father to thank for that!The\n     “marble incident”The\n     first time I saw you singing in a school play – I had no ideaYour\n     “first crush” that was not reciprocatedHow\n     nervous I used to get when you were in musical theater productions.  I don’t know how athletes’ mothers\n     handle it!That\n     you didn't seem embarrassed when we did a few shows together – thank you\n     for that opportunityHow\n     you used “the marble incident” as the topic for an important paper“Date\n     night” – did I really think I was teaching you how to act on a date?When\n     you got mononucleosis your freshman year in college and worried about your\n     gradesTelling\n     you about my Alzheimer’s diagnosis and sharing some tears with you.  That’s when you told me about meeting\n     Jennifer – your future wife.You\n     being miffed that Yale put you on a waiting list forLawSchoolWatching\n     you deliver a speech inMaconon our family’s battle with Alzheimer’sYour\n     law school graduation from Stanford – you worked hard for thatYou\n     coming to my rescue in aNew York\n       Citysubway on the way out to Flushing Meadow for\n     the US OpenIce\n     skating inRockefellerCenter, in Pentagon Row inWashingtonDCand inAtlanta– notwithstanding Dad’s broken\n     elbowYou\n     telling us that you wanted to move closer to home once you finished your\n     clerkship in DCGiving\n     you all the letters I had written you over the years on the eve of your\n     wedding – that was hard for both of usOf\n     course, the weddingYou\n     and Jennifer buying your first house.As I write this, I chuckle to myself at all the things you\nwould probably remember differently – but it’s Mother’s Day and it’s my\nturn!  Seriously, you and Jennifer have\nso many more memories to make in the years to come. And, although I may be\naround in body, I’ll miss many of them. As you grow older, you’ll realize how\nprecious memories can be.  I cherish all\nof those I can remember now and hate that I have already lost some.Thanks for making me the mom I am – good or bad.Love,\nMom",
        "title": "\"Remembering\" on Mother's Day"
    },
    {
        "content": "I received the nicest thank you not yesterday from Tamar Shovali's Psychology class.  They always send me a note after speaking to them and it is so nice that they all sign it and leave a note for me.  Thanks to Tamar for having me talk with her class and the best of luck in her new endeavors.I also had the pleasure of speaking at the Heart of Gold Pilot Club meeting in Cleveland Georgia over the weekend.  A big thanks to all that made it possible.  I decided from now on, I'm going to take my camera and take a photo of the groups I speak to as they are always taking pictures of me.  It will be a nice reminder  for me.  My next speaking engagement starts at 6:30 a.m. -- good thing I am an early riser!A friend of mine writes a very eloquent blog.  And, she posts every week.  I'm always amazed that she can write on the simplest of topics with such ease.  And, I realize that it might seem \"easy\" to her, but it sounds like it just rolled off her tongue.  I would like to think that I used to be able to do it, but not like she does.  I'm impressed -- maybe when I grow up I can be like her. Thanks RF.When I speak to groups, I often give them some a list of references to turn to regarding Alzheimer's.  I don't usually have this as a handout but I need to do one. But until I do, I thought I would list some of the references here -- there are more I know -- but these are the ones currently on my power point presentation.•Alzheimer’s Association --www.alz.org•Still Aliceby Lisa Genova•The Forgettingby David Shenk•Thousand Mile Stareby Gary Reiswig•Jan’s Storyby Barry Petersen•Alzheimer’s Early Stagesby Daniel Kuhn•Learning to Speak Alzheimer’sby Joanne Koenig CosteLiving Your Best with Early-Stage Alzheimer's- Lisa SnyderThe All-Weather Friend's Guide to Alzheimer's Disease- Mary M. Cail•The Alzheimer’s Project– HBO Documentary•The Shriver Report",
        "title": "Speaking and writing"
    },
    {
        "content": "One missed step = 2 cracked ribs = lots of pain medication!",
        "title": "One big mistake"
    },
    {
        "content": "A good friend died a few weeks ago and yesterday was her memorial service.  I'm so glad that Kathy Wolfe came into my life.  She will be missed by her family and her friends.  She battled courageously for 13 years with ovarian cancer.  A fighter she was.  I worked with Kathy at the Classic Center and yesterday there was a reception there to honor her.  This photo shows some of the many people that worked with her during that time.  We will all miss her. We had a lot of great memories with this group.Then this past weekend my good friends Mac and Brenda Rawson took me fishing to Lake Hartwell.  Mac caught two pretty good sized spotted bass.  Brenda and I caught some sun while in the boat -- enough said. Thanks for taking me along for the ride!",
        "title": "Memories"
    },
    {
        "content": "It's been awhile.  I have had a really hard time putting words down here in the past few weeks.  Just couldn't get my thoughts together.  I've tried -- but just couldn't get something published.Since my last post -- my foot is healing well.  It will be a couple more weeks before I can really exercise, but I'm walking fine and it is feeling better every day.I am not a runner.  Never have been, never will be.  I think it has something to do with my lung capacity or something.  Having said that, I'm going to be running in the Peachtree Road Race on the Fourth of July in Atlanta.  It is only 6.2 miles.  When I walk on the treadmill at the gym I usually walk 4 miles in an hour, so I figure if I can't run it I can probably walk it.  This is not really something ever I aspired to do, but my son and daughter-in-law live very close to where the route of the race goes.  Last year, they walked a few blocks to watch all the runners and suggested we do this together the next year (this year). At the time, I thought it sounded like a good idea.  The Race accepts 60,000 people every year.....yes, 60,000 people.  You have to enter a lottery to get a spot.  Well, wouldn't you know that we won a spot from the lottery.  Why couldn't I have won the Georgia lottery, or the lottery for Master's tickets, or the lottery for Final Four tickets -- no I have to win the lottery for the Peachtree Road Race.  So, I'm starting to get motivated and when I can at least walk for exercise I'll gear up for running and train for the next few months.  I'll probably be the last person over the finish line, but I'll finish one way or another.The problem I know I will have is -- the sheer number of people.  I dont do well in crowds as I have chronicled before -- but considering we will be in the back on the pack I probably won't be in much of a crowd, but one just the same.  We'll see how this all goes.  Luckily my son and daughter-in-law will be with me, or at least at the start of the race anyway!A friend of mne passed away a few weeks ago. She valiantly battled ovarian cancer for the last 13 years.  She was a fighter, but I know she is in a better place now.  Another friend lost his mothr this weekend and it is always hard to lose a parent.  My thoughts are with both families this weekend.Thanks to Northridge Medical Center in Commerce Georgia for having me come to speak to their Alzheimer's 101 Class a few weeks ago.  The group was great and I enjoyed seeing everyone.  I'll be speaking in Cleveland Georgia April 27th at the Pilot Club if anyone is interested. You can leave me a message or send me an email and I'll give you specifics.I go to the neurologist in the morning.  Lots of things have been happening there that I'm not going into here, but we'll see how my appointment goes tomorrow.As I mentioned earlier, I've been having trouble communicating.  A problem I am having with a friend of mine, I think stems from the problem I have in communicating.  It is hard to explain and I don't know if it is a matter of the friendship just losing its luster, or the communications problem.  I hate it, but I don't know what to do about it.  I try to work hard on keeping my friendships up, but sometimes, it is time to let go.  Maybe I have come to that point.Hope everyone had a good Easter.",
        "title": "This and That"
    },
    {
        "content": "I had a good class when I went to speak this week at the UGA Psych department.  My thanks to Tamar Shovali for asking me to come to speak.  She'll be moving on to another university and I wish her the best.Friday I had surgery on my foot.  I was suppose to have it done a couple of weeks ago but there was a scheduling problem.  I had Morton's Neuroma which is basically an inflamed nerve in my foot.  I had it almost thirty years ago in my left foot and had it removed.  It wasn't too bad.  Well, this time the damage was a little more extenisve so the operation took longer and I'm pretty sore.  So, it was worse than last time, or maybe that I am older it just seems worse.  Have to continue to stay off of it for a few days and I go back and have a new dressing put on it tomorrow.  Then, we'll see what the doctor has to say.I'm suppose to be going to the women's SEC basketball tourney in Atlanta this week, but I guess we will to wait and see.On another note, my sister-in-law's mother passed away yesterday.  They live in Illinois and although her mom had been in bad health for awhile, it is always sad to lose a parent.  My love to the family.",
        "title": "Surgery"
    },
    {
        "content": "Tomorrow I have the privlege to speak to a pyschology class at UGA.  It's always interesting talking to a younger crowd about this disease.  Most have a hard time relating, but when I was diagnosed my son was a freshman in college.  So, I hope that when I do get the chance to speak to young people, they can grasp the fact that this can happen to their parents. It's sobering, but something to understand.",
        "title": "Speaking"
    },
    {
        "content": "I was trying to be so good, writing on this thing.  I notice that it has been almost three weeks since I've blogged and I am sorry.  The winner of the scrapbooking software is Brenda R.  Thanks to all those that commented.Next week -- the Georgia Alzheimer's Association is having their Awareness Day at the Capitol.  I have always been able to go but this year, due to some surgery on my foot I can't make it.  But if you live in Georgia and can go -- it is next Wednesday, the 27th.  Go to www.alz.org/Georgia for more information and to register for the day.  The Statewide network of Area Councils on Aging will also be there to help put our issues in front of the legislators.  It is an interesting day and you will learn a lot.  I encourage you to go and help to promote a State Plan to Attack Alzheimer's for the state of Georgia.",
        "title": "Better late than never"
    },
    {
        "content": "When I was initially diagnosed with Alzheimer's one of the first things I did was to go through all my photographs and write on the back of them who everyone was, the date and place that it was taken.  I knew my family wouldn't remember and I knew in time that I wouldn't remember either.  After I did that (which literally took months) I decided to \"scrapbook\" them.  Yes, that meant making captions and cute little sayings and adding little embellishments to the pages.  It was a lot of work, but it kept my mind busy.I still do that, but I have also had the opportunity to dive into the world of digital scrapbooking.  I wasn't sure I could learn it, but I did. I starting using a digital scrapbooking software program call My Memories.  If I can learn how to do this, so can you.  I've used it off and on for about a year, and it does save time and your \"memories\" can certainly be preserved in a more secure way than all those scrapbook pages.  Last count I had over 470 actual scrapbook pages that I did by hand -- the digital version is much faster and cleaner.  I will never give up scrapbooking as we know it now, but this is a good program if you are interested in diving in.The creators of My Memories have reached out to me and they have given me a copy of the software program to give away to one of my readers.  The site for them is MyMemories.com. They also have a facebook page that you can like to get some ideas.  I encourage you to check it out and get a feel for it.  If you would like to win a copy of this software, just leave me a message or send me an email and I'll pick someone.I get bombarded with people asking me to look at their products and I don't endorse them unless I'm really sold on them.  This works for me and I think it can work for you.  Give it a try -- look forward to hearing from you.",
        "title": "Scrapbooking"
    },
    {
        "content": "There are all kinds of \"love\". We use the word all the time.  \"I just love that dress!\"  \"Wouldn't you love to have that car?\"  There's puppy love, first loves, our \"only love\", the love of my life......you get the picture. When you're in a relationship for the first time, it's always tense until one person finally utters those three little words.  In my family growing up, we didn't say \"I love you\" very often.  I guess it was a given.  I never really gave it much thought.  We were a loving family, but those words just didn't tumble out of our mouths.  And, most of the people I knew didn't say it that often to others in their family.  Maybe because I grew up in the Midwest -- I'm not trying to stereotype here.....however, when I moved to the south over 30 years ago that is one of the things I noticed first.......how many times people said \"I love you\".  Because I heard it so much it didn't really seem genuine to me.  It's kind of like hearing people at the bank or the grocery saying \"have a nice day\", instead of just saying thank you.  You don't really hear it the same.After moving to the South I started to give it some more thought.  My first thought was, do people really think I don't love them because I don't say it very often?  Will they really hear what I am saying when I say it?My husband is very quiet and reserved and for him to say those three little words is something short of a miracle, so I don't push it.  But when I had my son I couldn't say it enough -- and I was certain that was something I wanted him to say frequently.  I think I got him to say that more than \"Yes ma'am and No Ma'am\" which is sacred in the south as well.  But at least I love you worked on him even if I couldn't make the Yes ma'am No ma'am thing stick. (As you can see I'm shooting 50% here with husband and son)I've become more comfortable with telling people I know how important they are to me and yes, that I even love them.  I used to think that that was just for those in our immediate family who we were almost bonded to love because they were a part of us.  It took me a long time to realize that my friends that are important to me are worthy of the \"I love you\" phrase and it should be said more often.Over the holidays a very long time friend (who also happens to be a native northerner) said \"I Love You\" to me and I was so taken by it I didn't know how to respond.  Isn't that an interesting response after thinking I had actually broken that barrier.  I was proud of myself for also saying those three little words before we parted.  It made me feel good.  And, this week, I received a very touching email from a friend and she signed it \"I love you\". And, even though we have exchanged those words to each other frequently it still moved me.Don't wait....tell someone you love them.....you'll never know how that will lift someone's mood.",
        "title": "\"Love\""
    },
    {
        "content": "Many of you have asked about the Advocacy Day at the Capitol in Atlanta this year.  This year, it is February 27th.  One of the things that we are advocating for is a state plan for dealing with Alzheimer's.  If you live in the state of Georgia, please read below -- this is something that was put out by the Alzheimer's Association of Georgia and how you can help. If you have any questions at all, there is an 800 number at the bottom you can call.   Thanks for reading this and helping to get this passed.The \nAlzheimer’s Association, Georgia Chapter Applauds Senator Renee Unterman’s \nPre-filing Senate Bill 14, Creating the Georgia Alzheimer’s and Related \nDementias State Plan Task ForceOn Thursday, December 20, Senator Renee \nUnterman held a press conference at the Georgia State Capitol. Senator Unterman \nstated that the purpose of the press conference was “…the introduction of the \nlegislation creating a state wide task force establishment to assess the current \nand future impact of Alzheimer’s disease in the state of Georgia. It will \nexamine the existing industries, services, and resources addressing the needs of \nGeorgians afflicted with the disease and its effect on their families. It will \ndevelop a strategy to mobilize a state response to this public health \ncrisis.”“…Georgia must be prepared with an active plan to share \nthe burden of taking care of its citizens who are likely to require government \nassistance in the final stages of their lives due to the effects of dementia. \nWhether those services are provided in-home, community based, or in a nursing \nhome type facility, Georgia must be ready to improve its health care \ninfrastructure.I \nchallenge the Departments of Human Services and Aging, the Department of Public \nHealth, the Executive branch and General Assembly to actively participate in \ndeveloping this plan by approving this legislation.”The bill creates the Georgia Alzheimer’s \nand Related Dementias State Plan Task Force, for the purpose of:Studying and collecting information and data to assess \nthe current and future impact of Alzheimer’s disease on Georgia’s citizens;To examine the existing \nindustries, services, and resources addressing the needs of persons with \nAlzheimer’s disease, their families, and caregivers;To review the National Plan to \nAddress Alzheimer’s Disease; andTo develop a strategy to \nmobilize a state response to Alzheimer’s and related dementias as a public \nhealth crisis by creating a state plan.The \nproposed State Plan Task force will be chaired by the director of the Division \nof Aging Services, and includes the Commissioner of Community Health or his or \nher designee, the State Health Officer or his or her designee, the Chairperson \nof the House Committee on Health and Human Services, the Chairperson of the \nSenate Health and Human Services Committee, and the Chairperson of the House \nCommittee on Human Relations and Aging. The Task Force shall invite other \nadvisory members to assist the committee and may consider the following in \nmaking its selection. This membership includes individuals with Alzheimer’s and \na related dementia and their caregivers, members of the various care services \nindustries, a medical provider, a researcher, law enforcement personnel, and \nmembers from the public, private and non-profit sectors, voluntary health \norganizations, and the faith-based community.At a \nminimum, the State Plan shall include the following:Trends in state Alzheimer’s \nand related dementias population and needs, including the changing population \nwith dementia;Existing services, resources, \nand capacity;Needed state policies or \nresponses, including but not limited to directions for the provision of clear \nand coordinate services and support to persons and families living with \nAlzheimer’s disease and related disorders and strategies to address any \nidentified gaps in services;Ways in which state and local \nagencies, private sector, quasi-governmental, voluntary health organizations, \nthe faith community and nonprofit organizations can collaborate and work \ntogether to form a seamless network of education, support, and other needed \nservices to those living with Alzheimer’s disease and related dementias and \ntheir families;A review of, at a minimum, \neighteen specific areas of concern.The \ntask force shall issue a state plan which shall include proposed legislation, if \nany, to the Governor and General Assembly on or before March 31, 2014.  Upon \nabolishment of the task force, the Georgia Alzheimer’s and Related Dementias \nAdvisory Council shall be created, with the same membership as the original \nState Plan Task Force. The Advisory Council shall meet at least annually to \nreview the progress of the State Plan and to make any recommendations for \nchanges as well as to recommend any legislation needed to implement the \nPlan.How \nYou Can Advocate for the Passage of Senate Bill 14There are two very specific actions you \ncan take to advocate for passage ofSenate Bill 14.To complete an \non-line copy of theGeorgia State \nPlan Input form. If you’d prefer to receive a hard copy of the form \non which to provide input, please call 1-800-272-3900 and ask for a copy of the \nGeorgia State Plan Input Form.Join us for \ntheAlzheimer’s Awareness Day at the Georgia State Capitol on \nWednesday, February 27, 2013, 9:00 a.m. – 3:30 p.m.REGISTERto attend our 2013 Alzheimer's Awareness Day at the \nGeorgia State Capitol.We have \njointly planned with the Georgia Council on Aging to hold Awareness Day on the \nfirst day of their Senior Week at the Capitol. Their advocates will be joining \nus in advocating for Senate Bill 14.The tentative agenda for Awareness \nDay is:8:30 - 9:30 AM Awareness Day \nRegistration—Central Presbyterian Church (CPC)9:00 AMAlzheimer's \nAwareness Day Kickoff--CPC10:00 AM--TentativeFull Group Photo with Governor--Time TBD based upon Governor's \nSchedule—photo on South Wing Capitol Steps (Inside)10:30 AM - 3:00 PMAppointments \nwith legislators/calling legislators out of session/House or Senate \nGallery when not in meetings-- Capitol11:30 AM - 1:30 PMLunch with \nLegislators--advocates and legislators drop in for lunch at CPC as \ntheir schedules permit3:00 PM - 3:30 PMState Plan Rally/Candlelight Rally--outside, Washington Street \nSide of CapitolWe will also be advocating to strengthen \nGeorgia’s already Strong Adult Guardianship laws, and toensure \nthat there are no cuts to Alzheimer’s Respite Funding.There is no cost to register for/attend Alzheimer’s \nAwareness Day at the Georgia State Capitol—but, you must register in advance in \norder for us to have an accurate head count for lunch and t-shirts, and in order \nfor us to schedule appointments with your legislators for you. Registration is \nlimited, due to church Fire Code, to the first 400 people who \nregister.To \nequip you to speak with your legislator, and to enable you to develop confidence \nin discussing the issues, we are offeringAwareness Day Trainingopportunitiesacross the state:Atlanta Chapter \nOffice, 41 Perimeter Center East, Suite 550, Atlanta, GA   30346Monday, February \n11, 10:00 a.. - 12:00 noonMonday, February \n11, 6:30 p.m. - 8:30 p.m.Augusta Regional \nOffice, 106 SRP Drive, Evans, GA   30809Wednesday, \nFebruary 13, 2:00 p.m. - 3:30 p.m.Wednesday, February 13, 6:30 p.m. - 8:00 \np.m.Columbus Regional \nOffice, 5900 River Road, Suite 301, Columbus, GA   31904Thursday, \nFebruary 14, 1:00 p.m. - 2:30 p.m.Thursday, \nFebruary 14, 6:00 p.m. - 7:30 p.m.Dalton Regional \nOffice, 922 E. Morris Street, Dalton, GA   30721Wednesday, \nJanuary 30, 3:00 p.m. - 5:00 p.m.Macon Regional \nOffice, 886 Mulberry Street, Macon, GA   31201Thursday, \nFebruary 7, 9:00 a.m. - 10:30 a.m.Thursday, \nFebruary 7, 5:30 p.m. - 7:00 p.m.Rome/Floyd County \nLibrary, Oostanaula Room, 205 Riverside Parkway, NE, Rome, GATuesday, February \n5, 3:00 p.m. - 5:00 p.m.Savannah Regional \nOffice, 201 Television Circle, Savannah, GA   31406Wednesday, \nFebruary 6, 10:00 am. - 12;00 noonStatesboro--Pittman Park United Methodist Church, 1102 \nFair Road, Statesboro, GA   30458Thursday, \nFebruary 7, 10:00 a.m. - 12:00 noonTifton--Leroy \nRogers Senior Center, 315 W. Second Street, Tifton, GA   31794Thursday, \nFebruary 7, 5:30 p.m. - 7:00  p.m.Tuesday, February \n12, 10:00 a.m. - 11:30 \na.m.Just in case you \nare not able to attend one of the regional trainings, we will also offer \nthreeon-line training opportunities. If you register for one \nof these, we will e-mail the webinar information to you just a few days prior to \nthe scheduled call:Thursday, February 21, 9:00 \na.m. - 11:00 a.m.Thursday, February 21, 6:30 \np.m. - 8:30 p.m.Saturday, February 23, 10:00 \na.m. - 12:00 noonQuestions?  Call \n1-800-272-3900",
        "title": "Advocacy Day at the Capitol"
    },
    {
        "content": "Happy New Year from our Family to YoursI've been doing this for about 8 years.  When I went back and look at my history of my posts it averages out to about one post every two weeks.  I was much better in the beginning -- I guess that is how we are sometimes with our new year's resolutions ---- good in the beginning and then we falter.  I'm going to try to stay more on target this year -- with at least a post a week.I read other people's blogs all the time and I'm jealous of the work they put into it -- it's not as easy at it looks, or at least it isn't for me anymore.  But stay with me -- I'll be back soon!",
        "title": "To Better blogging"
    }
]