[
    {
        "content": "I know it has been awhile since I have written.  I just haven't been able to put my words down.  I think about what I am going to write and then I just can't get the words to go from my head to the page.  Lots of things have been going on -- not bad things -- but just a lot for me to keep track of.  Not doing the \"multi-task\" things so well anymore so everything just seems to pile up in my brain and I can't sort through anything.Since I last wrote we have been to my son's in Atlanta for Thanksgiving. We shared the day with my great niece who goes to Emory in Atlanta, my daughter-in-laws parents and her sister.  It was a great day....quiet and Jen and Alan did the cooking so it was an easy day for me.Last weekend we spent time in Memphis with my nephew Jonathan and my sister-in-law Fran.  Jonathan ran his first marathon there.  I was so proud of him.  He ran in the St. Jude marathon.  Many years ago my great nephew had leukemia and was treated by St. Jude.  When Jonathan was looking for a marathon he chose the St. Jude charity as they had helped our family so much.  Jonathan came down from Champaign Illinois and brought his mom -- Fran. I was so glad she could come as she has been pretty much housebound the past six years caring for my oldest brother who passed away this summer.  We rented a house while in Memphis and spent some time catching up and enjoying Jonathan's accomplishments. But it was a tiring weekend and it took me all week to rest up after the long drive to Memphis.Now that Christmas is almost upon us, I am trying my best to stay with my routine but it is hard.  I feel like I am a \"day late and dollar short\" with all the things I want to do, but feel overwhelmed.  I've asked my family for no presents this year, as I really don't need anything and I just want time with my family.  That is more precious to me and the best gift of all.",
        "title": "I am here"
    },
    {
        "content": "This morning was our annual Walk To End Alzheimer's.  Thanks to all my family and friends that came out to walk.  Our team raised over $17,000 toward the cause!  Thanks so much!  Pictured above is me with my son Alan and UGA Women's Basketball Coach Andy Landers.  Coach Landers was gracious for walking with us and allowing the UGA Women's Basketball team to help with the Walk.  So proud to be a Lady Bulldog Fan!  Thanks to everyone who donated to the Walk -- I really appreciate your support!",
        "title": "Walk To End Alzheimer's"
    },
    {
        "content": "I couldn't help but post this review from Variety about my friend Lisa Genova's film adaptation of Still Alice.  It got rave reviews at the Toronto Film Festival and it will be in contention for Oscar season.  So proud of Lisa and for everyone involved with the film.Still Alice movie review from Variety",
        "title": "Still Alice -- the Movie"
    },
    {
        "content": "I have had two speaking engagements in the last couple of weeks -- thanks to my new friends in Madison Georgia and the First Presbyterian group here in Athens.  I so appreciate you asking me to speak to your groups and meeting all of you.  Thanks for wanting to learn more about Alzheimer's and helping to spread the word about this dreaded disease.A dear friend of mine, Kathy Davis, is holding an Alzheimer's fundraising awareness event at her church on Saturday October 11th. It will be held at Moon's Grove Baptist Church, 1985 Moon's Grove Church Road in Colbert Georgia from 11am to 1 p.m. The event will feature jewelry sales (all proceeds go to the Walk to End Alzheimer's), gel nail manicures, raffles and lots of fun for everyone.  Information about Alzheimer's will be available. Also, my friend Kathy will be walking with us this year in the Walk To End Alzheimer's....see below.  She is asking everyone that comes to the event to bring a framed photo in honor or in memory of someone they know that has (had) Alzheimer's.  Kathy wants to then take a photo of all the photos gathered at the event and carry this photo with her in the walk.  She also wants families to sign a t-shirt she will wear on the day of the walk to remember and honor all of her friends and their families that are dealing with Alzheimer's.  It sounds like a great event and I would encourage all of those living out near Colbert to take a few minutes and go by Moon's Grove Baptist Church on Saturday October 11th and say hello to Kathy and do your part to End Alzheimer's.1985 Moon's Grove Church Road - Colbert, GA 30628  -  706-7This year's Athens Walk To End Alzheimer's is Saturday October 25th. Thanks to all who have contributed to make our team-- Team Athens the top team for Athens so far. If you still want to donate to the cause you may do so here -- any amount is appreciated!http://act.alz.org/site/TR/Walk2014/GA-Georgia?px=1672482&pg=personal&fr_id=5035",
        "title": "Alzheimer's Awareness events"
    },
    {
        "content": "I've had so many things going on, so many thoughts in my head, I couldn't get them down on paper.  So many things I have wanted to write about, but getting them out of the brain and through my fingers to the keyboard has been impossible the last few weeks.  I keep making notes of things I want to write about but then when it comes time to sit down and process all the information -- the \"processing\" fails.  Some days it is like that.....hard to express what you want to say......hard to even say the things you want to say.I panic when I can't get the thoughts organized in my brain enough to share them.  I think \"this is the beginning of the end\", \"I'll never be able to have a rational thought in my brain\". But, eventually, the thoughts become clearer and sharper.......for now.",
        "title": "It's been awhile"
    },
    {
        "content": "has returned.  As you can see by this photo -- we have a friendly deer that comes to get the water out of the watermelon rind we put outside. This is right outside our back door.",
        "title": "The heat"
    },
    {
        "content": "I am currently in Bar Harbor Maine.  I am enjoying the scenery, the lobster and the beautiful weather. my son is Iceland, enjoying the scenery, beautiful weather, glaciers, volcanoes and hot spas. who has the better deal here?",
        "title": "Vacations"
    },
    {
        "content": "About two and half months ago I had my left knee replaced.  I had my right knee replaced about three years ago.  I thought I remembered how long it took for therapy and getting back to \"normal\" was, but apparently not.  Although, this time around during and after prescribed physical therapy I took to the pool once a day and got stronger a lot faster than I thought I would.So, last week, I started playing Pickleball again.  I am still not running -- kind of hobbling along best I can.  My partners have been good to me and compensated for my weaknesses.  But, one day I was playing and in an effort to \"guard my knee\" I took a tumble on the court.  It wasn't the first time I or others have fallen on the court.  We play on a basketball court and sometimes depending on the shoes you wear, your feet can get \"stuck\" on the floor -- so your body moves but your feet don't, and consequently, down you go.  Well, that is what happened to me and this was the resulta nice bruise to the right thigh. But I didn't hurt my knee!Tomorrow I am playing golf for the first time since my knee surgery -- let's hope nothing else happens.",
        "title": "Back At It?"
    },
    {
        "content": "We returned from Illinois where we celebrated my brother's life with his wife, my other brother and my brother's children and grandchildren.  It was nice to be with family.  My sister-in-law is doing well, but I know she is exhausted from everything.  Now that my brother is in a better place, we hope Fran will finally get to do some things she has not been able to do for the past few years.My friends Pody and Rick also came to visit us while we were in Peoria. They are the best friends.......I have many people that I consider \"best friends\" in the sense they are always there when you need them and even when you don't think you need them, they are there.I had my knee replaced a little over two months ago.  I'm not sure if I posted that or not, but I'm glad to say that I am doing much better.  Thanks, in large part to swimming every day and my physical therapy.  This week, I went back to Pickleball -- even though my running is still not what it should be, I was able to play and that makes me happy.  Getting to see my little Pickleball family was good and it lifted my spirits.",
        "title": "Back from Illinois"
    },
    {
        "content": "As many of you know that have been following me for awhile my oldest brother, Bill has been in ill health for several years.  He has been on borrowed time. But the end is near for him -- the past week has seen a heart attack and two strokes among other things. He left the hospital today to go home to be with loved ones for his final few days.  We have known this day was coming -- but quite truthfully I thought this \"time\" had come many times before. Now that it is finally here we know that he will be in a better place shortly and in no pain. He is surrounded by his family.Bill is 13 years older than me so I didn't real know him as a brother. When I was in kindergarten he was in college. I vaguely remember going to some basketball and football games he played in high school. I also remember some times when he baby sat for me and my other brother (who is only two years older than me). After my brother graduated from college he lived away from home, then married. So, I really never spent a lot of time with him until we were both adults. When I was out on my own, we only lived a few miles apart and worked in office buildings across the street from each other. For about a year, every morning we would meet at 5am and play nine holes of golf together. It still gave us time to go to our respective houses and change and get ready for work.  It is kind of strange that that is what I remember the most. I can't remember who won the golf games, but I would be surprised if I won any of them since he played golf on his college team. I am just grateful he shared that time with me.He has requested no funeral, no memorial service and doesn't even want an obituary in the paper. That is they way he wants it so that is the way it will be. He will leave his wife of 45 years, three children, eight grandchildren and his first great grandchild is due in another monthSince Bill was so much older than Tom and I he was much different than we were. He was partly raised by my grandparents who lived next door to us. We always joked that he came from a different gene pool than we did.  There are a lot of funny stories to share, but those will be saved for another time. He will be missed.",
        "title": "My brother Bill"
    },
    {
        "content": "Welcome Summer!  It is really hot here in the south already so I hope it is not an indication of what we have to look forward to all summer long.  Last year, about this time I was lamenting about running in the Peachtree Road Race (largest 10K in the country). This year -- I'm not running or walking -- just watching.  My son and daughter-in-law are going to be running again and I am just going to watch them go by! I do have an excuse this year, a few weeks ago I had my left knee replaced.  Three years ago I had my right one replaced and it was time for the left one to follow the same surgery.  I forgot a lot about what it was like, but my physical therapy is kicking into high gear and it is kicking me in the butt!  I don't remember it hurting like that before but it probably did.  Anyway, in a couple of months I will be good as new (well maybe not quite true) but will be much better off than I was a month or so ago.Today is \"The Longest Day\" as it is the summer solstice. However, you may have also seen a little publicity about Alzheimer's Longest Day.  Today, many groups and organizations are helping to raise money for Alzheimer's by doing an activity all day.  For instance, there is a group here in Athens that is playing bridge all day and raising money.  Others are running, sailing, playing scrabble, walking, playing basketball, etc. to help raise awareness and much needed funds for research.  Thanks to all of those that are participating this year.  I hope next year, I can organize some of my friends and we can play Pickleball all day long!",
        "title": "The Longest Day"
    },
    {
        "content": "I am sure I have heard every parent say at one time or another \"it's not easy being a parent\". when do we ever stop taking responsibility for our children? I know that we can't be responsible for everything they do and certainly when they are adults it is hard to bear that burden.  But lately, I have been feeling bad about some things my son has or has not done, and while he is an adult, I feel bad as a parent, because I didn't raise him that way.  I didn't teach him some of his behavior but it had to come from his upbringing right? My son is not a bad person by any stretch of the imagination, and I am very proud of what he has made of himself, but I am disappointed in some of the ways he has dealt with some things and I feel responsible because I didn't do a good enough job in teaching him. I am sure that some of these things are trivial to others, and the way young people do things these days are totally different than the way we would have done something at that age, but it makes me stop and think about parenting and how little things really can make a difference.",
        "title": "Parenting"
    },
    {
        "content": "Many of you have purchased this book and I appreciate it!  All royalties for this book are going to the Alzheimer's Association.  Since its release on April 22nd, the book rose to number 16 on Amazon's book list.  In fact, Amazon ran out of books and the book has been sent for a second printing already.  I have heard from many of you about some of the stories in the book.  I haven't made it all the way through the book yet, but I was surprised at how much I learned from the book.  One lady emailed me that she bought 10 copies of it.  It can also be found at Barnes and Noble, and someone also told me they downloaded it as an e-book, but I haven't checked that out for myself yet.  I was honored to be one of the many people to be able to share their story in this book.  Thanks to all those that put it together.  If you like the book, please let me know.  I would love to hear from you.  Check with your local Alzheimer's Associations, too, as some may have book signings or readings where you can get your copy.",
        "title": "Chicken Soup"
    },
    {
        "content": "I know I haven't posted in awhile.  Thoughts not in the right place to get down on paper.This weekend our son and daughter-in-law paid us a visit. It was so nice to have them here -- I'm always a little sad when they leave. I know that sounds pathetic, but I miss them even though they only live about 75 miles away. They are busy. They work a lot and they have their own lives so we hate to intrude into their time.  But I do miss them nonetheless.I have been going to physical therapy for some back problems.  Yesterday, when I was there I wasn't having a particular day and I found myself having a problem following directions.  It was kind of like when I have a problem making change -- my brain knows what to do, I just can't physically do it.  So, when the therapist asked me to lie and my back and put my feet flat on the table so my knees were upright I couldn't do it.  I knew what he was telling me to do, I just couldn't do it.  Now the therapist doesn't know of my condition, so he just kind of moved my legs for me.  A couple of other times he asked me to do something and I couldn't figure out what he was telling me to do.  I should have something, but I didn't.  I am sure he thinks I am an idiot because I couldn't do simple tasks.  My husband told me I should have said something -- next trip I will.  I just hate bringing it up if I don't have to -- but perhaps this is one of those \"have to\" situations. I just feel so stupid.",
        "title": "It's been awhile"
    },
    {
        "content": "I just returned from Washington DC from the Alzheimer's Advocacy Forum. It was a great conference, almost 1,000 people there.......all dressed in purple. I will post some photos soon. But, this year, the conference got to me. really got to me.....it was way too much for me. By the time we got to the airport to come home I literally didn't know if I was coming or going. had a meltdown at the airport and on the plane. glad Ralph was with me, because I am not sure what I would have done if he hadn't been there.  It was a long week -- too overwhelming.  More soon.",
        "title": "Washington DC"
    },
    {
        "content": "I have written in the past about the state of Georgia working on a state plan to address Alzheimer's.  I am happy to say that the legislature passed the plan in this last session and we should see the results of the work of the committees soon.  Thanks to all that worked on that plan and I know it will be a valuable tool moving forward.I also wrote a few weeks ago about the \"Chicken Soup for the Soul, Living with Alzheimer's and Other Dementias\" a few weeks ago.  Today I received an advance copy of the book and if you are dealing with Alzheimer's in your family, I highly recommend the book.  I haven't been able to read all the 101 stories but they all deal with caregiving, coping and compassion.  You will definitely learn something from these stories.  Thanks to all who put this together. It hits book stores mid-April. You may even recognize a few of the authors of some of the articles.",
        "title": "Georgia State Plan"
    },
    {
        "content": "Last week, the Alzheimer's Association released their new \"Facts and Figures\" regarding Alzheimer's.  It is an interesting read and re-defines what Alzheimer's means to women -- here is an article from USA Today that gives a good recap of what was in the report --http://www.usatoday.com/story/news/nation/2014/03/19/alzheimers-disease-caregiving/6566179/For the whole report, you can log onto www.alz.org.If a few short weeks I'll be heading to Washington DC for the Annual Advocacy Forum -- talking with Senators and Representatives and their staff -- hoping to not only increase awareness for Alzheimer's but increase funding for a cure for this disease. The numbers in the report are staggering and we have to fight harder than ever to get the help we need.",
        "title": "Lots of new Facts and Figures"
    },
    {
        "content": "Over the last couple of days, I have been at the SEC women's basketball tournament.  Today, players were wearing \"We Back Pat\" thirsts over their jerseys in honor of Pat Summitt and her foundation to fight Alzheimer's.  I was not having a particularly good day, but several people told me they wanted We Back Kris shirts. how sweet is that. it didn't make my day go much better, but I felt loved.....thank you!",
        "title": "We Back Pat"
    },
    {
        "content": "A while back I posted about the internal debate I have in my head lots of times about whether to share with people that I have Alzheimer's. It isn't something that usually comes up in conversation obviously.  Many times I fear saying something because I am afraid that people will treat me differently -- which if you have been reading my blog for awhile, you will know that is usually the case.  So, more times than not, I don't say anything.About five months ago I started playing Pickleball a few times a week.  At times, the noise got to be a little too much, so I resorted to putting my earplugs in.  Then the distraction from other people when they were not playing bothered me, so I realized that if I stay on a certain side of the court I do better -- one without as many distractions.  Is this fair? I don't know if it is or not, but because of these things I have told a few people about my disease, partly in hopes they would then realize I was not trying to cheat by being on a certain side of the net.  I have been so pleased with the people that I play with -- they only don't treat me any differently, but now watch out for me on the court and never ask me to play on the other side of the net.  I love these people -- I feel like I am really \"normal\" around them!",
        "title": "Too tell or not to tell ....... Part 2"
    },
    {
        "content": "near you in April",
        "title": "Coming to A Bookstore"
    },
    {
        "content": "February 13th is Alzheimer's Awareness Day at the Georgia State Capitol.  A lot of work has gone into a new state plan to address Alzheimer's in the state.  If you would like to attend, you must register and you can do so by going here:http://act.alz.org/site/PageNavigator/GA_GA_action_center.htmlAll the information you need about the day can be found here and I would encourage any of you that can go to take a day and support this issue.On another note, another Advocacy Day is coming up in the state of Washington and they need your help.  I received an email from the Tacoma Alzheimer's group and to help them get a plan started they need help.  You can help by signing their petition athttp://www.change.org/petitions/washington-state-house-help-protect-those-who-protected-us",
        "title": "Alzheimer's Awareness Day at The Capitol"
    },
    {
        "content": "A lot has been going on but I just haven't had my thoughts straight enough to jot everything down so I'm going to give it a try ---1.Winter weather-- yes, the South was hit hard yesterday by snow and ice.  Although Athens didn't get hit hard, Atlanta did.  The snow really wasn't the issue as much as the traffic.  People were stranded in their cars for as many as 8 or 10 hours (or even longer) trying to get home yesterday.  It was a mess.  When I lived in the North I would have been somewhat prepared -- we always carried an emergency kit if you will in our trunk to sustain us for a short time, but I am not sure if it would have sustained us that long. I was thinking that now, though, I would have had a number of panic attacks and not sure how I would have handled being stranded on interstate roads for that long.   A silly think (or maybe not so silly) is that I still keep in my trunk, a duffel bag with \"necessities\" including water, make-up, and overnight essentials.  I know that sounds silly, but I used to travel in my job at the spur of the moment so I always had a bag packed in my trunk.  It came in handy even if I wasn't travelling.  My husband gives me a hard time, but it is my \"comfort\", so he just has to deal with it!2.Drug trials-- was disappointed that two drugs that seemed to hold some promise for those of us with Alzheimer's have not been proven in recent drug trials. This is so disappointing.Here is an excerpt from an article published in US News and World Report: \"Two experimental drugs for Alzheimer's disease have failed their clinical trials, proving unable to help patients with mild to moderate dementia, according to new studies.Both bapineuzumab and solanezumab did not improve patients' ability to think and solve problems, according to findings published in the Jan. 23 issue of theNew England Journal of Medicine.The drugs were intended to help people with Alzheimer's by clearing the amyloid beta protein plaques that typically clog neurons in the brains of people with the degenerative illness, the researchers said.Neither medication improved patients' ability to think. \"We were disappointed there was no clear clinical benefit,\" said Dr. Steven Salloway, lead researcher on the bapineuzumab study. Salloway is a professor of neurology and psychiatry at the Warren Alpert Medical School of Brown University.\"  You can read the whole article here:http://health.usnews.com/health-news/news/articles/2014/01/22/2-alzheimers-drugs-found-ineffective-in-clinical-trials3.On a better note-- A funding bill for the 2014 federal budged included the largest increase in funding dedicated to Alzheimer's and dementia - $122 million in funding for Alzheimer's research, education, outreach and caregiver support in history. You can read more about that news at:http://www.alz.org/news_and_events_122_mill_posposed.asp4.On a bright and happy note-- my friend author Lisa Genova who wrote Still Alice announced yesterday the full cast of the film adaptation of Still Alice.  It was announced previously that Julianne Moore would play Alice.  Others cast include Alec Baldwin, Kristen Stewart, and Kate Bosworth.  Filming is set to start soon.  I couldn't be happier for Lisa.  Lisa lives in Cape Cod and this article appeared today in Cape Cod Today --http://www.capecodtoday.com/article/2014/01/29/23796-hollywood-bring-chatham-authors-still-alice-silver-screenLisa was in Columbus Georgia this weekend, and unfortunately, I wasn't able to get to visit with her due to some other commitments.  I was sad about that, but I am so happy for her that this film is closer and closer to a reality.",
        "title": "This and That for January"
    },
    {
        "content": "My brother is going to visit this week.  He is in the Southeast on business and happens to be close by.  So he'll be here a short time, but I'm glad he is coming.  He always makes me laugh and I need some of that right now.",
        "title": "Brotherly visit"
    },
    {
        "content": "The New Year for me began by saying goodbye to a friend -- see post below.  It was a hard day for me.  Someone just a year older than I succumbing to Alzheimer's.  A beautiful tribute was given to him on Saturday and I am certainly proud to have known him.I love catching up with old friends and the holidays are always a good time to do that.  I love getting everyone's Christmas photos and their Christmas letters.  I know many people don't like to read them, I do.  With social media the way it is now, we don't get all the details of what is happening with people and their families.  Thanks to all who sent me something -- I really do enjoy hearing from you.  And, thanks too, to old friends who have re-connected through Facebook or this blog. I was so happy to hear from a former (I'm not going to say old) neighbor who shared her time with us as well as her children with Alan.  How nice to be remembered.   Another friend, Dr. Mary Cail, who wrote The All Weather Friend's Guide To Alzheimer's, has revised this book and re-released it as \"Alzheimer's A Crash Course for Friends and Relatives\". (Note: Full disclosure -- she does have some excerpts from this blog in the book).  She was kind enough to send me a copy over the holidays and I would highly recommend this book.  If you want to know how to deal with your loved one with Alzheimer's, please get this book.  It will save you a lot of frustration and time.  Mary has achieved a great sense of balance in the book and will help you immensely.I'm revising the bucket list and trying to shape my 2014 so I will be back shortly.",
        "title": "The New Year"
    },
    {
        "content": "I didn't realize it had been so long since I posted.  I know in my head I have been posting as I have kept thinking of things I wanted to say. So, here goes........The last few weeks have seen loved ones pass away, loved ones moving on to a different city, and old friends reuniting.  It's a mixed bag of feelings.  Word came this week to me that a friend in Atlanta had passed away from Alzheimer's.  He was 59 years old.  We had become friends many years ago through this disease and we shared things others couldn't. We'd laugh at ourselves, understood things only we would know about and share our families. Several times Bob and I shared a stage at meetings about Alzheimer's and he his wife were featured in Washington at one of the Public Policy Forums.  Bob's wife, Trish, first contacted me through this blog and since we lived close we got together.  Bob was only a year older than I was and we all seemed to get along well.  One of their children was going to UGA at the time, so they came to Athens often and came to our Walk to End Alzheimer's here in Athens for several years.  I always thought of Bob as a \"gentle giant\". He was not big, but he was tall -- I was always looking up to him (both literally and figuratively) and he was soft spoken, loved his family and was very aware of what he was dealing with.  Unfortunately, Bob's type of Alzheimer's was definitely inherited and he had been dealing with it in several members of his family for some time.  This type tends to be more aggressive than other types.  Bob was a runner and his family shared his passion. I'm sorry he couldn't outrun this disease.  We will pay our final respect to Bob this Saturday but he will never be forgotten.",
        "title": "Happy New Year"
    }
]