[
    {
        "content": "I worry about memories -- I know they are going to become more distant to me.  I was thinking about this over the weekend -- we were telling Alan and Jennifer what we used to do before they were born -- i.e. make pizza dough from scratch, not use shortcuts while preparing dinner, etc.  But, today, I was cleaning out some things from Alan's bedroom and I ran across something Alan did in the 6th grade -- it is his \"autobiography\".  You can just imagine if he did it in the sixth grade how interesting it is!!!   I had to take time out of cleaning and sit down and read it.  I laughed....I cried.....I realized how much I didn't remember......I understood how important some little things we used to do were to Alan.....and I actually saw a glimpse of the man he is today.  I'll keep this forever -- what a treat to find.",
        "title": "Memories"
    },
    {
        "content": "My brother gave me new skates for Christmas so I had to try them out. Alan and I went skating in Atlanta today and then visited with Jennifer's family. I'm posting a few photos from our outing, some at Jen's house and a final photo of Alan, Ralph and I before he left for DC. Alan gave me a nice gift certificate to a spa for Christmas so I'll be able to enjoy that soon -- but I promise no photos of that!",
        "title": "A few more photos"
    },
    {
        "content": "In this photo, Katie Felton, Chris Felton, Alan, me, Josh Darnell and Melissa Darnell.This Christmas has really been good. Not too much overload this year as in year's past -- that has helped me a lot this year. I didn't do much decorating so there isn't that much clutter around the house. I didn't have to cook a large meal which reduced my stress. And, we didn't plan much so that made it pretty low key. It was nice to have Alan home for a few days -- it was pretty quiet and we all had a good time. Alan leaves in the morning for DC. We are going to Atlanta ice skating today (my brother sent me new skates!) and to meet up with Jennifer's parents and sister for a meal. I hate to see him go -- it is always nice to have him home even for a short time.The photo above is from a lunch Alan and I had yesterday with my friends Chris and Josh and their wives. If you have been following my blog for long you will know that Chris and Josh used to work for me. Chris now lives in Ft. Lauderdale and is in med school. Josh is in the army and was deployed to Afghanistan last year where he suffered some major injuries last February. He has had a long and rough ride with many surgeries and a long stint in the hospital but we are glad to say that he is recuperating very well and will be getting a medical discharge this spring from the military. We all worried about him so much -- I'm glad to see him doing so well. The three of us don't get together very often but when we do we find a lot to laugh about. I'm fortunate these guys still keep me in their lives.Hope everyone had a great holiday. I'm looking forward to the rest of the week as I'm going to try to devote much of it to getting rid of a lot of clutter around the house and getting a little more organized.Happy New Year to everyone!",
        "title": "Holiday Aftermath"
    },
    {
        "content": "I'll post some more photos soon but wanted to get this one up. We had dinner with some friends yesterday and this photo was snapped by their tree. Unfortunately, our beautiful daughter-in-law was in transit from Washington DC to Atlanta at the time this photo was taken. Hope everyone had a great holiday!",
        "title": "Christmas"
    },
    {
        "content": "to everyone.  I've been a bit stressed out this week so needless to say it hasn't been a good week for me.  I guess it is anticipation of the holidays, Alan being home and all the \"extra stuff\" around the house.  Had major panic attacks while out trying to run some errands this week -- too many people for me and I was out later than I usually am.  Have to stick to that routine you know.But, I haven't really planned much while Alan is home and he won't be home that long, so it won't be much of a problem.  I have help if I need it and knowing that makes it easier.I do wish everyone a great holiday season.  I've enjoyed getting your cards and letters at this time of the year-- I really love hearing what is going on with everyone.Have a great one!",
        "title": "Happy Holidays"
    },
    {
        "content": "My son and daughter-in-law got to see a lot of snow yesterday -- with the big storm that hit DC. I know it was a record one for the area -- and the largest snow amount they have ever seen. Jennifer takes great photos so I thought I would share a few on this site -- thanks Jennifer. I'm sure there will be lots of snowman building today. One thing about the south is, snowmen don't melt, they deflate!",
        "title": "Winter"
    },
    {
        "content": "Yesterday was a long day. It started by helping the UGA Women's Basketball team put together bicycles for underprivileged children here in Athens. There was a potluck lunch to go with it. After that, we attended a charity tennis event that featured Serena Williams, Joshn Isner, Sam Querry and Melanie Oudin. That event was over 3 and half hours long. It was really drawn out. After having the first event, by a few hours into the second event I was long gone mentally. I was so tired, I wasn't sure who was serving or even who was playing at that point. Just too much for me in one day. Thought I could make it, but obviously didn't do so well with it. Some photos are above -- oh -- NeNe from the Housewives of Atlanta is also pictured. She sat right in front of us and lots of people were coming up to get their photo taken with her and to get her autograph -- really distracting I might add.",
        "title": "Weekend"
    },
    {
        "content": "It is always sad to lose someone, but especially during the holidays.  Right around Christmas my friend, Kathy, who I visited with in Cape Cod this summer, lost her sister. Maureen, to cancer.  Her sister lived in Peoria where we grew up.  She was diagnosed and several weeks later lost her life. I guess it is comforting to know that Maureen didn't suffer.Right after I returned home this week, a long time school friend and friend of the family died. He went to school with my brother and had been ill for awhile.  He suffered a stroke and had many complications after that.  He was only in his mid-50's.  Doug was a fire batallion chief with the Peoria fire department.  Today, after his funeral there will be a long processional of firemen that worked under him and others around the area.  A great tribute to a great young man.And, then, a few days ago another friend passed away here in Athens -- only 58 years old.  His daughter was Alan's first girlfriend in high school and they have remained close.  We visited with his daughter who now lives in NYC when we were there for the US Open.  It was such a shame to lose him -- he was very prominent in the UGA music department and his accomplishments outside of teaching were enormous.I'm much more emotional now than I used to be and these have hit me hard -- perhaps because they were all around my age -- you just never know.  Rest in peace my friends.",
        "title": "Deaths during the holidays"
    },
    {
        "content": "Well, I cut my trip short by a day because of the big storm that was heading toward the midwest. I'm glad I did because most of the flights have been cancelled for today. I was ready to come home. While there I had an infection and had to go to the emergency room for treatment. Not fun, but manageable. When I went to the airline counter to change my ticket the lady told me I looked a little \"frazzled and panicky\" -- I told her I just needed to get home. I hurried to put stuff in my bag so we could get to the airport and everything was kind of moving a little too fast for me. When I reached Atlanta there were lots of thunderstorms so by the time I drove 1 1/2 hours to the house I was tired. I had a hard time concentrating and I went to take my pills and mistakenly took the morning pills instead of the evening pills. Unfortunately, their is one pill I take in the morning that causes insomnia -- so I was up most of the night.But, I had a good visit with friends and family. My brother is holding his own. I met with my friends Pody and Rick from Champaign and Joe and Rita who used to live here in Athens.Pictured above are my friends Pody and Rick, me with my great nephew Oliver (isn't he cute?) and my two brothers.More soon -- after I have rested!",
        "title": "Back from Illinois"
    },
    {
        "content": "On Saturday I'm off to visit family in Illinois.  Haven't been back to see my brother who has been ill for awhile so will visit him and his kids and my other brother and sister-in-law. Always good to see the nieces and nephew.  Will write again soon.",
        "title": "Illinois"
    },
    {
        "content": "I hope everyone had a great Thanksgiving. We just returned from Washington DC and spending four days with Alan and Jennifer. We had a great time. I didn't have to cook the turkey -- Jen did a great job with that. We got to go ice skating and many of you know how I like to ice skate so that was a lot of fun. In the photos I was trying to teach Alan and Jen how to skate backwards -- Jen did great -- it was a little lost on Alan. But, we didn't manage to mow any little kids over (get that Carol?) and it was a beautiful day that day so I really enjoyed it. Since Ralph broke his elbow the last time we went ice skating he was not allowed to take the ice!We also went to Annapolis for a day to visit the Naval Academy. The town itself is so pretty and it was really impressive. We also visiting the Air Force memorial, the Marine Corps Memorial and the National Botanic Garden where there were lots of Christmas decorations out. In the top photo you will see one of the miniature landmarks done with all natural materials -- berries, nuts, acorns, twigs, leaves, etc. There were several on display including the Washington Monument, the Lincoln Memorial, Jefferson Memorial, Supreme Court and others. There were also trains running around the buildings and the rest of the decorations.I did pretty well on this trip -- but there wasn't much expected of me. I just enjoyed myself and thanks to Alan and Jennifer for keeping us out of trouble, going skating with me and cooking all the food!I'm off to Illinois at the end of the week to visit my family -- more soon.",
        "title": "Thanksgiving"
    },
    {
        "content": "is a book that is going to be published in January 2010. It's a true story about a man and his family that have been dealing with Alzheimer's in their family for generations. He has been spared from this disease, but he watches members of his family suffer. I've had the opportunity to review the book and it is one you will want to read.....you can preorder it now athttp://www.thethousandmilestare.com/. Gary's cousin Chuck has been active with the Alzheimer's Association as someone who is living with the disease. Chuck's grandmother went to Washington DC years ago to talk with legislatures about Alzheimer's and it has come full circle with Chuck as he has done the same thing -- talked in front of a Senate Subcommittee to increase funding for Alzheimer's research. The story of the family is heartwrenching but beautifully told by Gary Reiswig. Order it now for a holiday gift -- but get out the tissues because it will tug at your heart.",
        "title": "The Thousand Mile Stare"
    },
    {
        "content": "My husband likes to \"tinker\" with things.  It drives me crazy because there are certain things he just can't leave alone.  When he wants to change things he just does, without consulting me of course. And, since change is a problem for me, this creates problems.He recently changed our Cable television service.  Which means a new remote. Since he is the \"king of the remote\" (what man isn't though!) this creates a problem for me because \"I'm not doing it right\" or \"you don't know how to use it\" is muttered quite frequently in our house.  I try -- but when you don't get an opportunity to even touch the remote most of the time, it is hard to learn -- let alone learning something new.Then, my husband upgraded our computer from Vista to Windows 7.  Which I know is an improvement -- but it is something else to learn.  Things aren't in the same place I'm used to them being.  Then my husband decided to install several new programs that he wanted to use. One of the problems with that was that when he installed this one of these programs, it would not allow me to turn the sound off on the computer.  (I can't deal with the sounds coming from the computer -- it sounds silly, but I lose my concentration).  After complaining my husband finally took it off the computer until he could talk with it's maker and find out what the problem was.  But, many times, when he makes one slight change in something -- it changes other things that affect me -- and because they are \"little things\" to most people, he doesn't seem to think it is a big deal -- but those little things are big things to me.  It is very frustrating.So, the last few weeks I have been confused. As a result, I get confused about a lot of things and I get anxious about that because things are not \"normal\" -- they've changed.  I say the definition of normal changes all the time for me so I guess writing that last sentence doesn't make much sense -- but it is frustrating.  I just feel like I'm a few steps behind everyone else.  I need my space, my quiet and all things to stay the same......I know that is too much to ask for.....especially in my household.   I've tried to explain that it would be like going into someone's house who was blind and moving all the furniture around without telling them.  (or at least that is what I think it would be like)  Little things make a difference in the life of someone with Alzheimer's.",
        "title": "Confusion reigns"
    },
    {
        "content": "I found these two quotes or sayings in the last few days and I thought they were cute:\"I love the nights I can't remember with the friends I can't forget\"\"Each day of our lives we make deposits in the memory banks of our children\"",
        "title": "Quotes"
    },
    {
        "content": "I went out to play golf today.  The only things I can say are:1. The weather was beautiful2. It was a nice day for a walk3. I found three golf balls4. Golf is a four letter word",
        "title": "Golf"
    },
    {
        "content": "I've been in Atlanta for a couple of days so no posting.  I was hoping I would have a photo of our MW team from this weekend to post but not yet.  Thanks again to my whole team for coming out in the rain and walking.  I appreciate it!Monday night I had the privilege to speak once again to Dr. Glass'gerontologyclass atUGA.  Dr. Glass and I met by chance one day while riding a shuttle to the Atlanta airport.  Since then, she has been gracious to allow me to come and speak with her class.  I've said it before and I'll say it again, that it is also therapy for me to do that.  It is interesting to see who is in her class and their take on Alzheimer's.  Thanks for having me!I've also been reading an advance copy of a  book about familial Alzheimer's.  A person I know with Younger On Set Alzheimer's has a cousin who is writing this book about the disease and it's affect on their family.  Many family members have (or had) the disease and it is gut wrenching to think about.  Gary's book is due out in January and I will certainly write more about it as it gets close to its debut.  It is certainly worth reading.",
        "title": "The week"
    },
    {
        "content": "Well, the rain didn't stay away -- we all got drenched but we raised a lot of money and everyone seemed to take the rain in stride.  It was ideal by any means but it was very heartwarming to me that people really came out in the rain and supported us.  That is something I really can't express in words how meaningful that was to me.Our Team, Team Athens raised roughly $15,000 and I couldn't be happier.  I have a great group of team members and they are near and dear to my heart!",
        "title": "Memory Walk"
    },
    {
        "content": "It's Memory Walk Day -- I'm up early trying to double check everything.  It's cold -- in the 40's and isn't suppose to get much warmer and currently it is raining outside.  That is not even showing on the weather radar so I'm not sure what is up with that.  Thanks to all who have contributed. More after the Walk.",
        "title": "Memory Walk Day"
    },
    {
        "content": "was a little hectic but I survived.  Next weekend is Memory Walk -- so we'll be in overdrive until that happens I suppose.I heard from many friends this week and that is always nice.  I wish I could spend more time with my friends and that is something I'm going to work on.  There's never enough time to do the things we want, but it seems like we make time for some things -- I'm going to try to make more time with my friends.I've made a few new friends this week as well.  It's funny how you can meet some people and know instantly that they will become a good friend.My birthday was this week and husband came up withs ome ways to remind me of my advancing age.  My son pointed out that it was time to change my profile since I was no longer 53.........but I can say, that seven years ago when I was diagnosed with Alzheimer's I didn't think I would make it to 53 hearing about all the gloom and doom coming our way.  And while that gloom and doom is still out there I can't let it get to me -- I just have to keep going......probably not as good as the Energizer bunny but going just the same.",
        "title": "The Week"
    },
    {
        "content": "I have a busy week ahead.  So much going on I can't just rely on my calendar to get by -- yesterday I had to sit down and write everything down for every day so I wouldn't get confused.  Usually I can go by a huge calendar we have in our kitchen for everything, but not this week.  I feel better now that I have everything written down and Ralph has kind of checked it over.  I wasn't so good about \"scheduling\" myself this week and the next for that matter.Yesterday was a bad \"word day\", but I started doing something yesterday that I have never done.....like spell words backwards when I was typing -- now I can't do that in the doctor's office when they give me that little mini-mental test so I don't know why I am doing it now.  It has taken me a very long time to write this entry.  Not only was I spelling words backwards (and most of the time getting them right!) I didn't know I was doing it until I read back what I was writing.  And, then sometimes I was writing a word like \"doing\" and writing \"goind\" instead -- interchanging the first and last letters.  Pretty bazaar -- maybe I can just say I can't type!",
        "title": "Busy Week"
    },
    {
        "content": "I'm sure many of you have seen the news with all the rain we have been receiving down here.  It is much worse in Atlanta.  We have seen a little over 7 inches here in Athens over the last couple of days.  But it is still raining and we are in for a few more days of it.  Many of the Atlanta school systems have shut down because of the flooding and six people have lost their lives.   We haven't had this much rain in a very long time -- when we have it has been related to a hurricane in the southeast.  So, this was obviously unexpected.   Thanks to all those that have called or emailed asking about the situation down here.",
        "title": "Rain"
    },
    {
        "content": "is next Monday -- September 21st -- wear purple -- be seen -- be heard!  For more information you can go towww.actionalz.org.Also, at that website you can view the show that ran last night on PBS \"Retirement Revolution the New Reality\".  I didn't get to see it but I plan to watch it.",
        "title": "World Alzheimer's Day"
    },
    {
        "content": "We just returned from five days in NYC. We went for the US Open Tennis tournament. Alan and Jennifer came up from Washington DC to meet us, although Jennifer couldn't stay but a few days. Going to the US Open was something that Alan and I had been wanting to do for some time but the timing wasn't right with his school and his work, but we made it work this year.The experience was great and it was one of those things that you were glad you went. The crowds got to me and a few other things but I survived. More on the trip later -- just wanted to post these photos.  Jennifer and Ralph took these photos.",
        "title": "New York City"
    },
    {
        "content": "Our Memory Walk is in about 6 weeks -- can't believe it is coming up so quickly.  We are having it at a different venue so it is takinga  little more planning than usual.  Luckily, some sponsors have come in.....our goal is to raise $75,000 -- with the economy it is going to be hard, but we are optimistic!I'll be away from the computer for a few days and I know I haven't posted for awhile....but I'm going to try to do better come September!",
        "title": "Memory Walk"
    },
    {
        "content": "Well, I tried.  Today I went to go play golf.  I haven't played in a couple of weeks and with my new medication for concentration I was doing pretty well.My husband and two guys that have retired from where he worked usually make up our foursome.  The last time they played without me they played from the red tees -- which is the ladies tee and the \"seniors\" tee.  Usually they play from the white tees which are little farther back from the red tee.  Anyway, today they decided to play from my tees.Although, I couldn't handle it.  I started having panic attacks on the second hole, because it \"wasn't right\" -- it wasn't my normal routine.  I thought I could work through it but I couldn't -- I hit two shots straight into the woods and then had such panic attack I thought I was going to die because I couldn't get my breath.  Then, when I did catch my breath I just sat down on the cart path and started crying.  I couldn't get it together -- things were \"off\" and I couldn't concentrate and I couldn't get it together.  After calming down a little I decided to come back home, I knew that I couldn't go on.Such little things can throw you off and it is so frustrating that I have to live this way.",
        "title": "Meltdown"
    },
    {
        "content": "I know that I have said this before -- that when I was first diagnosed with Alzheimer's that my friends (and family) were the most important things to me.  Unfortunately, some friends that I thought were friends, really weren't friends because they went running to the hills when they found out about my diagnosis.  I learned a lot from that.But a few months a friend from my hometown passed away.  We had gone to elementary school and high school together.  Word of his death hit me very hard although it had probably been over 25 years since I had seen him.  He was quite successful in business as I think we all knew he would be.  He was every kid's friend and I don't think I ever heard anyone say anything bad about him.  I've recently tried to reach out to some of my old classmates through Facebook and \"talking\" with them via Facebook I learned that they too were hit hard by his death.  I guess that speaks volumes about him as a person.  I'm sorry I didn't make it back home to his funeral.  I had sent a note to his parents and received a lovely note in return about the support they had been given and how touched they were that so many old classmates came to pay their respects or contact them. I don't think we will ever know what type of impression we leave on people.....we all hope it is a positive one I am sure.  I was proud to call Terry my friend.",
        "title": "Friends"
    },
    {
        "content": "I have had quite a few questions emailed to me recently and I'll take this opportunity to answer them1.Someone asked which medication I was taking for concentration -- the answer is Adderall -- it is a drug given for people with Attention Deficit Disorder.  I don't know if it works for everyone but it certainly has helped me.  I was having such a difficult time concentrating for more than an hour or so, it has definitely helpe me.  One of the side effects is that it will keep you awake so sometimes, even though I still feel like I need my afternoon nap, that is difficult to come by.  Sleeping at night though hasn't been a problem if I take my pill early in the morning.  It took a little while to get the dosage to where it has worked, but for now, it is helping.2. Next questions was about travel since I have been talking about it a lot lately.  Someone wanted to know \"how well I travel\".  I wish I travelled better -- it is getting harder and harder to do if I go to a place I am unfamiliar with.  My husband was with me on the last two trips -- but the one up to Cape Cod was definitley harder because I had never been before.  Plus, all the tourists (me included) made it more difficult.  I don't do well in crowds -- I get a feeling of being overwhelmed and the noise is very distracting.  I find myself having panic attacks.  I know how to deal with them so I do, and having someone along certainly helps and can get me out of situations if need be.  Also, not overcrowding my schedule helps and lots of sleep.3. Do I speak to groups? was another question I have had recently.  My answer is yes -- and I love to do it.  I have said that as long as I can I want to be able to speak about this disease to help educate the public.  I'll go just about anywhere and talk to just about anyone.  As long as my expenses are covered I'm usually good to go.  I try to bring a bit of humor into my talks so it isn't \"a downer\" and try to share some day to day experiences with the audience.  Just leave me a message with contact information if you are interested and I promise I won't broadcast that information out to all the readers of this blog.4. Memory Walk -- I've had several people ask me who can walk in a Memory Walk.  Anyone can walk in any walk across the country!  Of course, Memory Walk is the major fund raiser for the Alzheimer's Association but you do not have to raise money if you don't want to --- you can just find a walk near you and come out and support the cause.  If you do raise, $150 you will get an official \"Memory Walk\" t-shirt.  Walks are held all over the country in the fall -- go towww.alz.orgor find a walk near you.  We need you all to come out and support our cause.Thanks for reading and thanks for your questions.",
        "title": "Questions and Answers"
    },
    {
        "content": "I have had quite a few emails about the Memory Walk spots that are playing around the country. People are asking if that is me in those spots and yes, I am in some of them. They were done a few years ago and are not playing in all markets. There are certain spots that are running in all markets and many of you may have seen some of those. Anyway, to answer the question, yes, that is me.My teeth are still bothering me. Another trip to the dentist tomorrow.The medicine the doctor gave me for concentration though really seems to be working. I'm keeping my fingers crossed that it will continue to help me.We had our Memory Walk Captain's meeting today. If you would like to donate to the cause, please follow the link to the right that says Memory Walk Donation Page. I know times are bad right now, but even a little helps!",
        "title": "Yes, It's Me"
    },
    {
        "content": "Last year I had three crowns put in my mouth.  Last week I had a root canal.  I haven't had that much dental work in one year ever -- I've always had pretty healthy teeth -- what is up with that.  But, after the root canal last week things are a lot worse -- that tooth hurts now even more than it did before.  Of course, it started hurting late Friday afternoon so you know what I am going to be doing first thing today!But, I'm on my way to Atlanta for some business so if I am to get back into the dentist's chair it will have to wait at least one more day -- but it can't come soon enough.",
        "title": "Teeth"
    },
    {
        "content": "We're back from the Northeast. We flew into Boston and then went to Rhode Island. We visited Newport and the International Tennis Hall of Fame and then some of the mansions there. The next day we took the Ferry to Martha's Vineyard, then on to Cape Cod to visit my old college friend. We hadn't seen each other in over 20 years and I think we picked up right where we left off. We have been keeping in touch with each other over the years but it was so nice to see her again. She and her husband have a beautiful house in Cape Cod but they live full time in Albany New York. More soon -- just wanted to post a couple of photos. We are sitting on her back porch -- the pond behind her is called \"Katie's Pond\".  The sunset is from the Cape Cod Bay.",
        "title": "Vacation"
    },
    {
        "content": "The International Conference on Alzheimer's Disease is going on right now in Vienna.  Chek the Alzheimer's Association website for all the latest news in research and development that is being discussed.www.alz.org",
        "title": "ICAD"
    },
    {
        "content": "from DC. Thanks to our son for being a great host.  We went a few places we hadn't been before like the new Air and Space Museum out by Dulles, a Baltimore Orioles game at Camden Yard and the National Cathedral.  We stayed busy -- the weather cooperated and it was nice to have a visit.Things I always forget about Washington DC -- there is so much green space -- I know the city was planned but it is so odd to see it.  I wouldn't want to live there -- way too many people for me.  Makes me a little uncomfortable. I got confused a good bit, but with Ralph and Alan there it was o.k.I had to rest a good bit but tried to stay up with the guys as much as I could.Our next trip is in a few weeks to Cape Cod.  That one should be interesting.",
        "title": "We're Back"
    },
    {
        "content": "Several people asked me to add this \"followers\" gadget to my blog.  Not real sure about it but we will try it and see.",
        "title": "Followers"
    },
    {
        "content": "Someone left a comment asking if I had gene testing.  This question has been put to me two or three times this week, so I thought I would address it briefly.  During my diagnosis process I had two spinal taps.  An analysis of the spinal fluid showed that I carried one copy of the APOE 4 gene.  APOE4 is associated with a higher risk of Alzheimer's. About a quarter of the population inherits one copy of the APOE4 gene. This increases their risk of developing Alzheimer's disease by up to four times. However, you can have the APOE4 gene and not develop Alzheimer's -- you are just at greater risk.  There are other genes out there associated with Alzheimer's and I'm not sure how detailed my analysis got.  It showed a high level of Tau (I think that is right).  I am adding a link to a publication put out by the National Insitute of Aging/National Insititute of Health that can explain it a lot better than I can.  Here is the linkhttp://www.nia.nih.gov/Alzheimers/Publications/geneticsfs.htmBoth of my parents died at a relatively young age (early 60's) and my father was adopted so we don't know anything of his family history.  It's possible in looking back by me and my two brothers that my grandfather may have shown signs of what they called back then \"hardening of the arteries\" or a dementia but we aren't sure.Doctors don't do genetic testing though just to see if you have the disease.  I say that, but then I also know people who have found doctors to do it.  If you're curious, have someone in your family that has Alzheimer's you should definitley discuss it with your doctor and make that decision together.",
        "title": "Gene Testing"
    },
    {
        "content": "My husband and I are looking for some suggestions for a vacation in July somewhere up in the Northeast.  It's an area we aren't that familiar with and would like to visit -- Maine, New Hampshire, Vermont -- any suggestions from my readers out there?  We are looking for something not too taxing but that has some points of interest but relaxing at the same time.  I know I'm not asking for much!!  Please leave me a comment if you have some suggestions or email me atkrisbga@hotmail.com.",
        "title": "Vacation"
    },
    {
        "content": "My husband has been gone for a few days. This is pretty unusual for him because he is pretty much a home body and rarely travels by himself. But what a difference it makes to me. I know it sounds bad, but when he is away I feel a lot better. I don't have to think, I don't have to talk, I don't have to listen to the television or the radio all the time, I don't have to constantly watch what I'm doing because he is watching over me......and as a result I don't get as fatigued. I haven't had to nap for the last few days because I'm not feeling worn down by mid afternoon. I still get tired, but not that mental fatigue that is so draining. I'm sure that my husband would say \"well, you don't have to do those things when I'm around\" but he's wrong. He doesn't take an active role in a lot of things and that means I have to try to think about things even if I can't or don't want to. He hasn't quite caught up with the fact that soon, he will have to do most of the thinking for both of us. I have a half day left to myself and I am going to enjoy it!",
        "title": "What A Difference a Couple of Days Make"
    },
    {
        "content": "I have been having a hard time concentrating lately.  I haven't been sleeping well.  They could be related. At any rate -- I was having a difficult time last night conveying something to my husband.  I realized then that the way I \"see\" things in my brain has changed.  I used to \"see\" things with words -- if I had a thought I was trying to say or get a point across it was words that I was forming in my brain and almost reading them back in order to explain something or even with a regular conversation.  Now, I see more images in my mind rather than words.  This makes it more difficult for me because I then have to convert those images to words and then get it out of my mouth!  How simple is that?  Not that simple for me.  Last night I had this whole storyboard of images in my mind with this story I was going to tell my husband.  I couldn't get it out -- I couldn't put the words to the images and make it come out.  I'm sure this sounds strange to most of you reading this, but I can't figure out another way to say it.I tried playing golf yesterday -- my concentration just wasn't there.  I didn't play too badly but it was such an effort it kind of takes the fun out of it -- if there is fun in playing golf!!!On another note -- my new friend Bill (who also has younger on-set Alzhiemer's) and lives nearby read my post about the walking stick earlier this week and he made me one!  I haven't gotten it yet, but I'm excited about getting it.",
        "title": "Concentration - thoughts - words - images"
    },
    {
        "content": "My friend Carol suggested that I put a link to the HBO series that you can watch it on the computer if you don't have HBO.  You can go tohttp://www.hbo.com/alzheimers/or go towww.alz.organd there is a link to the series.",
        "title": "Alzheimer's Project"
    },
    {
        "content": "I just finished watching the Caregivers segment of the HBO Alzheimer's Project Series.  The first person interviewed, Chuck Jackson, is a friend of mine.  It was great to see him and to see him in such great spirits. Some of the quotes from the Caregiver's segment I can relate to ----\"You're your own caregiver for awhile, then your friends and family\"\"Living life in the moment\"\"We try to stay in ther present and usually the present isn't so bad\"\"If you can't cry about it all thet me you might as well laugh\"\"Alzheimer's is a part of my life, I try not to dwell on it\"\"People don't drop over like they used to.  you don't get invited very many places\"These things are all so true",
        "title": "More Feedback on the Alzheimer's Project"
    },
    {
        "content": "I've always said my best times were in the morning when I was rested.  My mind works much better then.  Or, after a nap.  Today I tried to play golf in the afternoon.  What a mistake.  I can't play that well anyway, but my concentration was out the proverbial window today. Since we always walk the course,  I have to look at it as exercise -- which we know is good for the brain!I should have asked my son for a walking stick for Mother's Day.  My balance is getting so bad.  I always realize this when I am out on the golf course and use my club as a modified walking stick.  When my husband and I go walking on trails I need one.  But I never think of it until I need it.  I forget......imagine that.  Maybe he'll read this and remember for me!",
        "title": "Concentration"
    },
    {
        "content": "Well, I watched the Alzheimer's Project first series.  Many people have logged on to the blog -- probably because of the gentleman profiled there that had a blog.  My back story is that I was diagnosed 7 years ago with Early On Set Alzheimer's (not referred to as Younger On Set Alzheimer's) because I was diagnosed at an age before 65.  I was 46 years old at the time.Since I've kind of been following along with this project since its inception, I wasn't sure what the finished piece was going to feature.  Like many projects, the focus of the this documentary started out entirely different --or at least that is what I remember.  But, the finished product is something everyone should see.  If people and mainly legislatures that see this don't realize this is a disease we need to take seriously, then I am not sure of what will convince them.I'm looking forward to the future segments of this piece.Some of the lines in this first episode that struck home to me were:\"That's what is so disgusting -- I feel so good......\"The disease does \"not take her intelligence away\" -- this is hard to accept when you can't do the simple things in life -- you know you aren't stupid --it is just the disease talking\"I have to read this a million times\" in referring to a recipe -- I hate to have to do that!\"I never feel like I'm giving up\" - you can't or you will.\"I don't want to be a burden\" -- we all carry this I think\"One day at time\" -- live in the moment\"Your judgment becomes an issue\"  -- how true\"my life is not that important in the grand scheme of things\" -- you want to think so, but you have to know that it isn't.I'm sure others with this disease will see what fits them.  Since we aren't around others like ourselves at this stage it is almost comforting to know we aren't alone although we feel it.For those of you that are reading this blog that need help, please seek help with either a doctor's office, an association like the Alzheimer's Association or wherever you can find what you need.  Keeping this blog for years has helped and I call it my therapy -- others have their way of dealing with this as well.  Find out what works for you and try to stay positive.  It's hard, but when you fight something it's almost as if you are in a competition -- somebody always wants to win -- and I'm not a very good loser.Thanks for reading and hope that you will drop by often.",
        "title": "Feedback on Alzheimer's Project"
    },
    {
        "content": "The first part of HBO's series the Alzheimer's Project ran last night on television.  The next part airs tonight with more on Tuesday night.  I taped it.  I need to watch these things in pieces.  But, I know it is good -- from what I have heard and knowing how hard they worked on this I know that is good.  Please try to tune in or to tape it for yourself.I hope everyone had a good Mother's Day out there.  As I said, my son was home last weekend and it was nice to have him home. Since I don't see him that often, it bothers me that I know my disease must seem worse to him each time he sees me.  And, I always wonder when the next time I see him if I will remember him.  I know my disease hasn't really progressed to that point, but you can never stop worrying about that.  And, what this terrible disease does to the family.  I hate it.  I hate it with a passion. My mother always told me never to use that word, but I do hate it.",
        "title": "The Alzheimer's Project"
    },
    {
        "content": "Happy Mother's Day this Sunday to all those mothers out there reading this.  The best thing that anyone has ever called me is \"Alan's Mom\".  It was nice having him home this past weekend -- an early Mother's Day present for me.  Just spending time with him is enough.  I wish I could take the credit for him being the man he is today -- but I know that he has done most of that himself.  I'm real proud of him.My relationship with my mother was pretty bad.  We were like oil and water.  I was never good enough.  We went long periods of time without speaking.  And, it is sad.  But, I tried.  I don't remember early Mother's Days with her, but as I became an adult they became harder and harder.  I never, ever bought her a present she liked.  She would yell at me for buying certain things because \"you know I don't like this\" is what would come back to me.  If I knew that I wouldn't have bought it for her -- but I guess she thought I was doing it on purpose.  If I chose the route of sending flowers I would get the response \"you don't take the time to go buy me a present so you take the easy way out and call the florist\".  As you can see a no win situation.  Before she passed away twenty years ago we had become friends somewhat I guess, but never had that mother daughter bond.  As a result, Mother's Day was always a problem for me -- I was damned if I did and damned if I didn't.My first Mother's Day as a mother 25 years ago didn't go so well either.  My husband is not a person that usually buys presents or thinks about getting a card or wishing someone a happy birthday.  I always bought the presents for his mother, sent the cards and was sure that he called her on Mother's Day.  But, I was sure that my first Mother's Day would be different.  Was I wrong.  After going most of that day without even a \"Happy Mother's Day\" from his lips (Alan was 7 months old at the time) I was sure that he had something planned for that evening.  About 4:30 he asked me what we were having for dinner.  At that point I knew there were no surprises.  I asked him if he was ever going to wish me a Happy Mother's Day and his response was \"You're not my mother\".  I don't think I need to say anymore!So, all my friends out there that are Mother's -- even though you are not MY mother, I wish you all a great day on Sunday.",
        "title": "Mother's Day"
    },
    {
        "content": "Last night, in Macon Georgia we went to an Alzheimer's benefit concert by the Manhattan Transfer. That is a group I have always liked so I was glad when I heard they were playing. The development director in the Macon office asked Alan to come from Washington DC and speak before the concert. Last year, I spoke before their benefit concert so it was nice that they asked him to speak. I was so proud of him -- as every mother would be -- but he put a lot of his emotions into the speech and it was very well received. Lots of people came up to him afterwards and told him how touched they were by his remarks. I know how hard that must have been for him to write and I appreciate him and love him so much. I've posted a few photos from last night. Thanks to all in Macon for such a great evening.",
        "title": "Manhattan Transfer Concert"
    },
    {
        "content": "Several years ago HBO starting working on a documentary about Alzheimer's.  This Sunday, May 10th the first of a four part series will run.  Below is some more information about this.  I was at several of the filmings for this documentary and I know how much time, effort, research and work has gone into it.  It will run for three consecutive nights.   If you can -- please watch.  I'm sure it will be worth it.Sunday, May 10 at 9 p.m. EST\"The Memory Loss Tapes\" \"The Memory Loss Tapes\" takes an intimate look at seven individuals living with Alzheimer's, seeking to introduce a new understanding by sharing the devastating experience of memory loss from the point of view of the person with the disease.Monday, May 11 at 7:30 p.m. and 8 p.m. EST\"Grandpa, Do You Know Who I Am? With Maria Shriver\" and \"Momentum in Science, Part 1\"\"Grandpa, Do You Know Who I Am? With Maria Shriver\" is a is geared toward children and young teens coping with a grandparent's illness, and presents vignettes that can help a child understand and deal with a relative's gradual decline into Alzheimer's.\"Momentum in Science\" is a two-part, state-of-science odyssey that takes viewers inside the laboratories and clinics of 25 leading physicians, revealing some of the most cutting-edge Alzheimer research advances.Tuesday, May 12 at 7 p.m. and 8 p.m. EST\"Caregivers\" and \"Momentum in Science, Part 2\"\"Caregivers\" is a collection of five family portraits that illustrate caring for the different stages of Alzheimer's disease.The evening concludes with \"Momentum in Science, Part 2.\"\"The Alzheimer's Project\" is a presentation of HBO Documentary Films and the National Institute on Aging at the National Institutes of Health in association with the Alzheimer's Association, The Fidelity® Charitable Gift Fund and Geoffrey Beene Gives Back® Alzheimer's Initiative.",
        "title": "HBO Alzheimer's Series"
    },
    {
        "content": "If things go according to plan this is what is happening this weekend --Go to memorial service for one of the shooting victims belowMy son comes home for a long weekendVisit my friend Carol and her grandbabiesSee Georgia play Florida in baseballGo shoe shoppingHead to Macon for Manhattan Transfer concertAnd, my brother is back in the hospital in Illinois.",
        "title": "This weekend"
    },
    {
        "content": "Many of you may have heard that today, there was a shooting at a community theatre here in Athens.  Three people were killed.  Here is a link to the story from the Atlanta Journal Constitutionhttp://www.ajc.com/metro/content/metro/stories/2009/04/25/uga_professor_shooting.html?cxntlid=homepage_tab_newstabIt is so sad.  I knew two of the three victims.  They had been involved in community theatre for quite awhile and both great people.  Athens will miss them.My thoughts and prayers go out to the whole Town and Gown Theatre family.",
        "title": "A Sad Day In Athens"
    },
    {
        "content": "I got to meet my friends Pody and Rick from Champaign while I was in Illinois. I had to be sure that the Illinois logo on Rick's shirt showed so people didn't think I was hanging around a Tennessee fan. And, my great nephew Oliver is the handsome young man on my lap. Oliver was born in November.",
        "title": "Photos from Trip"
    },
    {
        "content": "I'm back from another trip to Illinois where I was visiting my ailing brother Bill. He just can't seem to catch a break.  We received some more disheartening news of his condition while I was there.My other brother, Tom, and I went to dinner with Bill's children, Elizabeth and Jonathan.  They are in their late 20's early 30's and have families of their own.  As I am, we are all struggling with the problems Bill is facing.  They want answers and so do I.  Unfortunately the answers are somewhat elusive.  I feel bad in that Tom and I are the \"adults\" if you will in this situation and we are not able to help Elizabeth and Jonathan with the answers they need.  I feel so helpless. I feel like I should be able to provide the support they need and I can't.  I've never really felt like the \"grown up\" giving out advice. But, they were looking for it and I couldn't help. No one can -- and that is the difficult part.As I look at the situation, I realize that in my own life people feel helpless because they can't help me either.  But, I'm not looking for help in terms of what people can do for me.  I just need people to be around me for friendship and companionship -- not to forget about me because I'm sick.  There will be days when my family needs help and I hope my firends are there to help them when the time comes.  I feel bad that I am going to be a burden on people and hope that it isn't too bad.  I feel as inadequate about that as I do about not being able to help my neice and nephew find the answers they need.",
        "title": "Back Again"
    },
    {
        "content": "This goose along with another goose made it to our house today.  We have had so much rain in the last week or so that in the background you can see the water standing in our front yard.  I don't know if these geese made a detour on their trip up north or what but they were certainly looking for food.  We feed the crows, the squirrels, other cats and whatever comes our way in the back of our house.  We usually feed them cat food -- I know it sounds weird but they eat it.  The geese didn't seem to care that much for it.  But they were lovely to watch before they flew away.Today I went to a funeral.  The father of a man I used to work for passed away.  The service was lovely.  He was loved my many and it showed.  Life is just too short.Friday Night Lights is a show that airs on Friday nights about high school football in Texas.  Last week while I was speaking at the Alzheimer's Conference there I had the pleasure of meeting one of the character's grandfather.  His grandson, Jesse Plemmons, is a Champion for the Alzheimer's Association. Jesse's grandmother had Alzheiemer's.  Coincidentally, in the show there is a story line that involves another character on the show with his grandmother who has Alzheimer's.  Although it is not clearly stated that that is her condition, it is understood to be -- at least by me.  Anyway, the show has been dealing with this story line in a very dignified manner.  But last week it struck a chord with me.  I could see myself in the character and it is scary.  Just as I saw myself in the Still Alice book.  You can talk about this disease a lot, but when you see yourself, it is scary and becomes even more real.  It's hard to explain, but it is also hard to watch.HBO is coming out with a series beginning in May about Alzheimer's.  They have been working on this for about two years.  I have been to several conferences where they were shooting.  I believe it starts May 10th and it is a four part series.  It will be good I'm sure as they have put a lot of time and effort into it.  I'm not sure if it is something I can watch either -- I know I'll tape it and watch it over time, but I'm not sure if I can watch it all at once.Terry Moran, one of the hosts of ABC's Nightline program just did a short series on Alzheimer's.  He has Alzheimer's in his family and he goes the through the process in his piece about getting his DNA tested to see what his chances of getting Alzheimer's are.  Here is a link to the piecehttp://abcnews.go.com/Video/playerIndex?id=7175910.  He also interviews Meryl Cromer, a member of Newt Gingrich's Alzheimer's Study Group (ASG).  I had the pleasure of working with Meryl on a prelude committee to the ASG about a year and a half ago.  She is a true crusader.  And, in the piece she also finds out what her chances are for developing Alzheimer's.  She now cares for her husband and mother who both suffer from the disease.  Please note that the tests that they had only were indicators of developing Alzheimer's not that they would definitely get Alzheimer's.  During my diagnosis I had a spinal tap which indicated that I carried one of the genese for Alzheimer's but it didn't necessarily mean that I would get Alzheimer's -- it was just one of many markers in my diagnosis.  The story is interesting and I thank ABC and Mr. Moran for doing it.I'm off to Illinois again on Saturday to visit my ailing brother.  I'm hoping to find him in better spirits and in better health.  I'll report when I return.Thanks for reading and sharing your comments with me.",
        "title": "This and that"
    },
    {
        "content": "I was the guest of the North Central Texas Alzheimer's Assn. chapter last week. I spoke at a conference they were holding and it had a great turnout. Over 400 people were registered and despite bad weather I think they all came. Shelley Bluethmann from the National Office and I were invited to be their keynote speakers. I really enjoyed my time there (although brief) and I appreciate the warm hospitality of all the Texans. Shelly Young did a great job of putting the event together and Theresa Hocker was a great hostess as well. The photo above isn't too good, but I wanted to model the cowboy hat they gave me as an \"honorary Texan\". Thanks for having me -- I really appreciated meeting everyone and sharing my story.I arrived back to Athens to rainy dreary days but I was pretty exhausted so I took the opportunity to rest. More next week.",
        "title": "Thank you North Central Texas"
    }
]