[
    {
        "content": "The holidays have been nice, but now it is time to get back to reality.  It was great having Alan and Jennifer home, but with all the extra \"stuff\" that accompanies Alan (no offense Son) it was starting to get on my nerves.  I had to take all the Christmas stuff down shortly after Christmas Day because I was starting to have panic attacks.  Have to get back to that routine you know!!!One thing I enjoy most about the holidays is hearing from friends you don't hear from often.  I love getting Christmas cards and I like to send them as well.  What worries me is when I don't hear from some one that has been sending cards and letters for years and then I don't hear from them.  I'm going to make an effort to contact them and hope that they are well.  When I was diagnosed with Alzheimer's I realized how much my family and friends meant to me.  I've said it here before that it is a shame that something has to strike you before you realize what is important in life -- but you hear many people say that.  So, it has been important to me to remain friends and reconnect with friends I have let slip by the wayside.  This past fall, a friend of mine popped back in my life that I was so grateful for.  We had been friends for years professionally and when we both switched jobs we kind of lost track of each other.  Then I ran into her in a local deli and I was so excited to see her and catch up on her life.  Unfortunately, I learned that her husband too was suffering from dementia.  She was glad to run into me as well and we shared notes and reconnected our friendship.  That has meant so much to me.If you are looking for a new year's resolution -- don't look far.  Look to re-establish or to at least strengthen your friendships.  You'll be glad you did.",
        "title": "Happy New Year"
    },
    {
        "content": "Well -- it is finally cold here in Athens.  The high today is suppose to be in the upper 30's.  But by Christmas Day they are looking at temps in the mid 60's.  At least it will feel like Christmas for a couple of days!  I know I haven't been good at blogging over the last week or so.  Have been busy and trying to prepare for this week.  We have been getting together with friends over the last several weeks and will again until after Christmas.  Fourteen people are coming to our house for dinner on Christmas.  Everyone is bringing something so it won't be too much work for me.  I'm sure that by this time next week I'll be ready to have the tree down and have things back to \"normal\".  I function so much better when things are near \"normal\".Wishing all of you a happy, merry holiday!",
        "title": "Christmas"
    },
    {
        "content": "Well I have so much to do and don't want to do any of it.  I just can't get motivated.  We have two Christmas parties this weekend -- and I have been complaining that we haven't done anything \"Christmassy\" but I'm not excited about going to the parties.  That's contradictory isn't it?  I suppose when the time rolls around I'll feel like it.  It doesn't feel much like Christmas to me yet.  I've done the shopping, wrapping and sent all my presents off to friends and family across the globe, but I still can't get into it.   I think it is just all overwhelming to me at times and I don't think I can handle it all.   Perhaps if the weather turns cold and feels like \"Christmas\" that will help.",
        "title": "Getting Ready for the Holidays"
    },
    {
        "content": "Alan, Josh, Chris, me, Melissa (Josh' wife) and Katie (Chris' wife)I hope everyone had a good holiday. I did -- but now I need to rest up. We spent a quiet day with friends for dinner. Our son came in early morning on Thursday and we went to Atlanta to pick him up. It was nice having a few days for just the three of us.On Saturday, we huddled around the television set to watchUGAplay Georgia Tech. For the first time in seven years, Georgia Tech beat Georgia. Since GT is Alan'sAlmamater -- he was extremely happy. It was finally his year to gloat -- he certainly had to wait a long time.On Saturday night Alan and I went to a \"come see Josh\" party. The photo above was taken there. If you have been following my blog, there are two young gentlemen that used to work for me that I continue to follow through their life's journeys. They are both a year older than Alan and when Alan went away to college, these two young men, Chris and Josh worked in the box office of the theatre that I was managing. They had many friends in common and they kind of became my \"surrogate sons\" for lack of a better word. I'm not sure they would agree that that is the proper word, but it works for me! Since that time Alan,  Josh and Chris have all gotten married in the last year or so. Chris now lives in Ft.Lauderdalewith his new wife Katie and he is going to medical school. Josh was home for some R&R as he has been deployed in Afghanistan. His wife Melissa just bought a new house and we went to see him and to see the new house on Saturday night. It is not often we can get together with everyone spread all over the world. Josh returns to Afghanistan in a week or so and will be finished with his deployment in July. These young men have been extremely kind to me over the years and are great about keeping in touch. I only wish the best for them. Since Chris and Josh are both huge Georgia fans, the defeat to Georgia Tech was a little more than they could handle.Now Alan has returned to Washington DC and I need some rest.",
        "title": "The Holidays"
    },
    {
        "content": "Well our Memory Walk is over for this year.  My team raised over $15,000!  The goal for the entire walk was $75,000 and we are short of that but we are expecting some more donations and we'll be close.  Thanks Lauren M for your donation through this page!I woke up on walk morning and it was pouring down rain.  That was at 5 a.m.  I rushed to the computer to look at the radar and it showed that it was moving out.  By about 8:15 the skies were blue and it was windy but no rain.  It turned out to be a great day weatherwise.  Later in the day the winds kicked up and a cold front moved through but not before the walk was over.Thanks again to everyone who supported my team!",
        "title": "Memory Walk Update"
    },
    {
        "content": "Is Saturday.  There is still time to donate on line athttps://www.kintera.org/faf/donorReg/donorPledge.asp?ievent=263086&lis=1&kntae263086=45CDC69FE5EB408ABAB1BC12959A015B&supId=9079347Thanks for all your support.",
        "title": "Memory Walk"
    },
    {
        "content": "I am feeling a bit overwhelmed lately.  I think what bothers me most is that I shouldn't be overwhelmed.  I have a few things that I need to do, but I can't seem to wrap my arms around them and do them.  The tasks seem daunting but they are not.  In my \"old life\" I would tackle all of these projects in one day and be done with them.  Now it takes me forever to get my thoughts together enough just to post to this blog!Thanksgiving is in a few weeks.  We usually get together with friends at someone's house.  I was thinking of being the host this year, but I realized I couldn't do it without help.  Alan is flying in from Washington DC on Thanksgiving morning and Ralph will be going to Atlanta to pick him up.  That means that no one would be around to help me get everything together for a meal.  So, I knew that I couldn't host friends coming over.  The realization of that bothers me a lot.  I realize that I could have asked some of my friends to come and help me but I didn't want to do that.  I wanted to do it myself and I can't.  That makes me sad.  Of course, one of our friends volunteered to do the hosting and we will all be together on Thanksgiving.  I'm thankful for that and for the fact that Alan is going to be here.  But it makes me feel inadequate and I don't like that.",
        "title": "Overwhelmed"
    },
    {
        "content": "I've spent the last two days in the hospital.  I was having some chest pains over the weekend.  I had had them earlier in the summer, but this time they seemed a bit worse.  I just had this sensation that someone was standing on my chest.  So, I went to the hospital on Monday morning. Going to the hospital is never fun.  There are two hospitals in Athens and we usually go ot the same one every time -- although I'm not going to say which one.  We have never really had a bad experience at this hospital -- until this trip.  The good news about the whole experience is that I didn't have a heart attack and there is no damage to my heart.  I have extremely low blood pressure and always have.  That could be my culprit.  But I'm fine now and enjoyed being in my own bed for a full night's sleep last night.  The bad news is that the as I mentioned the experience on this trip was awful.  I'm not going to go into it hear, but I did take lots of notes and plan to write to the hospital.  There is another option in town, and perhaps next time I'll take that option.  I felt my \"Alzheimer's\" kicking in when I became very frustrated and stressed while there.  It wasn't pretty!!!Many of you have asked about Alan and Jennifer.  I know I didn't post much when we returned from Washington but it was a quick trip.  Their apartment is nice -- really small -- but nice and in a nice new apartment complex.  The roof has an area where you can go sit and there are even hammocks!  I liked that part.  I'm not sure how much of the year you can enjoy being on the top of the roof and not freeze to death -- but the weekend we were there it was delightful.  They live a close walk to the National Zoo and we walked down there to see the pandas.  Alan commutes every day on the metro.  There is a metro station connected to their apartment building and his office sits on top of a metro station so he really doesn't have to deal with the elements too much on his daily commute.  Jennifer has not found a job yet.  I hope with the economic downturn we are in that she will get one -- it may take her awhile but we are hoping the best for her.  Alan finds out this week if he passed the bar exam.  He enjoys his job with Hogan and Hartson.  He's working a lot but I don't think much more than when he was in law school since he spent so much time studying.Memory Walk is in a couple of weeks.  Donations are down and that is probably a reflection of the economy.  Don't forget to vote if you haven't already.  I went the second or third day of early voting and didn't have to wait at all.  Now I know the lines are long -- but it is important for everyone to vote.",
        "title": "Odds and Ends"
    },
    {
        "content": "I've been busy with speaking engagements lately.  Last week I spoke to a graduate level course at UGA in Gerentology.  Their class was fun -- they had some interesting questions.  It's nice to get a chance to talk to young people about Alzheimer's.  I think it helps to look at it from a different perspective.Early this week, I went to Acworth Georgia -- a little north of Atlanta to speak to a group that was having a fund raising golf tournament.  It was a beautiful day and a beautiful location.  Thanks to my friend Brenda for going over there with me.And, a few hours ago I got back from Atlanta after speaking to The Georgia Association of Homes & Services for the Aging workshop that was on \"person centered care\". People from a broad spectrum of health facilities were there to hear what every one had to say.  Bob Balfour, another early stage patient from Atlanta and I were on a panel with Genny Helms from the Georgia Alzheimer's office.  Everyone was very receptive.  Hopefully, we made a difference -- even if it was only in a small way. Thanks for inviting us and holding the conference.Tomorrow, we have a fund raiser for the Memory Walk.  Then, next week another event on Monday night and I'll be finished with boot camp.  Then I plan to rest!",
        "title": "Speaking Engagements"
    },
    {
        "content": "I try to go to the gym on a pretty regular basis but I don't push myself.  I do a lot of things, but I honestly could do better.  So, I decided to \"jump start\" things by signing up for \"boot camp\". Three days a week for an hour, being drilled -- and yes drilled is the best way to put it.  I have been wanting to do this for awhile and each time I was going to sign up my husband talked me out of it.  This time, I wasn't going to have that happen.  Instead, he decided to do it with me.  I think he was feeling guilty that he wasn't doing something \"healthy\" as well, so he decided to join me.  Well, that was probably a mistake.  Of course, he is a lot older than most of the people there and it is grueling.  I'm not sure if he'll make it for the whole month -- he says it is harder than army boot camp -- which I cannot imagine.  I think that it has been so long since he did that he has forgotten.  Anyway, it is getting better for me, not so much for him.  Today is was pouring down rain and we were outside doing our thing -- that's dedication don't you think?  We'll see if it really helps me motivate myself to work harder in the gym.  I figure I can't do much for my mind, so I might as well do someting for my body!We are going to visit Alan and Jennifer in Washington DC this weekend.  We are driving and I told my husband that we need to stop to take exercise breaks so we won't be so out of it when we return to boot camp next week.  He didn't seem to like that idea.",
        "title": "Mind and Body"
    },
    {
        "content": "The art of letter writing has pretty much gone by the wayside with email and text messaging these days.  That is too bad.  I've always enjoyed letter writing -- as many of you may know.  When we were young and in school we were encouraged to have pen pals -- remember those days?  In fact, my oldest brother married his pen pal who lived in England and they have been married 40 years!  Right now, my sister-in-law's brother has been writing to me from England and it is so nice to go to the mail box and actually have a letter waiting for me some days.  I've enjoyed writing to him as well.I've written before about my letter writing to my son.  The day he was born I wrote him a letter and every year on his birthday I have written him a letter.  I put them all in the safety deposit box not knowing when the appropriate time to give them to him would be.  Since my Alzheimer's diagnosis these letters have become even more precious to me.  I'm able to share my feelings with him while I still can and when I can no longer remember what is going on at least he will know how I was feeling at some point.  I have struggled to know when the best time he should received these letters.  At first I thought it was when I died.  He knew that I wrote them and at some point he would get them.  Then, when he turned 21 I thought that would be the time.  But, I decided to give them to him the night before his wedding this last August.  We were alone together and I had gone to the safety deposit box to get all 25 letters out and put them in a box.  I thought since he was starting a new chapter in his life, that I would give them to him.  It was one of the hardest things I have done.  I shed quite a few tears and I'm not sure why.  His first reaction to me was -- \"I don't want those now!\".  I don't know if he thought that this was an \"end\" of some sort or what.  I told him that he didn't have to read them now -- he could read them five, ten or twenty years down the road.  I added a letter that he was to read first -- and that bascially told him that I didn't care when he read them, but once he did I wanted him to tell me that he had read them if I am still alive.  His other comment to me was \"Does this mean you are going to stop writing me letters?\" My response to that was \"I didn't say that!\" But, he has 25 letters from me now and who knows -- since his birthday is coming up I might write another to put away in the safety deposit box.  I guess my reason for giving him the letters now is for him to decide when the right time to read the letters would be -- not for me to decide.  Perhaps when my mind is to the point of not remembering him or what is going on it will bring some peace to him -- knowing how much he has meant to me through the years and how proud of him I am -- I may not be able to tell him that at some point and at least I know I'll have it covered!I guess what made me write this post is that I just finished reading the book \"Wednesday's Letters\".  It is about a man who wrote his wife a letter every Wednesday that they were married.  He wrote them thinking that he would die before his wife and she would have them to read as a sign of his love.  I won't spoil the book for you -- but it turns out they die together and the children find the letters.  What ensues is a beautiful story and reminded me so much of my letters to my son.If you miss getting letters in the mail from friends, write one yourself to a friend.  You might get one back.",
        "title": "Letters"
    },
    {
        "content": "Is this Sunday.  Hug someone you know has Alzheimer's.",
        "title": "World Alzheimer's Day"
    },
    {
        "content": "I know it has been awhile.  Thanks for all the emails and comments.  I've had so much to write that I couldn't get in all in a few paragraphs.Went back to the doctor last week after my MRI.  The MRI didn't show anything drastic like a tumor or a stroke -- which is a good thing.  My Vitamin B12 level is low so I am now giving myself daily injections of B12 for awhile.  I'm feeling a little better since the B12 shots have started to kick in -- more energy anyway.  I'm still having some numbing in my face and some problems on my right side, but we will see what the doctor says after looking at my MRI more closely. I go back in a couple of weeks.College football is here in all its glory.  I enjoyed watching three games at once yesterday with my remote control in my hand clicking back and forth between games.  I have a hard time following a lot of times by switching back and forth, but I do it anyway.This week I'm catching up with some old friends.  I've been pretty bad about that lately because I have been traveling so much.  I have to pace myself and only schedule so many \"events\" for the week.  That's hard for me to do -- I can very easily \"overbook\" myself and then have several days of trying to rest up.  It's hard to say no to people.  I have lots of friends having birthdays this month and next and try to at least go to lunch with them for their special day.  It's hard keeping up with all of it.I promise to try to do better in the coming weeks of updating my blog.",
        "title": "Sorry"
    },
    {
        "content": "Now that summer has come to an end I am hoping that I can get back into the swing of things -- which quite literally means getting back to my routine.  That has been lacking a bit this summer and I really need it.My neurologist's appointment this week didn't go so well.  The balance issues have gotten much worse and I am going to have another MRI.  Some other problems have cropped up as well so it is probably a good time for another one.  It has been 18 months since my last one, and we noticed a good bit of change on the last one from the previous one. So, I'm anxious to see this one as well.  We probably won't know a whole lot for a few weeks.Our trip to Michigan was great.  It makes me miss the midwest -- the cooler temps, the drastic season changes, the cheap produce (including watermelon!), and the lifestyle.  They say you can't go back home again, but it is sure nice to visit.My house needs cleaning, I have lots of scrapbooking to do from the summer and have to catch up on many things that have gone by the wayside this summer.  With all the travelling we did this summer -- between graduations and weddings, our family travelled over 35,000 miles in three months collectively.  When you are going from west coast to east coast several times that adds up.  But it was all worth it.I still have some resting up to do and when I do I will post some more about our trip to Michigan.",
        "title": "Getting Back Into the Swing of Things"
    },
    {
        "content": "Rachel Atterberry and Mark Vaughan are married!  We just returned from their wedding in Michigan.  The wedding was beautiful and I was honored to be a part of it.  Thanks to Rachel, Mark, Pody and Rick for making it a terrific weekend.",
        "title": "Another happy couple"
    },
    {
        "content": "And it was lovely. Here are a few photos. More when I have rested!",
        "title": "The wedding is over!"
    },
    {
        "content": "The last several days have been spent sleeping.  Traveling takes a lot out of me these days.  My awful trip back (as mentioned below) did not help matters much.  The day I was coming back the delay in my flight was long in Chicago and then when I got to Atlanta the airport was wall to wall people because of the delays in Atlanta.  I started having panic attacks because of all of the people and I could not get out of that airport fast enough.  I was almost running through the airport to get out of there.  I thought about trying to go into a rest room or somewhere where there weren't as many people and try to calm down, but I couldn't find anywhere where there weren't a lot of people!  I thought if I could just get out to the shuttle bus where they can get me to my car I'll be fine.  I got out there fast although it seemed like an eternity.  I finally got my heart rate down and started to relax.  It was raining a little but I didn't care.  I then got in my car to come home and there was a major accident on the major interstate I was coming home on.  While that didn't bother me too much, I was tired and I just wanted to get home.  Obviously I made it home -- but it really takes the fun out of traveling!We are getting into wedding mode here at the house.  My brother-in-law from St. Louis comes in on Wednesday and Alan will be home.  That is going to be four people in the house as opposed to our usual two.  I've told my husband already how hard that is going to be on me and that I need my quiet time and I need his help.  It's way too much confusion to have that many people in the house for me, let alone clean and cook.  I know my brother-in-law will understand when I just have to go into a room and shut the door for quiet time.  By week's end we will be staying at a hotel in Atlanta for the wedding and it will be easier for me to escape.   I really enjoy having company and seeing people, but it isn't like it used to be.  I get so tired so quickly and I'm not myself.  I hate this!!!!",
        "title": "Wedding Week"
    },
    {
        "content": "After a very very long trip yesterday I'm finally home from Chicago.  Between thunderstorms in Chicago and Atlanta and a very large car crash blocking traffic in Atlanta it was a long day.  More about that later.I was in Chicago for the International Conference on Alzheimer's Disease.  Over 5,000 people from around the world were there -- it was pretty impressive.  They are all trying to find a cure for this disease.  That's encouraging.  Of course, most of the sessions were so technical they were way over my head, but I hung in there for a few of them.  There are some exciting things in the pipeline -- it will just take years for the drugs to make it through our complicated process of clinical trials and the FDA.  I have to keep in my thoughts that there will be a breakthrough of some significance in the next ten years or so.Thanks to the BBC for their remarkable five part series on Alzheimer's this week.  I have had lots of comments on the show.  They filmed my story while I was in Washington in May for the Public Policy forum and it ran on Tuesday of this last week.  Here is the link if you missed it.http://news.bbc.co.uk/2/hi/americas/7532226.stmOn the page that this comes up on you will also find links to the other stories that ran.  It was a powerful series in all.There was a lot of press last week on Alzheimer's with the conference going on.  And, Memory Walk commercials were running last week as well.  If you want more information on the conference you can get it atwww.alz.org.  I will be writing more once I am rested.",
        "title": "Chicago"
    },
    {
        "content": "I'm off to Atlanta in a few hours for a meeting there.  And, next week I have meetings in Atlanta and Chicago so I will be gone most of the week.  The week after that is THE wedding. Then I will probably collapse and rest for a few weeks!A lot of events have taken place this summer with graduations and weddings.  I haven't had much time to reflect on them, but as I do think about them, I wonder when those events will be a long lost memory for me.  It's kind of weird to think of it like that, but what will I remember in the years to come of those events?  It's anyone's guess I suppose.  The words \"living in the moment\" seem appropriate at times like this.  These events will be memories for some, but most likely not for me.  Enjoy the time you have with loved ones!I noticed on the traffic on this site that I have had a few people in the armed forces looking at my blog.  My friend Josh is now serving \"over there\" and I hope it is he that is reading.  If it is, we miss you a lot Josh and our prayers are with you to remain safe.  That goes for everyone \"over there\" not just Josh.Won't have much time to write until I return from Chicago next week.  Alan takes the bar next week so everyone cross your fingers for him.",
        "title": "On the Go"
    },
    {
        "content": "Every time I finish a post I think of something else to write.  Then, I forget it the next time I post!  Guess it goes with the terriroty!Another promising drug for Alzheimer's that was in the final stages of clinical trials has failed to provide enough data to end up being marketed.  Here is a link to the Alzheimer's website for more information.  Last year, the same thing happened with another drug.  We just need to keep trying.http://alz.org/news_and_events_13918.aspI played golf yesterday and with my balance issues I wasn't sure I was going to do so well.  But, I did o.k. -- however, I did use my pull cart and my golf club as a cane.  I had a few moments when I thought I was going to fall but I didn't.  I think I must look like someone who is drunk!  Today, it seems to be a little better.Jennifer and Alan are on the move from California.  They had some car trouble yesterday so they had unexpected delay (and somewhat costly) but I told Alan on the phone that at least they were not in an accident and they are o.k -- even though they won't be home on the day they planned.My nephew that just got married, passed his dissertation for his doctorate in child psychology last week.  Congratulations Jonathan!  I'm so proud of him -- he has worked really hard for this and will be working at a school district in upstate Illinois in the fall.  It's nice to have a \"Dr.\" in the family.Hope everyone has a great Fourth of July -- at least for the Americans reading this blog.",
        "title": "Odds and Ends"
    },
    {
        "content": "The weekend is over and ended with a huge thunderstorm.  The wind blew over a tree about a block down the street and knocked down some power lines.  We were without power for 6 hours.  It was about 9:00p.m. when it happened.  It was extremely warm in the house so we had to open all the windows.  The bad part was that a fire truck was sitting idly in front of our house until the power company could come.  The power company showed up around 2:00 a.m. with chain saws and started cutting up the tree. Finally the power was restored, all trucks left and I could finally go to sleep. The tree fell on a car parked on the street, but luckily there were no fires and no one was hurt that I am aware of.  We think the wind blew the tree over but ther was some powerful lightning in the area but none of the neighbors heard anything that sounded like lightning striking the tree.Balance issues were plaguing me a great deal this weekend.  I'm not liking this one bit.  I met three other ladies for brunch yesterday and had difficulty walking to the buffet line and out the door.  I held on to someone to help me the rest of the way.  Around the house I'm just sure not to \"walk with sharp objects in my hand\".I forgot to mention that we had our captain's meeting for this year's Memory Walk about a week and a half ago.  With the economy the way it is this year it may be a little more difficult to raise money but we are certainly going to try.  A new friend of mine from Atlanta came over to speak to our group -- her mother is \"young\" like I am and has the disease.  She did a great job.Last week I went to an assisted living center about 20 miles away that has a monthly support group and talked to them.  They were great and it did me good to get out and speak.  I say that it is as much therapy for me as it is for them.It's likely to be a slow week this week with the holiday.  Jennifer and Alan are driving to Georgia from California starting today. They are hoping to be in Atlanta by week's end.  Ralph wants to play golf tomorrow, but I'm not sure if I can play with the balance issue.  Guess I'll have to wait and see.Everyone have a great week.",
        "title": "This and That"
    },
    {
        "content": "I mentioned in my blog a few days ago about how saddened I was at Tim Russert's untimely death.  Of course, I didn't know him, but was very sad by his loss, as was it seems the nation.  I have been watching lots of the coverage that has aired on all the stations recently and realize what a \"larger than life\" person he was.  He touched so many lives.  His son Luke, is a testament to his father.  I cried openly yesterday as I listened to his son giving a loving tribute to his father.  You look at a young man like that and realize his future is bright and going to be filled with great things.  How proud his family must be of him.  For someone to only be 22 years of age and command the respect he did is truly amazing.  There are many wonderful and amazing young people out there that we don't get to see much of.  They are making their way into the world and we will hear from them in due time I am sure.I'm sure my son is reading this at some point and he knows how proud I am of him.  I thought of him a lot yesterday while watching Luke Russert speak, thinking that he reminded me a lot of Alan.  Alan has a few years on him and has not had the privileges that Luke has enjoyed but they both seem to have worked hard to get where they have gotten and are very mature for their age.  I know that all parents are proud of their children and we probably don't tell them enough what they mean to us.  It's never too late to tell them.  Alan shared with us last night that he was ranked in the top ten percent of his graduating law school class at Stanford and for a class size of 180 that is pretty good.....it's actually better than pretty good!  I think I used the word amazing last night but I don't think that is the proper word either! It is well deserved.  You did good kid! Now go pay off that law school debt!!!",
        "title": "Tim Russert's Memorial Service"
    },
    {
        "content": "I continue to get lots of comments from the recent articles and many phone calls as well. Thanks for all your support. To \"grits\" -- if you will email me atkrisbga@hotmail.comI will be glad to answer your questions.One of our advisory board participants is interviewed by US News and World Report. His story appears herehttp://www.usnews.com/blogs/planning-to-retire/2008/06/17/second-career-plans-scuttled-by-illness.htmlThis has been a rough week for me. I have lots of unfinished business to take care of and I'm not able to get it done. This, too, shall pass.",
        "title": "Comments"
    },
    {
        "content": "Yesterday was Father's Day.  After my father passed away, many many years ago it was difficult for me to go into a card store where they sold Father's Day cards.  And, sometimes, even now it is difficult for me to look at the cards celebrating Father's Day.  I felt especially sad this weekend when I heard the news about NBC's moderator of Meet the Press, Tim Russert's passing.  Of course I didn't know him, but I felt as if I did.  And, I know from watching him for so many years, he was so proud of his son Luke.  I kind of felt like part of my family passed away with him and I know that sounds silly.  But, I really enjoyed watching him.  I particularly liked his book \"Big Russ and Me\" about his father and their relationship.  I remember reading that and thinking that many times he was describing my relationship with my father.....which was indeed special.  He's been gone for 25 years and I still miss him.Go hug your father, mother, son or daughter.",
        "title": "Father's Day"
    },
    {
        "content": "is the name of the book that sportscaster Jim Nantz just wrote about his father who suffers from Alzheimer's.  I have been a big fan of Mr. Nantz's for a long time.  So, I was very interested in his book.  It talks about the special relationship he has with his dad, and how the sports career that he has had has influenced his life.  It is an easy read and I really enjoyed the book.  If you are not a sports fan, though, I am not sure you would enjoy it as much.  Since I'm kind of a sports junkie I could relate to many of the stories he told because I remember them and I've kept up with lots of the players in the book over the years.  His relationship with his father, and other people, like former President Bush (#41) is very interesting to read about.  The struggles they have faced with Alzheimer's in the Nantz family are no different than the ones faced by you and I, but he puts a different spin on it.  I would certainly recommend the book.It has been extremely hot here (as it has in other parts of the nation).  I got a little dehydrated over the weekend so it has taken me a few days to recover.  I'm suppose to be playing golf tomorrow but it is only suppose to be in the low 90's -- as compared to over 100 degree temperatures for several days here this past weekend.Things are kind of quiet around our household these days.  That's good -- it is the calm before the storm I know but it is still good.  T-Minus 61 days until Alan and Jennifer's wedding.",
        "title": "Always By My Side"
    },
    {
        "content": "Well, this week started out pretty quiet.  I think I needed that.  I was having a hard time getting my thoughts clear enough to getting much accomplished around the house.Once the news article ran, my blog got lots and lots of hits and I really appreciate the notes and comments that have been left for me.  I haven't published all of them for various reasons, but please know how much that means to me.  Hearing from others diagnosed young is always nice, although I wish it weren't the case.  There are many many people out there speaking out with the disease and I thank all of them for standing up to it and making a difference.  Together, we can all fight this!I heard Jim Nantz (CBS Sports reporter) on the news today talking about a new book he had written about his father who has Alzheimer's.  Jim Nantz has always been one of my favorite broadcasters and I'm anxious to read what he has to say -- it sounds like a great tribute to his father.It's extremely hot here in the south these days.  I went to a baseball game today and it was well over 90 degrees.  Zapped me of much of my energy but at least I was able to go.  Last week I went to one and it was so noisy and I wasn't having such a good day, that I wasn't able to last long.  But I try!",
        "title": "The Week"
    },
    {
        "content": "I must say that since the article recently written by Lauran Neergaard of the Association Press on Early Stage Alzheimer's has been released, the traffic on this website has increased significantly.  I hope that those of you that are looking at this and are seeking more help about Alzheimer's will go one step further and contact the Alzheimer's Association if you need more information.After my initial diagnosis the first place I went to was my local Alzheimer's Association and asked for the help.  I basically said, \"I'm 46, have Alzheiemer's --what am I suppose to do\".  And, although they can't offer a cure, they have certainly been with me every step of my journey since finding out I had this disease.Many of us are writing about our experiences since being diagnosed.  Some days it is harder than others to put into words what we are feeling and experiencing.  So, there are some days you will read this and not see anything about Alzheimer's.  I can't dwell on it all the time, and the reason for this blog is more to let my friends and family in on what I'm going through when it is appropriate to do so.  Early on in my diagnosis they would ask me \"How are you feeling?\" and I would just say \"fine\" instead of going on in detail how difficult some things had been for me.  Through this, though, as things happen I can share the experience of living with Alzheimer's.  It's not always fun sharing, but sometimes it can be funny.  It's easier to laugh at myself when I do stupid things, than to admit how stupid I feel when I do things!  I don't always get it in the right words, but I try, and that, in essence what this blog is all about.Thanks to Lauran for writing the article and hope that it helps start more of a dialogue about early stage Alzheimer's.",
        "title": "Recent News Article"
    },
    {
        "content": "I'm not sure my life is ever \"normal\". But, I'm probably back to being as normal as it can be -- at least for a month or so.  Alan is back in California so the house will be quieter (and less messy). I'm back to my routine and that's important.  I'm still extrememly tired from our trip but I have lots of days to rest up.  My husband has a nasty cold and keeps me up at night coughing, but last night I was able to go into Alan's room and sleep so I got some rest.Alan and Jennifer's wedding is August 10th. They have just started a websitewww.alanandjennifer.com.  They will be posting information on it as they firm up more details.  They will be moving back to Atlanta the first week of July, Alan takes the bar at the end July, then the wedding, honeymoon and the move to Washington DC.  So, I have about a month before things start getting a little busier.More soon.",
        "title": "Back into the swing of things"
    },
    {
        "content": "Yes, there is a new look to this page. I'm not quite used to it yet. My son helped me with it and I'm sure I'll make a few changes as the days and months go by. We finally made it back home today and I'm so glad to see my little house. It will take me quite awhile to rest up but I wanted to post this photo of the new bride and groom, Kathy and Jonathan Stagg. I'm so happy for them.More soon!",
        "title": "New Look"
    },
    {
        "content": "I'm still on the road -- will be back tomorrow night (Monday).  It's been a long and tiring trip but I'm glad we made it.  I'm glad Jennifer could come in from California, because as I said in one of m previous posts, it is probably the last time my family will be together.  She got to meet a lot of people that she has only heard about and some that I haven't seen in a long time.  One of my sister-in-laws is originally from England.  She and my brother have been married for almost 40 years.  Two of her brothers and one of her sisters came over for the wedding. One of her brothers was here 38 years ago when I was just 14 -- mind you he was only 18 at the time!  I met her other brother at some point when he came visiting and I had never met her sister.  So, it was certainly a special time for all of us.  The wedding was great -- real laid back but everyone had fun.  I'll post a few photos when I get back.it will be nice to get back to a routine.  Alan leaves to go back to San Francisco on Wednesday and then life will be a little more \"normal\".  After jennifer and Alan move back in july it will be full steam ahead for their wedding.It was an emotional week for me.  Hard to deal with some things, hard to let go of some things. I've become much more emotional though in the last few years so it doesn't take much!!!! I lost my necklace that a dear friend gave me about ten years ago.  I never took that necklace off -- i loved it so much.  I had always admired other women who had something from their husbands like a necklace that they never took off.  My husband never gave me anything like that.  One year for my birthday a very dear friend from Illinois sent me a necklace that had a small pendant on it.  It was oblong and had the word love on one side, and then the word love was spelled in Chinese on the reverse.  It was very simple but beautiful and i fell in love with it when I saw it.  I knew that once I put it on I wouldn't take it off.  i got so many compliments on it.  Then, the chain broke when I was in Peoria this week and I lost the pendant.  I have no idea when or where it broke but it did and I was so sad to have that gone.  It really meant a lot to me.  I got very emotional over that.  I know that sounds silly, but it wasn't just the necklace, it was the thought that my friend would have taken time to buy it for me - he has such good taste and he knows how much I have worn that.  I'm going to hate to have to tell him.Enough about that.  I'm using Alan's keyboard and I don't like it, hence the capitalization errors in this post.  I'll try to clean it up later.More when I get home.",
        "title": "Trip to Illinois"
    },
    {
        "content": "My husband has been gone for five days.  He and my son are driving fromPaloAlto to Illinois.  It has been heaven to have the house to myself and the quiet.  I know I have written about this before, but you have no idea how much better I do by myself in solitude.  I don't have to have the distraction of the television or from my husband.  I don't realize how much it affects me until I get my quiet time alone.  There isn't much that can be done about it since my husband has retired and is home all the time, but I relish my quiet time alone.  I have a few more days of peace.In a couple of days I'll be flying to Illinois to meet the guys and Jennifer will fly in from California to meet us for my nephew's wedding.  Adjusting to all of that will be hard after my almost week of solitude!  This wedding, however, will probably be the last time that my whole family will be together.  It's kind of weird to think about that.  I have two brothers, one that is 13 years older than me and another that is only two years older.  My oldest brother is not in good health so I don't think he will be able to travel to Alan's wedding this summer.  I have a niece who is living in Nevada who will be back for the wedding in Illinois, but probably not for Alan's wedding either.  So, I guess this is the time to take all the photos we can as it will probably be the last time we are all together.   Growing up I thought our family was pretty \"normal\".  But, looking back I can see that it was anything but that.  Funny how your perspective changes as you get older isn't it?On another note,  a friend of mine that I used to work with called me this morning and her brother passed away yesterday at the age of 48 from a heart attack.  Since I'll be gone to Illinois I will miss the services and funeral and I hate that -- I don't think I have been as good a friend to her as she has been to me, and, for that I feel bad.  I have to do better by that.More before I leave.",
        "title": "This and That"
    },
    {
        "content": "Here is our Georgia delegation to the Public Policy Forum. Great photo in front of the US Capitol! At least it was sunny that day as it had been raining very hard the first three days.",
        "title": "More Washington"
    },
    {
        "content": "I was so glad to run into these folks at the public policy forum.  The top photo is a friend from Missouri, Alicia.  I met her about 4 or 5 years ago at the first public policy forum meeting I went to.  She was so sweet and like me another early stage, early on-set Alzheimer's person.  We have stayed in touch somewhat over the years but I didn't know she was coming.  I love her and she has such an open heart.  It was great to see her.The second photo is Sue from Louisiana.  She has a blog inhttp://livingwithearlyonsetalzheimers.blogspot.com/which she talks about her life with this disease.  I have been reading Sue's blog for several years and it was nice to see her there.The last photo is Diane from Nashville.  She writes about her journey with Alzheimer's athttp://www.knitmentia.blogspot.com/What a wonderful treat to be able to meet her as well since I have been keeping up with her online as well.Other people took photos with theircamerasand when I get some of those from them I will post more.  Alan and I met with the Georgia delegation with some of our Georgialegislatureson Capitol Hill while we were there asking for increased funding and to eliminate the two year waiting period for medicare for those under 65.  We met with CongressmenWestmoreland, Deal and Senator JohnnyIsaakson.  We had to meet with Congressman Price's aide as he was making a speech on the house floor.  All were relatively accepting of what we had to say except CongressmanWestmoreland.  He flat out told us that he would not support our increase for funding because he didn't think the NIH was using the money wisely.  The others pledged their support for increased funding and all said they needed more information on the two year wait ban.  Our meetings were interesting to say the least.  The BBC was filming our meetings withWestmorelandandIsaaksonso that is forever on tape.  They were following me around to various meetings during the conference on a five piece series they are doing about Alzheimer's.I have more to talk about but will finish later today.",
        "title": "More Washington DC"
    },
    {
        "content": "Just got back today from Washington.  I promise to post more about the trip.  I hope you saw all the press about the conference and Sandra Day OConnor speaking at a senate committee hearing for increased funding.  The Washington Post did a great article and there is also a video from the town hall meeting.The video is about 5 minutes long and you might enjoy seeing it.  I promise to get to all the comments that have been left for me shortly.http://www.washingtonpost.com/wp-dyn/content/article/2008/05/13/AR2008051303349.html?wpisrc=newsletterYou may have to cut and past this address into your browser.",
        "title": "Back from Washington"
    },
    {
        "content": "I said I would blog while I was in DC and I have been a little busy.  It's been raining a good bit and Alan came in on Friday.  We went to the Newseum -- a new museum about the news industry.  It was fabulous and we spent 4.5 hours there.  I could have stayed all day.  Then we went to a Washington Nationals game which wasn't so good as they lost 11-0.  Then we played 18 holes of golf on Mother's day.  The best part of Mother's Day was that I got to actually spend Mother's Day with my son for the first time in three years.Now the conference has started and we had our Town hall meeting this morning.  I left it early and as I write this some people from the BBC America are filming this for a piece they are doing on Alzheimer's disease.  I will let you all know when it is going to air.  There is a lot of press here for the conference which is great because we need the publicity.  It was encouraging today that so many people stood up at the Town Hall meeting to speak.  They shared information and it was a good exchange.  Tonight there is a Candlelight vigil somewhere near the capitol where one of our early stage advisory group members is going to speak.  It should be rather emotional.  I am hoping that the rain will stop and we will have some people there.Tomorrow we have a full day of meetings and then on Wednesday we will be going to Capitol Hill to meet with our legislators.  The BBC film crew is coming to Capitol Hill with me so at least I will have our legislators attention with a film crew in tow.  To many of you that have asked -- the two year wait for Medicare is also big on the agenda here and we are hoping to make some impact on that subject as well as increased funding for research.  So,to all of those that have asked me to speak about that -- I am and I hope we will be able to see the fruits of our labor.I will write more when I can.",
        "title": "Washington DC"
    },
    {
        "content": "Got into Washington yesterday afternoon.  When I got in, the entire terminal looked different to me.  I realized that I had never flown Airtran into Washington DC before -- always Delta.  So, I got really confused and disoriented.  I had a panic attack and then asked for some help to get my bags and a taxi.  Once I got to the hotel it was fine, but needless to say I didn't venture out much on my own!  I did get to have a nice rest before meeting up with colleagues for dinner.Today we have three interviews scheduled.  The weather is pretty bad -- bad storms last night and lots of rain this morning.Alan will arrive tonight and that will certainly help me.",
        "title": "Washington DC"
    },
    {
        "content": "I'm off to Washington DC tomorrow.  Two days between trips isn't quite enough for me.  Plus, I'm getting a cold my son had over the weekend.  When I get to DC tomorrow I think I have about one day of rest before things get busy.BBC America is going to do a piece on Alzheimer's while I am in Washington and they will be interviewing my son and I and following us during the conference.  The piece sounds promising so I'll let you know when it migh air.While I was in California I recieved the loveliest note from someone who heard me speak in Macon a couple of weeks ago.  She is a cancer survivor and has some struggles of her own.  It was so nice to recieve her note and for her to take the time and trouble to contact me after the event.  I look forward to getting to know her better.Several weeks ago I mentioned that I was reading the Story of Forgetting, a new book out about Early on set Alzheimer's.  I finished the book and I didn't like it all that much.  It was very complicated for me to follow and it was certainly a different approach to the subject.  Many books are very emotional that deal with this subject and it wasn't -- which is o.k. -- it was a little too technical at times if anything.  And, there was a lot of symbolism in it and I'm not sure I caught all of it.  It was a very hard read for me.  My favorite book so far is Still Alice by Lisa Genova and Losing My Mind by Thomas DiBaggio.  Someone left a note on my blog about the latter book and it was one of the first books I read after being diagnosed.  My son had given it to me for Mother's Day the first year of my diagnosis.  I'm sure others will like the Story of the Forgetting -- it just wasn't for me.My son will be joining me in Washington DC to help me maneuver -- I don't travel so well by myself anymore.  Although I just saw him last week -- it will be nice to be with him on Mother's Day.  And, Happy Mother's Day to all of those mothers out there reading this.I'm going to try to blog from the road.",
        "title": "Off again"
    },
    {
        "content": "was Sunday at Stanford for Law School. Here is a family photo. I'm leaving in two days for the Public Policy forum and will try to post before leaving.",
        "title": "Graduation"
    },
    {
        "content": "I got a pleasant surpise in the mail today -- Michael Feinstein sent me three CD's.  When we were together last week we were talking about his CD's and he told me he was going to send me some.  And, they came today.  I didn't really expect them -- but now they will be downloaded on to my IPOD for my upcoming trips.We are getting ready for the trip to California.  I'm looking forward to it.  We probably won't be out there for awhile since Alan and Jennifer will be moving to the East Coast.  I'll miss an occasional visit out there.I'm also trying to gear up for the Public Policy Forum in Washington DC the Alzheimer's Association is having the next week.  I'll be home for two days and then off to Washington.  It will be a very busy time for me and I hope I can keep up.  I'm going in a few days early as the Association has interviews set up for me with the Associated Press, AARP, and the BBC.  Alan is coming with me on this trip to help me maneuver my way around.  It will be fun to have some quiet --if you can call it that -- time with him.  At least we will be together on Mother's Day and that means a lot to me.  During the conference he and I will be going with members of our State Alzheimer's office to lobby on Capitol Hill for more funding for Alzheimer's research.  We have meetings set up with Congressmen Price, Lewis, Westmoreland and Deal as well as Senators Isakson and Chambliss. A very busy agenda as you can see.  During the Washington trip we will also have our last meeting of the Early Stage Advisory Group that I have been associated with the past year.  It has been a rewarding experience and I have gotten to meet some great people who also serve on that committee.Our state Alzheimer's Association has a new Executive Director that I met last week.  I'm anxious to get to work with her as well.  A lot still needs to be done!!",
        "title": "Busy Days Ahead"
    },
    {
        "content": "As you can see by the photos, I got to meet Michael Feinstein last night. The fund raiser was great and the development director in Macon, Karen Kinsler, did a great job putting it together. I spoke a few minutes before Michael came out and met with him briefly after the show. He is doing alot to help raise awareness for Alzheimer's and to help raise money. It was a great evening.Today has been a hard day for me because the day was pretty long yesterday and I'm very tired. Things are\"hazy\" for me at best at times today. I did get to take a little nap before I had a meeting this afternoon for the Memory Walk, but putting this post together has been difficult. I'm glad I have the weekend to rest up.We'll be off to California next week.",
        "title": "Magical Evening"
    },
    {
        "content": "Tonight there is a fund raiser in Macon for the Alzheimer's Association featuring pianist, singer Michael Feinstein.  He has always been a favorite of mine.  In my previous job as theatre director in Athens, he was always on my \"short list\" of entertainers I wanted to have come perform.  Well, it never happened.  But tonight, I will get a chance to hear him perform live and also get to meet him briefly.  I've been asked to say a few words before the concert and I'm looking forward to the evening.The weather is beautiful here this week and I've been enjoying being outside.  The pollen count is pretty high -- but it is worth it. We played golf yesterday and I played better than Ihave played for a long time, but I was well rested before hitting the course so I think that helped.More when we return from Macon.",
        "title": "Michael Feinstein"
    },
    {
        "content": "One thing that seems to be real universal with everyone that I know that has Alzheimer's is the lack of being able to deal with math.  I can't make change anymore.  I just usually give the clerks a twenty and they give me change back.  Today I was in Borders bookstore and my bill came to $27.45.  I handed the lady $17.00 in cash.  She tried to explain to me that I was short -- I understood what she was saying but I couldn't wrap my mind around it in order to give her more money.  I just stood there not believing I couldn't figure it out.  Needless to say, I got frustrated and took the money back and gave her a credit card.  I always joke that \"God made credit cards\" for those with Alzheimer's that can't handle money.  It makes you feel so stupid that you can't figure something as simple as that -- and I didn't want to tell the lady why I couldn't make the change in the first place!   How frustrating.The book I did buy at Borders is called \"The Story of Forgetting\" about a family dealing with Early On Set Alzheimer's with several members of their family.  If anyone has read it yet, please let me know what you think.  I've read some good reviews on it.Speaking of money........$7.99 for a watermelon at the grocery store? I don't think so! Talk about sticker shock!  If gas prices weren't bad enough!And, the last thing about money -- I have to have yet another crown -- another $1,000 to my dentist!  What fun.  My husband said with all the crowns I've had lately that that was my trip to Australia --- considering that is probably never going to happen anyway -- I guess he is right.",
        "title": "$$$$$$$$$"
    },
    {
        "content": "This week my husband and I have been volunteering for a golf tournament.  My husband has been working more than I have because it is just too much for me.  I had forgotten how much better it is for me when there is no one in the house with me......silence is golden.  After I retired, my husband was still working and I had about two years here at home by myself.  The television was never on, the radio was never on and my peaceful day was bliss.  After he retired that all changed -- I had to suddenly become use to the noise of the television, someone else in my space, and the constant need to be \"on\" -- since I had someone else around who was expecting me to communicate.  If you knew me before I had Alzheimer's you would have agreed with me that being in a quiet still environment would not have been what I wanted, I would have gone crazy in no time flat.  But the distractions that just one person has on me is tremendous.  This week while he has been gone most of the day have been so much better for me.....I haven't been as tired as I usually am and have just felt better.  There's nothing I can do about the situation since my husband is retired -- I know he isn't going to get another job!  We have tried \"quiet rooms\" and that works to some extent, but it's not perfect.  My husband likes to do things together so when he plays golf he wants me to go with him.  Sometimes, I just find myself having to say no because I need that quiet time.  It sounds awful selfish I know, and I feel bad about it.I have one more day to myself and I'm going to enjoy the sounds of silence.",
        "title": "The Sounds of Silence"
    },
    {
        "content": "This has been a weird week for me.  I've been unusually depressed about a lot of thins -- and of course--those are things that are out of my control.  I know I shouldn't worry about them because there is nothing I can do, but I do.  And, more so now than before.  I try to rationalize it instead of feeling trapped by these things, but I can't.  It's harder for me to process my feelings and that is frustrating in itself.  Several specific things came up this week that really made me sad and helpless --that I couldn't do something to make it right.  But, I can't and know one can. Life is like that sometimes.I've also been extremely tired.  I haven't been sleeping well and I think it might have all caught up with me.  Therefore, I too, am not thinking as straight as I should be.My husband and I are doing an interview tomorrow with a UGA student who is doing a project on demintia.  Her grandfather passed away with Alzheimer's and she is a media student at UGA.  She has a magazine article to write and she also needs to do a video project.  So she and her \"crew\" will be here tomorrow to do that and then it is rest for the weekend.We are volunteering to work at a golf tournament that is in town next week.  It will be our third year in doing this.  This year, I can't do as much as I used to.  It is too much for me but a couple of days I can handle.  I feel bad not working every day, but I learned my lesson last year that I have to be better to myself and pace myself.In three weeks we make the trek to California for Alan's graduation.  I'm looking forward to seeing he and Jennifer since it has been Christmas since we saw them last.It's taken me forever to write this as I have had to back and look at the grammar over and over.  I'm sure I have missed a few things, but hopefully you can read it.  More after I have some rest.",
        "title": "The Week In Review"
    },
    {
        "content": "Yesterday was the Town Hall meeting in Atlanta.  Almost 100 people drove through some pretty rough rain and weather to get to the meeting.  We were very pleased with the turnout and the results.  I was so pleased that so many people spoke up and shared their stories.   The Association did a great job in getting prepared and facilitating the meeting.  I was especially moved by the people who find themselves still waiting for social security and for the system to catch up with them.  It is so sad that this is the way it is, when it doesn't have to be.  Many were forced from their jobs and the stories become all too familiar.Thanks to those who came up to me and said they have been following this blog.  I never know who is going to read this and to those that do I say thank you.  Many times I don't know what I'm going to write when I sit down at the keyboard.  I find people do wade through some of the nonsense that I publish here -- and I appreciate their patience with me as I struggle to write sometimes.But yesterday was extremely exhausting for me.  I realized about mid way through the session that I didn't have as much \"reserve\" as I thought I did so it was hard to keep going.  I was able to catch a catnap on the way home from Athens which helped a little.  But then, I tried to watch NCAA basketball last night and kept falling asleep.  Every time I would wake up I would catch the score watch a little more and then fall asleep again.  Hopefully, I can stay awake for the women's games tonight.",
        "title": "Town Hall Meeting"
    },
    {
        "content": "was funny.  It's definitely for mature audiences but it is worth seeing if you get a chance.  Russ, I didn't get your comment until I returned home to Athens. Sorry I missed you.  I saw Sunshine but she was busy and I didn't want to bother her.It's just starting to rain in Athens.  It poured while we were leaving the show in Atlanta.  I hope the rain can wash a little of the pollen away.",
        "title": "Avenue Q"
    },
    {
        "content": "Well, I'm back from Norfolk.  Our women's team got bounced in the second round of the NCAA tourney.  A disappointing loss needless to say.I'm extremely tired from the trip.  I slept most of the day yesterday and felt as if I was a step behind all day.  Today I am very anxious.  I'm upset about a couple of things that happened in my absence and I don't really know why.  I think I am probably more upset with myself about letting these things get to me, but just the same, I'm upset.  I'll get over it. I usually do -- it just takes me longer these days to let go of things.  It's one of those days where I could sit around and cry all day.  I used to have more of those days.I need to enjoy the day -- it is suppose to be sunny and nice outside.  Maybe I just need some fresh air.",
        "title": "Loss in Virginia"
    },
    {
        "content": "I'm writing this from the hotel in Norfolk Virginia.  Our women's basketball team (UGA) pulled out a win today against Iowa.  It was a very close game and exciting down to the end.  We now play No. 1 Ranked UNC (in our regional) on Tuesday night.  It's been a long day for me with all the excitement.I bowed out of dinner tonight because I was just too tired and knew that it would be too much for me.  I need my rest.  Yesterday was a long day with the ride and I was pretty tired at dinner last night.  I need to pace myself on this trip.I hope everyone had a great Easter.  More soon.",
        "title": "Win in Virginia"
    },
    {
        "content": "I should have put this in my new post below, but I forgot -- imagine that.  Today the National Alzheimer's Association released its updated facts and figures about Alzheimer's disease.  Here is the linkhttp://www.alz.org/alzheimers_disease_facts_figures.aspIt's pretty amazing.  Also, this week starts a media campaign in print and nationwide media about Alzheimer's.  Hope you get to see some of the spots.And, the book Still Alice which I have mentioned before is getting a lot of press these days.  There was a review of the book in the Boston Globe a few days ago.  Here is the link There's a fantastic article about STILL ALICE in today's Boston SundayGlobe! Here's the link if you'd like to see it.http://www.boston.com/news/local/articles/2008/03/16/despite_monster_she_is_still_alice?p1=email_to_a_friendThis book is great -- get it now.",
        "title": "Alzheimer's Facts and figures"
    },
    {
        "content": "Was in Atlanta and Albany Georgia this week on Alzheimer's business.  I had the pleasure of speaking to a group of Caregivers in Albany.  The group was really great and so many people came up to me afterwards and shared their stories.  It is heartbreaking to hear what everyone has to go through with this disease.  I learn so much from them.  I appreciate them asking me to come and speak.  It always helps me to listen to others that are struggling with the care giving aspect of this terrible disease.You have probably heard about the awful storms that went through Atlanta last night.  They think it was a tornado and the damage is still being assessed.  I think they are fortunate there were not any lives lost in the devastation.I'm still tired from the trip this week.  More soon.",
        "title": "Travel and storms"
    },
    {
        "content": "I'll be off line for a few days.  Have meetings in Atlanta and Albany Georgia this week.I have been thinking about all the young lives we hear of being taken these days.  I guess it is on my mind since the UNC student that was killed was from Athens.  My son is 24 years old and I look back at some of the friends he has lost due to car accidents, hom invasions and suicide.  I don't remember young people dying like that when I was young.  Perhaps it happened and we just didn't hear about it.  It is so tragic.  And, then of course, we have all the young lives lost overseas in the war.  It just makes you want to hug your kids and never let go.This past weekend CBS news ran a story about an Atlanta couple dealing with Alzheimer's.  I'm fortunate to know this couple and the piece was really good.  The husband has early on-set Alzheimer's and is dealing with it with other members of his family as well.  One thing that was striking to me is when they interviewed his wife Trish she said  something to the effect of -- if we sat around and were depressed about this we would be missing out on a lot of quality time together.  Forgive me Trish if I messed this up -- but it is so true.  Time spent feeling sorry for yourself robs you of the good time you have left.  Here is a link to the videohttp://www.cbsnews.com/sections/i_video/main500251.shtml?id=3919714n?source=search_video",
        "title": "A few things"
    },
    {
        "content": "Well -- we just got back from Nashville. We lost in the second round of the basketball tournament which was not very good! It snows about four inches in Nashville last night and getting back to the hotel from the arena was pretty slow going. There was a lot of ice underneath the snow so it was slippery. We waited for the roads to clear before we headed home today. I'm glad we are home -- I'm tired and I have a long week in front of me.Many of you may have heard or read about the young lady that was murdered at UNC in Chapel Hill. She was the student body president and she is from here -- Athens, Georgia. I know her father and I can't imagine what that family is going through. The details of her murder are a little sketchy to me because I have been out of the news loop. She was so well loved and was the valedictorian of her high school here in Athens. What a shame to lose a life that young.More when I get rested and before I leave for Albany this week. Thanks again to all of those that responded, sent comments and emails from the Alzheimer's Assn. post last week.",
        "title": "Back from Nashville"
    },
    {
        "content": "to the hundreds of people who logged on to this blog after reading my story on the Alzheimer's Association website. I'm so glad that people are using the internet to find out more about Alzheimer's.   Thanks, too, for the comments you have left -- I appreciate the feedback.  If you want to leave a comment with your email address I promise to get back to you personally and to not publish your email address.I'd also like to say that if you are in Georgia and around the Atlanta area on April 5th, the Georgia Chapter of the Alzheimer's Assn. is hosting a \"Town Hall Meeting\" for those with early stage Alzheimer's or dementia.  It is free but you must sign up.  Information will be posted on the Georgia website soon so please check it out.www.alz.org/georgia.   These Town Hall meetings have been taking place all over the country and if you check the national website  athttp://www.alz.org/townhall/you can find out more information.Thanks again for reading my ramblings.  Some days are better than others -- so check back often!",
        "title": "Thank you"
    },
    {
        "content": "Many of you are probably aware of Facebook on the internet. For some odd reason, several months ago I decided to see what it was all about. I've known about it for a long time and my son knows some people that work there in California, but I haven't really been able to wrap my arm around the whole concept. I understand it, but I guess I'm not very good at maneuvering it -- I don't do well learning new things!!!One of the aspects is that you can have friends and you have to invite them to be your friend or vice versa. I don't have many friends on Facebook! I feel like the kid who never got picked in gym class! Now granted, people my age don't usually use facebook so they wouldn't be on the system to be my friend. I've asked a few people to be my friend and they haven't responded. And some people, I want to ask to be my friends, but I'm afraid they will say no!!! How is that for rejection -- by cyberspace! I'm still working on it. I am surrprised though by some that are on facebook and I would have never thought they would understand how to even log on -- at least I can do that. I'm going to keep working on it.  My facebook profile is athttp://www.facebook.com/profile.php?id=501222249We are off to Nashville tomorrow to go to the SEC tournament for women's basketball. My husband is going and that helps me a lot. Of course, I have my earplugs handy to handle the crowd noise!Next week I'm off to Albany Georgia for an Alzheimer's speaking engagement. I'm looking forward to it -- I spoke to this group several years ago and they were a great audience and a large one at that. I think back about how my speaking engagements have changed over the years with my message. It's amazing all the I have learned and can hopefully share with others. My friend Carol is going with me to be my traveling companion and I'm looking forward to spending time with her.I had one crown put on last week and it looks likes that might be it and I won't have to have the other one. That's good for me as well as my wallet.",
        "title": "Facebook"
    }
]