[
    {
        "content": "It's New Year's Eve and I'm ready to get life back to \"normal\" whatever that is.  I've been out of my routine for a while with all the things going on over the holidays and I can tell its effect on me.  Now with my husband's accident it is going to be different as well.  It's o.k. as long as my son is home (whichis only for a few more days) but then I don't know how I'll do.  He won't be able to drive for some time and although I can drive around town o.k. -- I only feel comfortable going out in the early morning hours.  It is harder for me to do things when streets and stores become busy so I rely on him for that alot.  I get panic attacks thinking about having to deal with all of this.  I don't mind taking care of him -- but I worry that I can't do it.  I guess we'll have to see how things progress.  He goes to the doctor on Tuesday and we'll see when his surgery is scheduled.Happy New Year to everyone.",
        "title": "New Year's Eve"
    },
    {
        "content": "If you have been following my posts you know that I love to ice skate.  Living in the south that is difficult to do.....there just are not that many rinks around.   There are some in Atlanta so I asked my son if he would go ice skating with me when he came home for Christmas break.  So, we went this morning.  My husband, my son and I went to meet Alan's girlfriend and her family who were going to skate with us as well.About 20 minutes into the ice skating session my husband fell on the ice.  He said he hurt his elbow and we got off the ice to see if he could bend it, if it was bleeding, etc.  It seemed as if he might have bruised it a good bit.  After a few minutes he said he wanted to go to the hospital and have it checked out.  Mind you, my husband doesn't go to the doctor very freely -- so I figured it must have been hurting more than he let on -- he has a relative high threshold for pain.  So, we drove back to Athens (about 45 minutes) to go to our local hospital.  After xrays, it was determined that he broke his elbow.  Surgery now awaits him next week.Many of you reading this may know that many years ago he fell off of a ladder and broke his elbow on his left arm and his wrist on his right arm, both requiring surgery.  After casts were applied, there were no hands available to do the minor things in life and it was a little difficult for awhile.  This time he broke his right elbow and although he is right handed, at least he has a hand free this time -- and that will make life a little easier.You always have to find that bright spot!",
        "title": "Ice Skating goes awry"
    },
    {
        "content": "If I don't get a chance to sit down and write a few words before Monday, I hope everyone has a great Christmas.  Thanks for all your love and support over the years.",
        "title": "Merry Christmas"
    },
    {
        "content": "As we head toward Christmas it seems as if there are always a lot of loose ends to tie up.  But I guess that is the way this goes isn't it.  It's a little harder for me to get to some of those things but I keep plugging away at it.My son gets home this week and I am going to see if I can get him to give this page a new look.  After several years it needs a face lift.I worry about a lot of things these days.  And I am worried about those climbers out in Oregon.  I don't know them but I am so worried about them --one has been found dead and I fear for the others.  I can't imagine what their families must be going through.  I'm almost obsessed about it -- wanting to check the news all the time to see if they have been found.I got to ice skating this past weekend in Savannah.  There were way too many kids on the ice and it was extremely loud so of course that was a problem, but at least I got to skate.  I hope that when Alan is home I will get to skate again.Lots of friends to see this week.  That is a good thing.  Fortunately these are people that I get to see all the time.  I feel good about that -- that these are \"fair weathered\" friends if you will.  It's nice to have these people in my life.  I wish some of my friends in Illinois were closer as well as my family so I could see them more often.  I know they know that they stay in my thoughts all the time.I know this post kind of went from topic to topic.  My mind is jumping around a lot today. That's why it is titled \"This and That\".",
        "title": "This and That"
    },
    {
        "content": "Well, it is just a few short weeks until Christmas.  Although everything is decked out for Christmas, it doesn't seem like Christmas to me. That is probably because it is so warm here.  It gets cold here in the south occasionally but it doesn't stay cold.  But it is suppose to be 70 degrees here today.  And, through next week in the 60's.  I'm going to Savannah tomorrow for a couple of days and it will be even warmer there.  Hopefully, by the time the 25th rolls around it will be at least in the 50's?  Here's hoping.Plus, it really won't feel like Christmas until our son comes home.  That will be next week and then maybe it will help liven up the season.",
        "title": "Holiday Time"
    },
    {
        "content": "is scheduled for tonight, Wednesday December 13th. The story is to be on Early On-Set Alzheimer's. I'm so pleased for all this media attention. Help me again by thanking the media for the coverage. There was also a story last night about Alzheimer's disease in general. CBS' email address ishttp://www.cbsnews.com/htdocs/feedback/fb_news_form.shtml.",
        "title": "More coverage on CBS News with Katie Couric"
    },
    {
        "content": "is running a feature tonight (12/11) on Early On Set Alzheimer's disease. Please catch it if you can and let NBC news know that you appreciate their coverage. They can be emailed atnightly@nbc.com. CBS is also working on some coverage of this as well. The National office of the Alzheimer's Assn. in Chicago has been behind all this publicity and it is great. The more we get the word out, the better the understanding of the disease and the bigger push to find a cure.",
        "title": "NBC Nightly News"
    },
    {
        "content": "Every year we say that we can't believe it is time for Christmas again.....but come it does.  I am one of these people that shop all year round, but now I forget what I buy so it makes it harder!  I've started keeping lists, but then I forget to put things down on my list!  But, in the end, I don't think anyone will be forgotten and if they are, they will certainly understand.I'm anxious for my son to be home.  He's coming in later than usual this year, and it will seem as if Christmas is a bit rushed.  However, he is staying until after the first of the year so we will still be able to have time together.  That time becomes more and more valuable to me.The shopping crowds are a bit too much for me, so it is a good thing I do shopping throughout the year.  Panic attacks set in rather quickly these days and all those people are just a little overwhelming for me.The cold has gripped the South today and will be with us for a few days.  Being a native midwesterner I miss the cold and snow sometimes.  Having 60 and 70 degree weather in the winter just doesn't seem right.",
        "title": "Holiday Season"
    },
    {
        "content": "Has this article on their website today.  This issue will be on newstands next week.  It's a good read.http://www.usnews.com/usnews/health/articles/061203/11alzheimers.htm",
        "title": "US News and World Report"
    },
    {
        "content": "It's gift giving season and it's hard to know what to buy some of my friends and family.  I know some of my family members are having a hard time buying things for me......but when it comes right down to it.....I don't need anything.  If I want something I usually go and buy it.I say I don't need anything, but then I do.  I need time.  I don't know if \"time\" is considered a \"thing\" or not, but just the same I need time.Time to spend with my family.  Time to spend with my friends.  I realize how precious that time is as my disease progresses and that is what is so valuable to me.When we are babies time is inconsequential.When we are children, time doesn't seem to go by fast enough.When we are teens, it seems like forever before you turn 16 and get your driver's license.Then it is an eternity waiting until you turn 21.After that, those big birthdays that end in \"0\" come all too quickly.Suddenly, you turn around and wonder where all the time has gone.Time, spend it wisely.  You never know when you are going to run out.",
        "title": "Time"
    },
    {
        "content": "Well, Thanksgiving is over.  We had a nice dinner with friends and it was very relaxing.  It's always nice to eat someone else's cooking for a change.  But, I've eaten way too much and have to get back on the wagon so to speak.  I'm trying not to gain too much weight this holiday season.Shopping is becoming much more difficult with the crowds.  I have panic attacks so bad with large crowds that I really need someone to go shopping with me.  It is funny because I can go to a large sporting event and it not bother me as much, but I think it is because for the most part people are sitting down and not milling around.  Being the midst of a large crowd going every direction scares me and I need someone with me.  I guess it is a good thing I can buy things over the internet.  It is much less daunting to me.My nephew in Illinois got engaged over the holiday weekend.  He and his girlfriend were on a trip to Ireland and he proposed \"across the pond\" if you will.  I haven't heard all the details yet and I haven't met his intended but I'm really happy for him.I hope everyone had a good holiday.  More to follow.",
        "title": "Craziness"
    },
    {
        "content": "to everyone.  I appreciate all your support this year and am thankful to call you my friends.  As we all think about the holiday gift giving season, we all need to remember that friends and family and the some of the best presents we could get.  And sharing time with those friends and family is a better present.",
        "title": "Happy Thanksgiving"
    },
    {
        "content": "Before I retired, I was the director of a performing arts theatre.  It was very stressful and I worked long hours.  I had to deal with agents, promoters, tour managers, tour accountants, groupies, roadies and of course the talent itself.  Sometimes working with these people was fun, sometimes it was a nightmare!  But sometimes the most interesting people I dealt with were the fans themselves.  I really came to understand the word \"fan\" as being \"fanatical\".  There were all kinds -- good, bad, weird, obsessive, good natured and fun.  I could go on and on about the fans I have met over the years.   When Bob Dylan came to play at our venue the fans were extremely strange.  We had lots of gifts, flowers, letters, etc. that were sent to the venue to give to Mr. Dylan.  The rock groups had their groupies.  We had to do a lot of homework when an act booked with us to see what the fans were like and what we had to expect during the days and nights leading up to the show.Which brings me to \"Thelma and Louise\".  Back in 1997 we booked Kenny Rogers for one of his Christmas Shows.  I received a phone call from two ladies that live in Stone Mountain Georgia.  They told me what big Kenny Rogers fans they were and wanted to come over to the look at the theatre so they could \"pick out their seats\".  Our venue was relatively new at that point so many people were not familiar with the layout of the theatre.  My first thought at the time when I was talking to them was, \"I just don't have time to show two women the theatre so they can \"pick out their seats\".  Besides many of our seats were pre-sold to season ticket holders and these women didn't have a chance of being able to \"pick out their seats\", because the ones that they wanted would probably already have been sold.  But after talking to them for awhile, I relented and told them to come over.  They lived a little over an hour away and we made an appointment for them to come visit me.When they arrived, they turned out to be more than a typical fan -- these ladies in their late 40's early 50's were true fanatics.  They are sisters and they told me that they had been to over 500 of Kenny Rogers' concerts.  They were also going to be buying close to 100 tickets (or more) because they had so many people from Stone Mountain that wanted to come with them that they needed to accommodate them.  They were renting buses and making this a grand affair.  They also wanted to feed these people in one of the banquet rooms adjacent to the theatre. At the time, Kenny Rogers had a chicken franchise called Kenny Rogers Roasters.  There was one in Athens and the women wanted them to cater this dinner prior to the concert.  So, what turned out to be a meeting with these two women to \"pick out their seats\", became a big sale and a catered dinner.   On top of that, TNN, The Nashville Network, called me to tell me they were doing a piece on these two for one of their shows and wanted to come to the center and video tape them at dinner and at the concert. So, we got a little press out of it as well.I really enjoyed meeting them and their zest for life.  Their enthusiasm for Kenny was a  little over the top to me, but that is what being a fan is all about, right?Needless to say, while making all the arrangements for this trip, the ladies and I became fast friends.  I really enjoyed working with them and they always made me laugh.  But they had this passion that I had not seen in anyone for a long time.  I started calling them \"Thelma and Louise\" -- just because of their zest for life.  The funny part was that they didn't know who \"Thelma and Louise\" were.  So, they went and rented the movie.  They called me in horror after watching the movie and said -- \"But Kris, we didn't kill anyone!\".  We all had a laugh and they have been forever, Thelma and Louise.  Now they fight over who is Thelma and who is Louise.All of this took place about ten years ago and these two women have stayed in my life.  I've gone to two Kenny Rogers' concerts with them, met them in Las Vegas when they were there seeing Kenny and continued to keep up with many of their trips.  I could go on and on about them and you would laugh along with me -- they are so great.  To date, they have seen 963 of Kenny's concerts and expect to be at 1,000 by next summer.  And yes, they both have jobs, so arranging all the travel and tickets, etc. for each of the concerts is a lot more work for them.Their mother had dementia so when I was going through my diagnosis, Thelma and Louise were right there for me.  And, continue to be.  Today, my husband and I are driving over to have lunch with them.  I haven't seen them in quite awhile but we keep up with each other.You never know who is going to play an important part in your life.  Thelma and Louise will always be in my heart.",
        "title": "Thelma And Louise"
    },
    {
        "content": "We made it home from California last night. It was a short trip but it was nice to visit Alan and his girlfriend Jennifer. I don't travel as well as I used to but I have this week to rest up. We had great weather while we there.One day we went into San Francisco and it was a holdiay -- Veteran's day -- so there were many more people in the crowded shopping area and park we were at than normally would be for that particular day. The schools were out so there were lots of kids in the shopping mall areas. We went to a new place in town that just opened up and it is an entertainment/shopping district that had an ice skating rink. You all know how I like to ice skate! But, there were way too many kids on the rink for me to feel comfortable -- if it had been an average day I would have been out there in no time flat. But, it wasn't to be. I don't usually miss an opportunity to ice skate. Being in large crowds is hard for me and I need to be sure that I stay close to whoever is with me. Panic attacks usually hit me in these types of situations, but I got away with not having one. I was glad to get back to the hotel though that night.More soon after I have rested. The photo at top is of us at a winery in Napa Valley. Alan's girlfriend, Jennifer Lee is in the photo with us.",
        "title": "Home but tired"
    },
    {
        "content": "We are off to California to see Alan tomorrow. He was going to come home for Thanksgiving but airfares and schedules didn't work to his advantage. So I'll blog when I get back.Here's a photo of my team from Memory Walk. I'm real proud of them! We raised over $7,000 and the total for the Walk is over $62,000 and we are still counting.",
        "title": "California or Bust"
    },
    {
        "content": "to all who walked in the Memory Walk yesterday.  It was a great success.  Weather was great, lots of people and we exceeded our $50,000 goal.Thanks too to Barbara for her wonderful comment she left on this blog.  What a great idea to bound your letters for you and your husband.  I know that project gave you as much joy as it has me.I'm tired from the walk.  More soon",
        "title": "Thanks"
    },
    {
        "content": "Our Memory Walk is tomorrow.  This year I have taken a much less active role because I knew that I couldn't do what I used to be able to do.  It is way too much stress for me now -- I think I am finally learning my limitations although I don't always listen to myself!  But I knew that it was time for someone else to take over the reigns of the Memory Walk.  And, the lady that we have had chair our walk this year was outstanding.  She has worked tirelessly for the cause and she is really to be commended.  I appreciate all the things she is doing so much, I can't express it enough.  It's a big job to do and she has totally embraced it.  Thank you -- Eve -- for all you have done.  Hopefully, I can post some photos after tomorrow's walk. Thanks to all that donated.  We will definitely reach our goal for this year's walk of $50,000.",
        "title": "Walk"
    },
    {
        "content": "I think my husband and I have become officially \"old\" people.  The reason I say that is it that every day it seems we are saying \"remember when\".  Whether it is something my son used to do as a child, what we did in college or as children we are bringing up the past.  Yesterday I was telling someone how in college we used to go \"Trick or Drinking\" on Halloween. That was certainly a long time ago!But, at least I can still remember a lot of these things -- recent things, not so much.One thing I enjoy doing every year that hopefully will bring back memories for my son, is my annual letter I write to him. Every year on his birthday (his birthday was a few weeks ago) I write him a letter.  I started this on the day that he was born.  For some reason in the hospital I this desire to write him a letter to let him know what I was feeling that day.  I don't know why but the urge was so strong I just had to do it.  I wasn't sure at the time what I was going to do with the letter but I wrote it and tucked it away in my things when I went home from the hospital.  A few weeks after he was born I found it and re-read.  I sealed it in an envelope and thought I would put it in his baby book.On his first birthday the thought occured to me to write him another letter, so I did.  I sealed this one up and put it with the other one.  Then I realized that this would become my tradition, each year I would write my son a letter on his birthday.  My thought at the time was that when he turned 21 I would give them all to him.Each year, I look forward to writing that letter come October.  I write things down over the year that I want to include in it, gather some photos from the year and any newspaper clippings or whatever I might want to include.  They don't always make it to the final letter but I enjoy collecting these items as the year goes on.  When he was smaller, I used to write all of his milestones down and tell him what I thought his future would hold for him.  This experience is really an emotional one for me because I usually pour my heart out and tell it like it is.  As he has gotten older, I chronicle his accomplishments -- but of course he will remember those on his own, but I want him to know how he makes me feel.Since my Alzheimer's diagnosis these letters have become much more important to me.  Although I started scrapbooking after my diagnosis to help me remember as well as share what I could with my family through photos, these letters will hopefully mean much more to my son later on.He's 23 now and there are 22 letters waiting for him.  I skipped a year and there is a reason but I won't go into that.  Obviously, I didn't give the letters to my son when he was 21.  I'm not sure when he will get them -- my first thought is upon my death.  But when my disease gets to the stage where I can no longer remember him, perhaps that will be the time he can read them -- while I'm still with him, but not at the same time.",
        "title": "Memories"
    },
    {
        "content": "We are a week away from out Memory Walk here in Athens.  It is a little later than usual but that is because of the UGA Football schedule.  We have to work around football -- we either have to do it on an away weekend or an off weekend so November 4th was picked.  Georgia plays Kentucky in Kentucky that day.  But, because all groups have to work around the UGA football schedule, there are lots of events that happen on the same weekends.  We have stiff competition from the Heart Walk that weekend.Anyway, there is still time to donate.  My personal goal is $3,500.00 -- and I'm close -- just need a little help from my friends.  You can donate online by clicking here and following the prompts.......https://www.kintera.org/faf/donorReg/donorPledge.asp?ievent=160213&lis=1&kntae160213=DEB6C0D2006F40EEB471A6DB11D8D104&supId=9079347",
        "title": "Memory Walk"
    },
    {
        "content": "I have had the hardest time coming up with words lately.  Usually this happens when I get tired but yesterday I couldn't think of the right words for things most of the day.  When I get stuck, my husband will ask me \"what does it do?\" \"what do you use it for?\" or \"what does it look like?\" -- which doesn't help at all -- it just makes me more frustrated.  I was on the phone last night with my son and couldn't remember some words and it is even harder for me when I am on the phone because I know the person can't see me struggling to find the words.  A lot of times, I just have to quit talking and come back later to it -- if I remember!",
        "title": "Words"
    },
    {
        "content": "I know I have written here before about how frustrating it is for me to play tennis these days.  I lack the concentration for it.  And, tennis is probably about the only thing in life I have ever had a true passion for.  Yesterday, one of our Memory Walk teams in Athens held a tennis tournament to raise funds for the walk.  Of course, I had to sign up and my husband I played in it.  Of course we didn't win -- but my frustration with it was very upsetting to me.  First of all I forgot my earplugs.  The noise from the surrounding courts bothers me and to make matters worse, we played at a local high school and their football team came out to practice just at the same time we started to play.  So not only did I have to deal with the tennis court noise, I had the students making noise and the coaches whistles blowing all the time.  And, I think that my frustration came from not the fact that I couldn't play well, but that the reality struck me that I probably shouldn't play at all.  Giving up something like tennis for me is difficult.Another frustrating thing is that my oldest brother is not well.  He has diabetes and we think the start of Parkinsons.  He won't seek medical attention in spite of our best efforts.  He obviously has a death wish -- or so it would seem.  We all feel very helpless. I feel even more helpless living so far away.  He won't listen to his family.  We know he is depressed and it hurts us deeply that he won't see a doctor about the things that he can do something about -- his depression and his diabetes.  He was diagnosed with diabetes a couple of years ago and refuses to take medicine or watch his diet.  His eyes and his feet are in bad shape and it is a shame to see him do this to himself.  How frustrating.",
        "title": "Frustration"
    },
    {
        "content": "My husband and I just returned from our first \"seniors\" trip.  It was to the Greenbrier Resort in West Virginia.  It was just beautiful.  I have always wanted to go there and knew that we could never afford to go on our own.  So when some friends suggested it I jumped on the chance.The fall colors were at their peak in some areas and it was just breathtaking.I did o.k. -- got tired earlier than I should have.  I ate too much, didn't sleep enough so I got off my routine.  But all I had to do was to follow people around all the time, so I did o.k.  It's was so nice to have it all arranged for us.  When we go on vacation we probably argue more about where we are going to eat than anything else.In a few weeks we are planning a trip to see the kid in California.  He was coming home for Thanksgiving put the airfare and scheduling didn't work.  So we will have our Thanksgiving early I guess.Since I'm pretty tired I am going to stop for now and more soon.",
        "title": "A Few Days Off"
    },
    {
        "content": "Yesterday, I went to a funeral in a Catholic Church.  I wasn't raised Catholic and I always feel awkward when I go to a service in the Catholic Church because I don't know what to do and to say at the appropriate times.  My husband was raised as a Catholic but gave it up long ago.  I was raised as a Christian Scientist and gave that up long ago.  But one thing I realized when I was at the mass yesterday was that I miss going to church.  I also realized how much I missed singing the hymns.After our son was born, I asked my husband if we could shop around for churches as I thought it was important to bring Alan up with some understanding of the religious world -- if for no other reason than for him to be able to decide for himself later on what was right for him.  I wanted us to go to church as a family and be a part of a church.   But for various reasons, we couldn't agree on a church and that hope of mine was not fulfilled.However, I found a church that I enjoyed attending and did so for awhile by myself.  But the problem I found was that in the south you don't just \"go to church\".  Church becomes you. When I would go to this church I would see people that I knew and they were constantly asking me to \"come to Sunday School\", \"come to my Bible Study group\", \"come to a church dinner\", etc., etc. I didn't want to do all that stuff -- I just wanted to go to church on Sunday morning and listen to the service.  When I explained that to my well meaning friends I think they understood and they let up for awhile but then they were back at it again.  I felt bad always having to say no and as a result I stopped going to that church.  It was the same with some other churches that I attended briefly.I'm not a deeply religious person but I do believe in certain things.  If you live in the south and don't belong to a church you are certainly an outsider.Switching topics -- Since being diagnosed I have become aware that I am much more emotional now than I have ever been.  The littlest things can bring me to tears.  I have attended several funerals lately and although I didn't know the deceased very well (knew their spouses better) I was overwhelmed by my emotion. Things on tv get me stirred up to.  Perhaps it is at those times that I realize how much we take life for granted and we shouldn't.  I thought I had come to realize that -- but it is probably a good reminder.",
        "title": "Religion"
    },
    {
        "content": "My birthday was yesterday -- and amazingly -- I didn't wake up to a Red Miata sitting in the driveway.......or a new screened in back porch......or tickets for me and my family to go to Australia. Go figure.But I did get lots of calls and emails from friends and relatives.  And, of course, Alan was home for the weekend and that is the best present of all.  I cherish time with friends and family so much these days.  But now I'm tired....just a little gets me off my routine and I haven't had a nap in two days.  I know that sounds like something little to most people, but I have such bad days when I'm tired.  I really need to do better about those naps.I certainly notice a big difference in not only my reaction time to things, but memory and lack of concentration.  It's days like this that you do stupid things and then it makes you feel stupid.  It is sometimes hard to distinguish the two -- that you really aren't stupid, you just do stupid things sometimes.",
        "title": "Birthday/Friends/Relatives"
    },
    {
        "content": "It's very early on a Friday morning.  My husband has just taken off to get my son at the airport as he is visiting from California for a very short weekend.  I'm anxious to see him although it has only been about a month since I last saw him.  But I realize how precious my time is with him and savor every moment we have together.He is interviewing for jobs in Atlanta and Washington DC for the summer.  At least that means he might be on the East Coast this summer.I always worry about how different I might seem to him each time I see him.  It's hard on all of us but I suspect in some ways harder on him.",
        "title": "The weekend"
    },
    {
        "content": "For those of you suffering with Early On-Set Alzheimer's or are caring for someone with it, there is a new message board on the National Alzheimer's Assn. website for us.  You can access it by going towww.alz.org.  We all need to stick together and this will help all of us.  Thanks to the Association for doing this.",
        "title": "New Message board for Early On-Set Alzheimer's"
    },
    {
        "content": "I have lots of \"thank you's\" for this week.Thanks to all of you for responding to my \"Call For Action\" last week as stated below.  I really appreciate it.Thanks to the Georgia Alzheimer's Assn. for the special greeting they sent me last week.  These folks are a great group of people.Thanks to all that have contributed to the Memory Walk this year.  But if you haven't, there is still time -- you can click to the left of this blog and find a link.Thanks too, for all your comments that all of you have left on my blog.  Many do not get published for everyone to see for various reasons, but I see them all and they are very inspiring to me.I'll save the rest of my \"thank you's\" for a time around Thanksgiving!On a few other notes, I would like to say that the interview with our family that was done as part of a series for CNN is scheduled to run this Friday, October 6th.  It will run in Headline News and is schedule to run once an hour from the 1:00 p.m. to 6:00 p.m. The Healthy Minute segment usually runs about 8 minutes after the hour.  There will be four Healthy Minute segments dealing with Alzheimer's in all and the other one that has my family in it will run on November 6th.   I'll be encouraging you all to contact CNN after they run as I did with the NBC piece.The National Alzheimer's office asked me to come to Washington to speak at a meeting that would include the FDA and some of the pharmaceutical companies.  Alzheimer's drugs was the topic.  I had to decline the invitation because of a trip we have scheduled to California to see Alan and it is also just a couple of days after the memory walk.  I really hate it when I have to turn down a request like that because it is so important to me.  I feel like I have let them down by not being able to do this, but my stamina isn't what it used to be.  When I'm tired my brain doesn't work right and it gets to be too much for me.  I appreciate them asking me and I know they will find someone else to do this, but I am disappointed I can't do it.  It's always been hard for me to say \"no\" to things, but I think I am finally realizing my new limitations and I don't like it so much.",
        "title": "Thanks"
    },
    {
        "content": "OK everyone, I'm asking you for a favor.  Yesterday, the Today Show on NBC ran a story about Alzheimer's.  The main message was the current research and where we stand on a cure, early detection and current drugs on the market.  If you didn't see the piece here is the linkhttp://www.msnbc.msn.com/id/3032633/?ta=y. Hopefully, that will work.  If not, go towww.MSNBC.comand click on the Today Show.What I would like to ask of you is to email NBC and thank them for running the piece.  It doesn't cost you anything and it just takes a few minutes.  We need more stories about Alzheimer's running on the airwaves and if people take just a minute to let the news organizations know that we want more info out there it will help.  The address isToday@nbc.com.During the month of October CNN is going to be running four one minute segments on Alzheimer's during the Headline News.  They are the \"Healthy minute\".  My family and I are featured in one or two of them as well as some the experts in the field of Alzheimer's research.  This started out being only one \"one minute\" segment, but because the information was so good they are doing four different segments.  Yes, it is only one minute -- but it is CNN.  The segment will be broadcast several times during the day.  The first one is scheduled to air on October 6th.  I will let you know when the others are going to air.  But, I'll be asking you to do the same -- after they air to email CNN and thank them for the coverage.I would appreciate everyone helping me do this.  We can all make a difference.  Thanks!",
        "title": "Call for Action"
    },
    {
        "content": "I've always enjoyed sports.  Growing up there were not too many opportunities for me to play competitive sports because Title IX wasn't in effect back then -- guess that shows my age!  But, I'm not sure if I would have done it even if it were.  I enjoyed the \"backyard sports\" as well as tennis and golf.  Having two brothers around the house who devoured sports and statistics as well as having rivalries between their professional sports teams, sports always seemed to be a part of my life.Nowadays, I enjoy watching sports on tv and of course the weekends give me many opportunities to watch a number of sports.  I find it is more difficult to keep up with them these days -- I'm glad most of the stations keep the score on the screen all the time, because sometimes it is hard for me to remember who is winning.  Plus, I'm kind of bad about switching to different channels to watch different games so it is harder to keep up.  But at least I can still enjoy them. Attending large sporting activities has also become more of a problem.  All the noise, the crowds get me confused.  I wouldn't go it alone these days that is for sure.",
        "title": "Sports"
    },
    {
        "content": "The Dementia Care Conference was great.  A little overwhelming, but great.  I've worked with three people for the last eight or nine months -- Dr. Scott Roberts from the University of Michigan, Michelle Barclay with the Alzheimer's Association in Los Angeles, CA and Kristy Klein with the National Alzheimer's Office in Chicago.  It was nice to finally meet Scott and Michelle and to see Kristy again.  They were all wonderful to work with and helped me along in the process.Although the conference was geared to professionals in the field of Dementia Care I learned more than I thought I would.  A lot of emphasis was given to early stage dementia and those attended seemed to want to know more.  It's just a baby step in this disease.But it was exhausting.  It has taken me a couple of days to feel my feet under me again.  The day I came home from Atlanta it was pouring down rain and the fog was awful.  It took me two and half hours to get home (normally it takes one and half hours) and I was white knuckle driving the whole time.  When I got home I felt wasted.  I was tired and pretty non-communicative to my husband.  Yesterday wasn't much better -- I felt like I was in a comatose state most of the day.  Needless to say these last two days have not been \"good days\" for me.I stayed in Atlanta for three nights.  The conference was at the Westin and it was so nice that when I was feeling tired I could go up to my hotel room and retreat to the quietness of it.  Coming home on Wednesday I actually felt annoyed that there was someone else in the house (my husband) and he was invading my \"silence time\".  It was so hard to come home to \"noise\". I got to the point where I was feeling mad at my husband and it wasn't his fault.  Those of you that know my husband know how quiet it is.  It was just that I had gotten used to the sereneness of my room and no distractions.  When I got home the noise of the television, the sound of my husband's voice and even the meow of my cats was getting on my nerves and making me very agitated.  I finally had to seek some quiet time in another part of the house, and then rested as well.   This seems like such a silly thing, but it is so upsetting to me.   I'm getting used to the noise around the house again.  I'm glad I don't have a lot of kids around or dogs barking all the time!Well, I have rambled on enough for now.  More soon.",
        "title": "The Week That Was"
    },
    {
        "content": "I'm off to Atlanta for the National Dementia Care Conference for a few days.  I promise to post when I get back.",
        "title": "Dementia Care Conference"
    },
    {
        "content": "I hope everyone got to rest up a little on this holiday.  Our day was filled. CNN came to do an interview with my husband and me for their \"Healthy Minute\" segment.  It stems from the National Conference that I have been working on for the National Alzheimer's Association.  The conference is next week in Atlanta and many professionals in the field of Alzheimer's will be there to share their work, their research and their experiences.  CNN will be talking with some of the doctors there as well.  Early On-Set Alzheirmer's caught their eye and that is what the piece will be about.  Judy Fortin is the reporter.  I'll let you know when it airs and I would encourage everyone to email them after it is over to support their exposure to the disease. We need more of this!Tomorrow I am heading over to Atlanta to shoot some Public Service Announcements for this year's memory walk.  The walks are starting all over the country this month and will go through November.  I know I have discussed them here before, but, if you are reading this, you have some interest in Alzheimer's.  I'd like to encourage you to walk or donate to the cause.  More information can be found by clicking on one of the references to the left of this post.  OK -- I'm done with all of that for now.I think I have rested since the trip, but already with things going on this week it is overwhelming.  The conference is next week and then perhaps I'll be able to get back to my routine.  My panic attacks continue to be bad -- but I have put myself in situations that make them worse.  Fortunately, I've had someone with me most of the time, and it doesn't seem to be as frightening when someone is there.  I have to be better about not getting myself into these situations.My son starts his second year of law school tomorrow.  In about 4.5 months he'll be able to say he's half through! He was fortunate to make the Stanford Law Review so he will be kept busy by that this year as well as his school work.On another note -- I recently read an article on Michael J. Fox and his struggles with Parkinson's Disease.  I have read many, but this one was especially poignant to me.  I so admire what he is doing and speaking out on behalf of himself and others with the disease.  He has been able to reach so many people with his message and raise quite a bit of money for his cause.  I certanily wish him well as his Parkinson's progresses.",
        "title": "Labor Day"
    },
    {
        "content": "We made it back from Seattle late last night. We are exhausted. But, we had a good time. It is always great to spend some time with my son. He drove up from Mountain View California so he was our \"driver\" all week. However, I have decided that if he doesn't make it as a lawyer he could certainly be a taxi cab driver in New York City.....he drives like one!The photos above are from Mt. Ranier.  It was so beautiful.  The weather was great that day so we were able to see the full view of the mountain.  As we got ready to leave the clouds started rolling in.It was nice to get away but it is getting more difficult to travel. I really get tired and I try to \"stay up\" with the group but that doesn't always happen. One day I just had to let my husband and son go out and do things on their own because I wasn't up to it. I had a few panic attacks and it just becomes overwhelming. I feel like I am the ball in the ball in chain when we go out because I'm usually the one holding everyone up.It will take me a few days to get back into my routine and I certainly missed it. I'm much more comfortable at home now.More after I rest up.",
        "title": "Back at home"
    },
    {
        "content": "in the morning for Seattle.  I promised to blog before I left. I had planned to write a lot but our computer has been down and it is late so this is going to be short.  I'm very anxious about the trip.  I've had panic attacks all day and couldn't do the simplest of things!  It is so frustrating.  I hope I will be better when I am there.  I know I'll be all right because I have my family with me --that's a good thing.  More when I return.",
        "title": "Leaving on a jet plane"
    },
    {
        "content": "I've been bothered a great deal by panic attacks this week.  They seem to come and go.  And, I haven't seen a pattern for them this week at all. But, they do stop me in my tracks and the only place I feel comfortable is at home.I've been trying to stay to my routine as much as possible.  One day this week, though, it was time for me to go to the gym and the panic attack was so bad I had to stay home.  Luckily, I know I am not going to die from them, but they are certainly annoying.Perhaps I am getting a little anxious about a trip we are taking next week.  We are headed out to Seattle to catch up with my son.  He is driving up to Seattle from Stanford and we are going to have a week together.  I don't do well traveling these days and perhaps that is in the back of my mind.More before I leave --I promise.",
        "title": "Panic Attacks"
    },
    {
        "content": "I had a strenuous \"mind week\" if you will.  Was working on a lot of things for the Memory walk and I also decided to tackle a jigsaw puzzle.  If you've read my posts before you know that I say never to give a jigsaw puzzle to an Alzheimer's patient (at least me) because it is so frustrating. But, I felt pretty good and I had one in the closet and I decided to try it.  Talk about a brain drain!  But I did finish it and I was totally exhausted.  I couldn't believe how much it took out of me.  After finishing it up on Thursday, I went to a Memory Walk meeting with my husband.  It was at a restaurant that was very noisy.  I could barely get through the meeting and meal because of the noise and just being mentally tired.  I kept forgetting what I was saying, was confused and just normally not doing very well.  I'm glad my husband was with me because I'm not sure I would done very well getting home.That night I had a dream and in it I had Alzheimer's.  Alzheimer's has never manifested itself into my dreams.  I thought it was interesting that that night it did.  I've always been this \"normal\" person in my dreams.   I hope that doesn't keep reoccuring because it is nice to know that when I go to sleep and dream I don't have this.",
        "title": "The week"
    },
    {
        "content": "Over the last few days I have come across several people who are dealing with denial issues in regards to Alzheimer's.  Some are dealing with denial over themselves having the disease while others are dealing with denial from their family members.I can understand the denial from the person with Alzheimer's much more than I can with the family.  Now I realize that there is always some sort of denial in the beginning, but when it is taken to the extent of denial in not helping the person with Alzheimer's because they don't believe they have the disease -- that is a little harder to take.My family has said that I never went into denial.  I think I probably did, but if I did it wasn't for long.  What is the point?  If you have a disease what is the reason for denial?  Deal with it.  Find out what you can do and live the rest of the life you have.  We always say life is too short and when you are in denial it is even shorter, because you are not enjoying the time you have with your friends and family.  Besides, it takes too much effort (for me anyway) to be in denial.It's hard to ask for help when you are in denial -- and trust me -- with Alzheimer's you need help. I don't like to admit that I do, but as each day, week and month passes I need more help.  I don't like it -- but I'm learning to deal with it.",
        "title": "Denial"
    },
    {
        "content": "I know it is hot all over the country and I don't know if that is the reason I have been so \"out of it\" lately or not.  I just haven't felt like doing anything lately (including writing in this blog).  I feel lethargic and lazy.  I know that everyone wants to blame the weather on everything , but because I can't think of any other excuse, that's what I'm going to do too!",
        "title": "The weather"
    },
    {
        "content": "As I get to know more and more people with Alzheimer's I find there are more and more blogs cropping up out there.  I'm glad that is the case -- those of us that can speak about the disease need to.  The latest one I found was a gentleman named Don Hayen.  His blog can be found herehttp://thetripover.com.  I've asked my son to put a link to it on this page so you can refer to it later if you would like. Don was recently diagnosed and shares some of his trials and tribulations.  I've noticed that since he is just starting this blog that some of his observations are the same as mine have been -- he's just putting it into different words.  And, the longer I write this I realized that you always don't want to hear about my problems with Alzheimer's -- I don't like tothink of them myself sometimes.  So, I haven't been speaking of them as much as of late.  But I'll get back there -- I need to -- because so much more needs to be said.In reading Don's blog though, I find it interesting at some of the comments.  One lady wrote about a relative that could figure certain things out but not others.  She said something like it was interesting he could open up some files in his brain for some things and not for others.  That is so true.....I'm always amazed at how I know how to do things but I can't do them.  Like I know what has to be done, but I can't put the actions into an order to make it happen.  Like getting a meal together sometimes.  I know exactly what needs to be done, but I can't get there.  Our brains are interesting parts of our body!!!",
        "title": "New blogs"
    },
    {
        "content": "Over the last few days we have had some visitors.  My great niece visited for a day and my friends Pody and Rick from Illinois. It was great to have them here.But now I am ready to get back to \"normal\" if there is such a thing anymore.  All of our company for the summer has come and gone and we don't really have much planned until we head out to Seattle to catch up with our son for a week's vacation.  I think I am ready for some down time.  I don't really realized until after the fact how tired I can get.  It takes me a lot longer to get back to my routine.  For a few days I will notice some problems with my Alzheimer's and have many more \"Alzheimer's moments\" but we have come to expect them and can live with them.  We always have little \"surprises\" but nothing we can't deal with.Lots of things are happening on the Alzheimer's research lately.  Some scientists in Australia claim they have found a \"cure\" .  The following is a quote from a recent article that was published in Ireland --Scientists in Australia have developed a once-a-day pill, which they claim may cure Alzheimer's disease. Human trials of the drug - PBT2 - are to begin next month.The breakthrough was made by a team at the Mental Health Research Institute of Victoria. The drug stops the build-up of amyloid, a protein which is widely accepted to be a major cause of Alzheimer's.\"This is a major breakthrough. Though much depends on the next phase of human clinical trials...early results indicate this drug offers hope to people with Alzheimer's disease\", said Prof George Fink, director of the institute.Early clinical tests involving animals indicate that the drug is fast-acting and is capable of suppressing the impairment of memory function that arises as a result of the disease.According to Prof Fink, PBT2 could prevent Alzheimer's from developing or delay the onset of the disease for many years.He added that pending further trials, the drug could be on the market within four years.Wouldn't this be a great thing?",
        "title": "Visitors"
    },
    {
        "content": "Many of you probably know that President Bush is set to veto the recent bill about Stem Cell Research.  It will be his first veto of his administration.  I know we all have our thoughts about this, but my view is that we need it.  Not only to help with Alzheimer's but a host of diseases.  I'm disappointed in his decision.It's hot here in the south as it is all over the country.  It's kind of hard to get motivated to do much.  We have company coming in a few days. First my great niece who is ten years old.  She is down this way visiting her father and we will catch up with her over the weekend.  Then my dear friends Pody and Rick from Champaign IL will be here for a day.  These fine folks are the ones we went to visit last year in England.  We have such fond memories of the trip -- it just seems like yesterday we were there.Healthwise, I haven't had the best of days lately.  I try to get through them one day at a time.",
        "title": "Stem Cell Research"
    },
    {
        "content": "As I was thinking about what to write, I thought of several titles, but then when it came to actual type it, I couldn't figure out which one to use.  So, that is why the title is what it is.As my post below indicates, I have been dealing with some other stuff lately.  Mainly that has been somewhat of a different kind of health scare -- it isn't over yet, but I am trying to remain optimistic about it.  The first few days I was dealing with this the stress that it was causing me was making my Alzheimer's much worse and I realized I needed to do something to try not to worry so much.  It was hard, but I tried to find other things to occupy my racing mind.  I am also upset that my son hasn't taken this recent development very seriously.  That's quite uncharacterstic of him.  But that is a whole different issue.I was able to get away for a day or two though and went to South Carolina to play golf and just relax.  It is definitely what I needed to help clear my head a little.  And, my brother is visiting from Illinois -- he is here because his work brought him through this part of the country and although his visit is short, it makes me feel better.In a week or so my friends from Illinois that were living in England in the fall will be visiting. It will be nice to see them as well.  That's a great things about family and friends --they can certainly give you a boost when you need it the most.",
        "title": "Not Sure what to title this"
    },
    {
        "content": "I've been a little too pre-occupied with some other things going on in my life right now to post.  So, I promise that new posts will be on the way shortly.",
        "title": "I'm here"
    },
    {
        "content": "It's been so hot here that we haven't been doing much.  I have finally recuperated from having my brother in law here -- or at least I think so.  Still haven't really gotten back into my routine.  We are having some work done on the house this week, but before they could come to work on it my husband has had to do some maintenance of his own on the house. So, he has been outside working in 100 degree heat trying to get the house ready for some new guttering.  It always takes him longer than he thinks it is going to, so he spent a lot of time out in the heat.We did manage to play golf last week even though it was pretty hot.  My concentration level is getting so bad -- after about the fourth hole I should probably just call it quits and just walk the rest of the course without playing.  It's frustrating.Hope everyone had a great Fourth of July.",
        "title": "Hot weather"
    },
    {
        "content": "My husband's brother just left after spending five days with us.  It has been 25 years since he has been to visit us.  It was nice having him here.  But, it was definitely hard -- havingsomeone else in the house.  I'm glad he came though -- it gave my husband someone else to play tennis and golf with.The weather has been awful down here -- lots of heat and humidity so you don't feel like doing much.  Unfortunately over the weekend and through the 4th of July weekend it will be more of the same.I'm not planning on doing much.  It is going to take me awhile to get rested up from having company.  I didn't realize what a toll it would take on me.On another note, I had a weird dream last night.  I hope it wasn't a premonition of some sort.  But I remember going around and telling everyone that they need to let everyone in their life know how important they are and how loved they are because life is just too short.  I was running around all over town telling people that -- kind of strange I know.  They all looked at me like I was crazy but I kep telling them that they would thank me for it later.  So, I guess I should take my own advice and thank all of you for your friendship and love -- maybe that's what dreams are for!",
        "title": "A busy time"
    },
    {
        "content": "This morning I spoke to a local support group.  I've spoken to them in the past but what makes these folks different is that they are proactive. By that I mean that many of the people are not in the support group because they are caring for someone with Alzheimer's, but most have had family members in the past with Alzheimer's and they just want to learn more about the disease.  I commend them for doing that.  Their group keeps getting larger and larger and I'm always so pleased to see them.  They always have great questions and I've said before, it does me more good I think than them.  I appreciate the opportunity to speak to them and any group.On another note, my brother-in-law is coming today for a five day visit.  We have lived here for 26 years and he came down a couple of months after we moved in and has never been back.  We visit him in St. Louis, but for various reasons he hasn't made it back down here.  He lost his wife to cancer at Christmas time.  I'm anxious for him to be here but at the same time hope he doesn't take it personally if I don't interact with him like I used to.  He isn't used to being around me and I definitely need my quiet time.  I told my husband to warn him that I wasn't been rude if I had to leave the room to \"escape\".  But, I'm glad he is coming -- it will do him good to get away for a few days.",
        "title": "Support Groups"
    },
    {
        "content": "I'm amazed at how much effort it takes for me to concentrate on something.  It's odd that the act of concentrating has become a conscious effort instead of something that comes automatically.  I am constantly having to remind myself what my tasks are and staying on task.  I've been trying to play some golf with my husband and after about four holes my concentration is gone as well as my game.......that's not saying I had a great game to begin with......but it certainly goes down hill after that.  I can't remember how many shots I've made (which might be a good thing!) or even where I am aiming.That's rather frustrating.",
        "title": "Concentration"
    },
    {
        "content": "It's been awhile since I've had what I consider a \"bad day\".  But this week I did.  I usually don't go out much in the afternoon because I do better in the morning.  I had a doctor's appointment at 2:30 on Monday and I decided since I was going to be out I would try to run a couple of errands before going to the appointment.  Well, I should have thought about that before doing it.  Going out in the stores later in the day for me is not good.  There are just too many people and I get confused too much.  Needless to say I was very frustrated.  I needed to go about two miles from my last errand to the doctor and it took me over an hour to get there.  I was just so confused I couldn't make it from point A to point B in a rational way.   I called my husband several times for help, but he was not reachable by phone.  It is always odd that I know enough to call him for assistance but that I can't get to where I'm going.  Although, something that did change this time is, that I know that I can always call other people for assistance, but I couldn't do that on Monday.  That thought was not something that even entered my mind, until after the episode was over.When I finally arrived at the doctor's office (half an hour late) I had forms to fill out since I had not been to that particular doctor in awhile.  And, of course, that was a big challenge.  I had lots of blanks on the form because I just could not answer the simplest of questions.  It's so frustrating.I was glad to see Monday come to an end.",
        "title": "Bad Days"
    },
    {
        "content": "Yesterday, our Memory Walk Committee held their first meeting for Team Captains.  The turn out was great -- it is the third year we have done this and it was great to see how the event has grown.  I've been on the committee for two years but stepped away this year because it was a little much for me.  But I am so proud of what everyone has done, how the committee has expanded and all the things they have accomplished.  I feel bad I didn't do more -- but I know they are on the right track and I am so happy.  I really feel like we can meet our goal of raising $50,000 this year.I also got a call from someone that had been at a recent meeting discussing clinical trials and some other things that have been doing on in the research field for Alzheimer's.  Although I don't want to get too excited because I have had my hopes dashed before, it appears there are now twelve different drugs in final clinical trial stages that have the potential to slow the progression of the disease down or prevent it all together --- wouldn't that be some wonderful news.  It's still a few years off but if I can hold out a little longer perhaps it can do me some good.   I'll certainly be keeping my eyes on that!",
        "title": "Some Good Things"
    },
    {
        "content": "I don't know if you saw the news stories lately about Elizabeth Taylor having Alzheimer's.  Each week, I get news stories emailed to me by Google that have to do with Alzheimer's and last week there were many stories about Elizabeth Taylor having Early stage Alzheimer's.  These stories came from lots of newspapers, not just tabloids, but I don't know their sources.Anyway, Ms. Taylor then went on Larry King Live and proclaimed that she did not have Alzheimer's.   Her interview probably did not affect you the way it did me but I was very upset with it.  She claimed on the show \"do I look like I have Alzheimer's? Do I look like I'm dying, do I sound like someone who has Alzheimer's?\"  Just what is someone suppose to \"look like\" when they have Alzheimer's?  Ms. Taylor -- I don't \"look like\" I have Alzheimer's either -- but I do. I'm not ashamed of it -- it's a disease and I have it.   Her attitude about this disease is what we must all fight -- people have to deal with it just like all other kinds of diseases.Can you see this bothered me?  I hope others are bothered by it as well.",
        "title": "Elizabeth Taylor"
    },
    {
        "content": "As I write this my son is heading back to California.  It was nice to have him here for ten days.  I really miss him when he goes back.  We had a great time getting to play some golf and tennis.  Since my concentration is not that good anymore I'm not that much fun to play with, but he played with me and I at least enjoyed myself.Yesterday we went to a Braves game.  It was a long day for me.  To make matters worse my husband was driving and he has a severe case of road rage and it upsets me greatly.  I couldn't go to the airport with him today when he took Alan because I couldn't be in the car with him again so soon.  I get really agitated when he has one of his rages and he knows it --he just doesn't do anything to control it.  Because I knew that it always happens I asked him if he even wanted to go to the game (he doesn't like baseball that much) and if he did that I couldn't tolerate the \"road rage\" so if he went with us he had to keep it under control.  Obviously that didn't happen.  I can't change him, so I'm going to have to change the way I get around.  I've missed out on many things I want to do because I can't be in the car with him.  Around our town it isn't so bad because I can still get some places by myself.  It's harder when I need to go somewhere out of town.....but I'll figure it out.My son made a couple of changes on this website. If you notice at the left, there is a link to this year's Memory Walk and a link to his blog.Now I need to get back into my routine and I'll feel a whole lot better.",
        "title": "Back To \"Normal\""
    },
    {
        "content": "I realize when my son comes home to visit how much I miss laughter.  When he is home we laugh all the time....at silly things....at life in general.....and even at ourselves.  I don't do that as much when he is not around. I think I used to.....but not so much now.  Life really is too short not to laugh -- even if it is at our own expense.",
        "title": "Laughter"
    },
    {
        "content": "Alan's home so I have been busy.  We've been trying to play golf as he lugged his clubs here from California so we thought we should put them to use.  My concentration isn't what it used to be so after about five holes I'm \"done in for\".  But, at least I'm out there trying and getting some exercise.We are off to relax in the mountains for a couple of days. More soon.",
        "title": "Busy"
    },
    {
        "content": "My husband has been retired for about two weeks now.  He still thinks he is on vacation, but having him around all the time is starting to take a toll on me.  Although I have been trying to get out of the house when I can, having another body around the house all the time is just hard on me.We've discussed the problems that I was going to face and how we can help to change the environment a bit.  We just haven't done anything about it and I guess it is time.  I've proposed some changes as far as making a \"quiet room\" for me.  The constant noise of the television being on all the time is really bothering me.  Having that extra noise in the house is very tiring. Luckily, my husband isn't real needy and isn't a big conversationalist but I still feel the need to be somewhat engaging when someone else is in the house.....always having to be \"on\" if you will.I haven't had to deal with that much since I have retired -- a few days on the weekend -- but then I would have Monday through Friday to get back into a routine.  The routine is certainly missing now that there is another person in the house.  I don't feel like I can carry on my regular routine with someone around.  I guess I'll have to get over that.  I've been pretty good about getting up and going to the gym in the mornings and a few other things that I regularly do, but when someone else is around it is just different.I know it has only been a couple of weeks, but it is probably time to make some changes.  It is nice knowing someone is around in case I need some help, which on some days is more than others.  I'm just not very good with change these days.",
        "title": "Changes"
    },
    {
        "content": "Hope all the mother's out there reading this had a great Mother's Day.  I got enjoy watching some college tennis on the UGA campus.  The Georgia men are now headed to Stanford for next weeks NCAA tennis tournament.  I wish the tourney was being held in Athens (as it often is) because I enjoy watching -- but next year it will be back here and we'll get to enjoy seeing the best in the country play.  They make it look so easy!My son will be home on Saturday.  He has two exams this week.  I'm hoping he'll help me change a few things on this blog as it is getting a little boring!On Saturday I went to Atlanta to help film a Memory Walk video for the Georgia Alzheimer's Association.  They are putting this together for potential sponsors of the walk.  I hope it works -- we need support and anything we can do to get it will help.  I've already started raising money for the walk so you will probably be hearing from me shortly -- although our walk isn't until November.  Need to raise it when I can!My husband's retirement is going o.k.  I think that he still feels like he is on vacation since it hasn't even been two weeks yet.  We have managed to \"stay out of each other's way\" pretty well so far.  It is different having him home though.  I realize all the little things I have to adjust to by having someone else in the house all day.  Plus, he hurt his back last week and hasn't been able to move around a lot so he has been kind of laying around the house these days.  I hope his back gets better before Alan comes home so we can play some golf or tennis.I've written enough for now -- more soon -- I promise!",
        "title": "The Weekend"
    },
    {
        "content": "to all my friends out there.  My son will be home next week so that will be a nice present for me.It's easy to take our kids for granted.  Sometimes it is hard to see them for the individuals they are.  They'll always be our \"children\" regardless of how old they are.I think the saying \"you don't appreciate your parents until you have children of your own\" is true.  I wish I would have learned that earlier.",
        "title": "Happy Mother's Day"
    },
    {
        "content": "My husband and I played our second tennis match on the little league I was telling you about a few weeks ago.  Rain in our area has forced us to cancel a couple of matches so we are a little behind.  I did a little better last night -- we still lost but we had a good match and it could have gone either way.  I still am walking around the court like a zombie most of the time, because I can't remember the score and can't remember who is serving.  I get into the point and my concentration is only on the point and nothing else.  My husband has a bad habit of not saying the score when he serves so I am having to ask him constantly what the score is.  He says it shouldn't matter what it is -- which is true because you should try to win every point and not play according to the score.  However, it is bad tennis etiquette not to say the score for everyone's behalf.    We had to play three sets and I held it together for that long, so I'm scoring a personal victory for holding on!We are suppose to play another match this week -- we'll see how that goes.My son will be home from law school in a couple of weeks.  I saw him about six weeks ago but it seems like a lot longer than that.  I really miss him being here -- do we ever get over that as parents?",
        "title": "Tennis Part II"
    },
    {
        "content": "Well, it is official, my husband is now retired.  There was a small party for him at the lab and it was so nice.  Everyone was so gracious and Ralph gave a very nice talk at the end.  That is not something he likes to do but I was very proud of him.  I know how hard that must have been for him.  We took some photos and I'll post some as soon as he takes them out of the camera.I gave him some golf lessons as a retirement present.  I hope he'll feel a little better about his swing after a few lessons.  He just needs to play more.  Now he has the time to do that.  I just need to find some other people for him to play with besides me.Adjustment time is ahead.....for both of us.",
        "title": "Retirement Part II"
    },
    {
        "content": "My husband retires on Wednesday after spending 40 years with the US Government.  He certainly deserves it and I'm happy for him.  But at the same time I'm pretty depressed about it.  I feel guilty for saying that because it is selfish of me to think that way.I'm used to having the house to myself, it is quiet all day long and I don't have to answer to anyone.  Having another person in the house makes me tired.  I started realizing several months ago how tired I was on Monday mornings and finally realized that I was more tired because there was more going on during the weekends with Ralph home and more was expected of me.  I had to actually participate in conversations and keep up with more.  Mentally, that is a lot for me.Ralph knows that some adjustments are going to have to be made.  From both of us.  I really don't know any couples that haven't had to go through some adjustments during the retirement stage.It will be a few weeks before Ralph really feels like he is retired, as it will seem like a vacation for awhile.  Reality will eventually set in and hopefully we'll be ready for it.",
        "title": "Retirement"
    },
    {
        "content": "I met an old friend for lunch this week.  I've know her for about 10 years and we don't get together very often which is a shame.  It had been about 8 or 9 months since we last saw each other and I was feeling pretty guilty about that.  I hate that I let so much time slip by since we last saw each other.  An occasional email and card were sent but it is so much better to get together.  So this week we met and it was as if no time had passed at all.  We picked up right where we left off and that is one of the great things about friends.On the other hand, there are those friendships that you really have to work at.  I'm not real sure why that is, but some take more effort than others.  I've tried to evaluate whether those people are really friends or people that I know better than just acquaintances -- but I guess it doesn't really matter.  If they are worth having in your life, they are worth working on.Friends and family make the world go 'round -- don't forget that.",
        "title": "Friends"
    },
    {
        "content": "Several months ago I wrote in this blog about a friend who had a terrible skiing accident in Denver.  He suffered quite a few broken bones, lost sight in one of his eyes and took a pretty good blow to his head.  As a result he has been through a long journey and still has a long way to go.  He is out of the hospital now and into a rehabilitation situation.  I spent some time today with his fiance who is back in Athens getting ready to graduate from UGA.   I've been keeping up with his progress and realized early on that Brad was experiencing a lot of similar things that I experience as far as his brain injury is concerned.  It will be a long time before they actually know the extent of Brad's brain injury but some of the problems he is experiencing now are all too familiar to me.In talking with Lauren today we talked about how tired Brad gets and his doctor's have termed this as \"cognitive fatigue\" -- basically you brain gets tired.  I have often told people that I get so tired and the only explanation I have for it is \"it's like taking a final exam for eight hours and you are mentally exhausted\".  I guess now I can say it is \"cognitive fatigue\" --that sounds much better don't you think?Some of Brad's other symptoms that are like mine are getting frustrated and agitated easily, not remembering the right words for things and dealing with emotion.  I guess when the brain is \"injured\" however that might come about a lot of the same symptons occur.  Lauren and I discussed how far the medical world has come on so many things but when it comes to the brain we seem to be miles behind.....or maybe it just seems that way.  There are probably a lot of other people thinking the same thing about the diseases that they have.Brad and his family are on a long road to recovery.....to me it is so much harder on the families and you all know how I feel about that.  To me, that's the hardest part of having this disease, what it does to my family.  My best to Brad, Lauren and the rest of his family -- they have certainly shown a great deal of love and support to him and he will need more as the days and months and years progress.",
        "title": "Cognitive Fatigue"
    },
    {
        "content": "It's been a busy week with the golf tournament and all.  I made it through my first day of \"marshalling\" a hole yesterday and have two more days of that.  The weather didn't cooperate the first part of the day so we ran about two hours behind.  All in all though I think it is goin pretty well.  Because of the weather delay I was on the course much longer than I thought I would and toward the end I was making a lot of mental mistakes because I was tired.  The mistakes weren't so bad that it messed up a player, just did some things that I wouldn't have necessarily done if I hadn't been so tired and \"over extended\" is probably a good word for it.I've seen a lot of people volunteering at the tournament I haven't seen for a long time. Many of them I can't remember their names which is frustrating and I'm probably not remembering some of them at all.  But at least I'm out there.They've treated the volunteers extremely well with appreciation.  They have also been feeding us every day and since we are a country club it is country club food, not just sandwiches.  I've tried to stay on my diet the best I could but the food is pretty tempting.  One thing they had one day this week was fried chicken.  I haven't had fried chicken in probably well over a year because of my diet, but I had a piece this week and it was like heaven!  I think I even had a dream about it that night.  That's pretty pathetic isn't it?",
        "title": "This and That"
    },
    {
        "content": "One of the sponsors of our Memory Walk here in Athens last year was one of our hospitals.  This week they are hosting the Nationwide Tour of the PGA.  So, I decided to volunteer to work since they were good to us last year.It's been fun watching the players.  It makes you want to go play some more.  I was hoping that by osmosis that at the end of the week I would play better, but that probably isn't going to happen!  I've been working on the driving range for two days and tomorrow I will be working on a hole as the tournament begins.  I suppose when Ralph retires in a few weeks, we'll be playing much more golf.  I used to play pretty well, but my concentration isn't what it used to be and that means I don't play real well now.  But at least I get out and get some exercise and enjoy the outdoors.  As many people have said, golf is kind of like a walk in the park chasing a little white ball.",
        "title": "Golf"
    },
    {
        "content": "I can't remember a time when I didn't play tennis.  I taught myself very young.  I've always been a tomboy and when my brothers wouldn't let me play baseball with them when I was young, I got a tennis racket and would hit tennis balls endlessly against a wall, near the baseball field so I could be close to my brothers and all the action that was going on.  My mom used to tell the story that my brothers wouldn't let me play baseball with them because I would turn cartwheels in the outfield.So I played a lot of tennis.  Sports for girls in high school were virtually non-existent at that time so I never really played on a \"team\" until my adult life.This all brings me to my tennis match today.  My husband signed us up to play in this mixed doubles league.  I have made it my practice to not play mixed doubles with my husband because it never seems to work out.  I play to win -- he plays for fun.  However, I said yes, and we started our league play today.The first set was fine -- we lost 7-5 but it was very competitive.  Then I lost it.  My concentration was shot, I put my earplugs in to help block out some of the noise.  I couldn't remember the score, I couldn't remember who was serving and I couldn't remember the last point.  I started having panic attacks and couldn't breathe.  I was so confused and so upset I started crying on the court before we started the second set.  Our opponents didn't see this (I don't think) but suffice it to say we never won another game.  I disappointed myself, but also my husband -- although he hasn't said that -- I just feel that.I think I have now become a person who \"doesn't play tennis\" but rather a person that can go out and \"hit the ball\" for an hour or so and let it go at that.So many other things that I have lost the ability to do, do not bother me as much as this.  Tennis has been a part of my life for over 40 years.  I've always been that self proclaimed \"tennis snob\" but I guess I won't be any longer.  I'm sure my tennis playing friends reading this will be rejoicing at that fact.We still have five matches to go in our league and I'm not sure how I'm going to get through them or if I will be able to do it at all.My husband has commented from time to time that I was always defined by what I did -- mainly by the jobs I have had over the years.  He worried that when I retired I would have a hard time, because I wouldn't be known for something.  I've always had relatively high profile jobs and he really felt that is what defined me.  It probably did sometimes.   But, I have always defined myself in many ways and one thing I was always proud to say was that \"I was a tennis player\".I guess I no longer am. And that makes me very sad.",
        "title": "Tennis"
    },
    {
        "content": "I know I have been a little slack lately in writing in this blog.  Sometimes I just can't think of what to write without boring all of you.  I've been working on a lot of projects and a few are coming to an end which will free up some of my time.  I was involved with a banquet this past Tuesday night which took a little more out of me than I thought it would.  But I have had a few days to rest up before I tackle something else.I hope everyone has a great Easter weekend.  The weather down here in the south is suppose to be 84 degrees over the weekend.  Tennis and golf weather it is.I'll try to do better in the coming weeks about posting here.",
        "title": "A little slack"
    },
    {
        "content": "The pollen has certainly made its presence known in the south.  The green stuff is all over the place and people are sneezing all the time.  The beauty of the trees, flowers and plants though somehow make it worth it.The spring makes me look forward to lots of things.....playing more tennis and golf and just being outside.  It is getting more difficult for me to play tennis and golf though as my concentration is not what it used to be.  But at least I can still get outside and get some fresh air.  I'm also looking forward to my son coming home next month.  He'll have completed his first year at law school at Stanford and he'll be home for a short break before heading back out to California for a summer job.  I cherish the time I have with him.And, this week is my 26th wedding anniversary.  I hate that my husband doesn't have brighter days to look forward to knowing that my illness will certainly affect his life more than mine.",
        "title": "Spring"
    },
    {
        "content": "For those of you that have known me for awhile you know that I have always been one to \"say what was on my mind\".  Sometimes that got me into trouble, but for me, what else is new? So, what I am about to write will seem like a shock to you.I'm having an increasingly difficult time saying the words that pop into my mind.  I know exactly what I want to say but I can't put the words together to make it mean what I want it to mean.  Yesterday, I was having a lunch meeting with some of the women on the Memory Walk committee for this year, and it seemed like every point I was trying to get across didn't come across the way I wanted it to.  I think they were able to get some things I was saying, but after the meeting I felt really bad because I know I must have sounded like an idiot at times.I'm also working with a national committee for a national Alzheimer's conference in Atlanta this fall.  Our work includes going over abstracts for speakers.  Since the committee is comprised of people from all over the country we are having conference calls to narrow the field of the speakers.  I have a difficult time working over the phone anyway, but to have lots of different voices coming at me makes it extremely difficult.  Then the lack of me being able to put sentences together to mean what I really want to say intimidates me so I end up being more silent than I feel I should be.  (What a shocker that is!)  I feel inadequate and very useless to the whole process when I can't contribute what I want.I've said before that this disease makes me feel stupid and when I encounter days like yesterday I do feel stupid.  I know that I'm not stupid, but it's hard not to feel that way.Having come from a journalism background as a tv news reporter and writer for many different publications this becomes increasingly frustrating.  Communications has also been something I thought I did pretty well.  Since being diagnosed I have wanted to write a book, but I know that I couldn't do that without a lot of help.  I haven't found that help yet, so I guess for now this journal is the best I can do.....and I'm not really sure how good that is when I go back and read some of the posts I've written.  Thank you for reading anyway.",
        "title": "Speaking My Mind"
    },
    {
        "content": "You know the feeling when you are on vacation and near the end of your vacation time you realize that it is going to be over soon and you'll be back to \"reality\".  Even though I'm retired, I still feel that way when I go away.  But since being back from Illinois I hadn't really thought that way until yesterday.  That's when the old brain decided to act up more than usual and I suddenly come back to that dreaded feeling I get when I think about this disease.  On good days I rarely think about it -- but when it rears its ugly head there's no denying it.On another front for \"reality\" -- in about three weeks my husband retires.  I know I have mentioned it before, but I think I have put it out of my mind.  What a change for him and definitely a change for me.  Having someone around the house all the time is going to definitely be hard.  My husband has a hard time being in the house without noise.  He has to have the television or the radio on.  I can't function like that -- there is never a tv or radio or anything that produces noise on during the day when I am home alone.  We will definitely be created a \"no noise\" room for me to escape to.  It will certainly be different for everyone.  My husband has worked for over 40 years in his job and he deserves to retire and we deserve to be able to do things while we still can.  But an adjustment to the way we live our lives is definitely around the corner.",
        "title": "Reality"
    },
    {
        "content": "I'm participating in a study with the Medical College of Georgia.  It basically is asking me and my blood family members for a couple of vials of blood for a study on genetic testing for Alzheimer's.  I have two brothers -- both older than me.  My oldest brother will not take part in the study.  The excuses are pretty lame and it bothers me a great deal that he refuses to take part.  It's just a couple of vials of blood and you have to answer a few questions.I'm glad I don't need a kidney from him.",
        "title": "DNA"
    },
    {
        "content": "I returned home last night from my visit with my brothers and family. My cold got better, but I managed to give it to Alan. After he left me, he and his girlfriend Jennifer went to Lake Tahoe skiing. He called me from the slopes to tell me I had passed it along. I'm sure I told him \"it is a nice thing to share\". Mind you -- he still had the energy to ski!It was nice visiting everyone -- but of course it is always nice to get home as well. I certainly couldn't have done that trip alone -- I think those days are over for me -- at least maneuvering my way around Chicago on the buses and the EL. Alan and I managed to see some friends, go to the Art Institute of Chicago, the Adler Planetarium and Navy Pier. It was cold and windy -- what else do you get in Chicago?I wish my family lived closer or vice versa. I always hated that Alan really never got to know his cousins very well. Being an only child it would have been nice for him.",
        "title": "Back from Illinois"
    },
    {
        "content": "As I write this I am in Peoria, IL visiting my family for a few days.  Over the weekend I spent time in Chicago with my son.  We had some fun exploring Chicago and visiting with our friends Pody and Rick from Champaign.  Pody gave us a wonderful trip to the Art Insitute of Chicago by providing lots of information about the paintings.  She is an art history professor so I wouldn't expect anything less from her!  We got to visit her daughter's apartment in Chicago (Rachel is an attorney in Chicago, but was out of town), we went to Second City, Navy Pier, and the Adler Planetarium.  It was nice to be just be a \"tourist\" for awhile.  On Monday, Alan and I hopped a two hour train to Bloomington where we were met by my brother, his wife and my nephew for dinner before heading on to Peoria.The bad part about the trip so far is that I developed a cold the first day and some things I had planned for the trip I didn't do because I didn't have the energy and just didn't feel like it.  So, while in Peoria, I'm trying to take it easy so I can get to feeling a little better.  Plus, I'm extremely tired from the trip and some parts of it are harder than they should be.However, being around family is nice.  I don't see them often enough.More when I return.",
        "title": "Vacation Time"
    },
    {
        "content": "Well, the calendar says it is spring, but the weather doesn't feel like it now.  A few weeks ago the temperatures were in the 70's and now we are lucky to get out of the 50's.But I'm plunging into colder temps as I travel this weekend to Chicago to meet my son for spring break.  It's always cold in Chicago during fall, winter and spring.  And, the forecast calls for snow flurries.  Then we are taking a train to Peoria to meet with my family.  Alan will then head back out to the west coast and I'll spend a few more days visiting with my relatives.   My friends Pody and Rick (that we saw in England) will be joining us for a day in Chicago and Alan will catch up with a high school buddy that lives in Chicago now.  Lots to do, lots of people to see.  I just need to pace myself and try to get some rest when I can.I know I'll have some interesting stories when I return.  I promise.",
        "title": "Spring?"
    },
    {
        "content": "It is nice to have a \"slow\" weekend.  Not a lot on my plate and I need the rest.  I enjoy watching the basketball tournament -- both men and women's -- although I get confused a little when they keep switching back and forth between games.Next week, I'll be off to spend a few days with Alan and my family in the midwest.  It has been awhile since I have been up there and it is always good to see how everyone is and how big some of the children in my family have gotten.  I wish we lived closer so we could visit more often.  There never seems to be enough time to do a lot of things I'd like.Spring is officially tomorrow.  I wish the weather here in Georgia felt like it.",
        "title": "Slow Weekend"
    },
    {
        "content": "Well, yesterday I had a \"once in a lifetime experience\". A professional group I still belong to had a \"field trip\" to Talladega Speedway in Alabama. Although I knew it was going to be a long day and it would take me awhile to recover I thought that it was really something I wanted to do. Not being a real fan of racing, I wasn't too sure about our excursion -- but it was great.Talladega is much larger than I thought it was going to be and we got to ride around the track at 120 MPH! That was really awesome. The slope on the turns is 34 degrees and it felt pretty amazing. Now the real race car drivers go at 195 and they are just inches apart at times while racing --that is pretty scary to me. Considering there were only two cars on the track when I was on it and it was scary, I cannot imagine what that must feel like.I guess I don't have the natural urge for the \"need for speed\".",
        "title": "Life in the Fast Lane"
    },
    {
        "content": "One symptom of Alzheimer's can be hallucinations.  I have never really had them, but I do hear things.  The things I hear are not voices but \"sounds that don't belong\" -- like a door slamming when it shouldn't be or a car honking its horn when there are no cars around.Quite frequently I hear a door in our house slam.  I am usually in the back part of the house when I hear this and go out to see if my husband may have come in and I didn't hear his car pull up.  But no, when I go look he is not home and there is no one hear but me and the cats.  And, the door that I swear I hear slam is already shut and I knew it was all day long.   I've mentioned this several times to my husband because it is so annoying but he always tells me not to worry about it -- it is probably a sound coming from the neighbor's house and it just sounds like it is coming for our house.   So, I haven't mentioned it in awhile.This weekend, our son was in Atlanta spending the night and expected to arrive home around noon on Sunday morning.  At around 5:00 a.m. my husband \"heard a door slam\" and woke me up when I heard him say \"Alan is home\".  When I looked at the clock, I knew there was no way Alan would be coming in at 5:00 a.m. when he was spending the night in Atlanta.  I rolled over and tried to go back to sleep.  My husband did not hear Alan come in or go to his room so he got up and went to look in the garage to see if the car was there.  Alan was not home -- Ralph was \"just hearing my noises\"!  I told him that it was the exact same sound I would hear during the day and how annoying it was.  He was convinced someone had slammed that door.  Now his explanation is \"maybe we have ghosts\"!",
        "title": "Ghosts"
    },
    {
        "content": "Many of you have been asking me to post a new photo of my son. Since he was home this weekend I thought it would be a good opportunity. It's not the best photo in the world and maybe when I see him in a few weeks in Chicago we can do better.My hair is a lot longer and in this photo it isn't curled so it looks a bit straggly. Many of you have never seen my hair that long. I decided to start letting it grow about a year and a half ago. Since I wasn't working everyday and didn't have to spend a lot of time on it everyday, I thought I would try it. It has been well over thirty years since I have had any length to my hair. Some say it is because I turned 50 and this is my \"mid-life crisis\" -- if so, I say great -- since that isn't much of a \"crisis\" to me. It's surprising that a lot of folks don't recognize me with long hair, but sometimes that can be a blessing, because I don't remember them so then I don't feel so awkward!Alan is safely back in Palo Alto facing a full day of classes. It was certainly nice to have him home. Now back to the routine!",
        "title": "A New Photo"
    },
    {
        "content": "Well, it is just Saturday afternoon but it has already been a long weekend.  My husband and I just got back from Augusta where I spoke at a conference for the Alzheimer's Association for caregivers.  Everyone was so nice and very attentive when I spoke.  I have said before that it seems like good therapy for me when I do this and I hope in some small way I am able to help others.  The group was great and so very gracious.  I appreciate being asked to speak because I have no idea how long I'll be able to continue to do it.  It's tiring but it is so worth it.  There are a lot of people out there fighting for us that -- it is the least I can do for now. Thanks to Kathy and Kimberly for asking me to be a part of the conference.My son is off to Atlanta for the tribute to his friend that passed away.  It has been hard for me as a parent, as it is for most parents, I suspect, that you hurt when your children hurt.  Losing a friend at such a young age is tough.  Adam was a special individual and did more in his short life than many will do in their entire lifetime.  His parents should be proud and I know that those in his life are much better off by having Adam as a friend.Alan will be leaving to go back to California tomorrow and the house will be much quieter.  But I hate to see him go.  I just get used to him being around and he is off again.  In a few weeks, though, we will be in Chicago together for a few days and getting to visit with friends and family. That will be nice.",
        "title": "The weekend"
    },
    {
        "content": "Well, it has certainly taken me longer to rest up from Little Rock than it should have.  It has just been hard for me to get up these days.  Although, the doctor gave me a new sleeping pill a couple of weeks ago -- maybe it is starting to work!I have a speech to give this weekend.  It is in Augusta at an Education conference for caregivers.  I haven't spoken for awhile so I hope I do o.k.  When I go, I usually take two versions of a speech with me -- one that is totally written out and then one that is just notes.  Depending on what kind of a day I am having will determine whether or not I have to read it or I can wing it from notes.  Not sure what kind of day Saturday will be.  I always hope that I can leave folks with a little something that they didn't already know, but at times it seems like I am \"preaching to the choir\" since many have been associated with this disease much longer than I have.Last night on NBC news they spoke to a gentleman that had early stage Alzheimer's.  That gentleman was in Washington DC at the Public Policy Forum with me for a couple of years.  He seems to still be doing pretty well.  I haven't seen him in about a year.  I hope I can say that in another year.My son will be home tonight to attend his friend's memorial service this weekend.  It will be nice to have him home, although I wish it was under better circumstances.",
        "title": "The Week"
    },
    {
        "content": "Well, I came home from Little Rock in one piece.  Our team lost in the semi-finals and we were not real happy about that.  The trip back was long due to construction, but it is nice to be home.My son is coming home this week.  He is coming home for a memorial service for his friend Adam. (See post below).  Adam's death saddens me so much. My heart goes out to his family and friends because it is such a tragic loss.  I guess Adam  has \"gone home\" too.",
        "title": "Coming/Going Home"
    },
    {
        "content": "Well, as I write this I am in Little Rock Arkansas -- the women are winning and that is a good thing.  I've finally figured out how to get the computer to work while I am here.But driving over to Little Rock on Thursday, I got a call from my son in California.  He had been notified that one of his best friends and former room mate at Georgia Tech had been found dead in his apartment in Atlanta.  His name was Adam Stevens.  Adam had taken a job with a company in Norcross (outside of Atlanta) after he graduated so he and Alan were able to stay connected.  He traveled a lot for business and he recently returned from a two week business trip to India. Adam evidently died upon his return because he didn't contact his office when he returned and they sent someone looking for him and his body was found.  Foul play is not suspected, nor is drugs or alcohol.  Alan told me that Adam had a thyroid problem but he didn't think it was life threatening.  It is so sad to lose someone so young.  He was in his early 20's.  In high school my son had a friend that was killed in a car accident and one friend was murdered.  When I was growing up I didn't have to experience the death of any friends, just family.  That is hard on young people.  It is such a shame.  An autopsy will be done on Adam's body to determine the cause of death.  I feel so bad for his parents and for his friends.Life is so precious.",
        "title": "More Sad News"
    },
    {
        "content": "I'm back on the road this weekend -- to watch the UGA Women's basketball team play in the SEC tournament in Little Rock Arkansas.  My husband isn't going with me -- I'm going with three other ladies and we are driving out there.  I'm a little anxious about it because I don't travel well these days.  I feel more comfortable when my husband is with me -- but all of these ladies are my friends and they understand my situation.  I'm fortunate to have friends that still want to go places with me!I hope we are gone for several days because that means we are winning!",
        "title": "On The Road Again"
    },
    {
        "content": "I think I have mentioned in this blog many times how I don't do well with change these days.  Routine is what I need but lately a lot of things have been changing.  So far, I've not done too bad -- a bad day here and there but for the most part, not too awful.My doctor once told me that she felt that it wasn't change affecting me as much as it was the \"unknown\" -- not knowing what was going to happen.  If the change was planned I did better.  I hope this makes sense.I guess there will be a true test in a couple of months when my husband retires.  May 3rd is his last day of working for Uncle Sam.  He certainly deserves it....he has worked there for forty years and it is the only job he has ever had.  It will be difficult adjusting to that change....both for him and me.",
        "title": "Change"
    }
]