[
    {
        "content": "Carter and Ruby meet for the first time.Katie, Chris, Carter, Melissa, Josh, Ruby, me and AlanYesterday -- I was able to catch up with some of my favorite people.......my friend Josh and his wife Melissa and Chris and his wife Katie.  If you have been following this blog you will know about my friendship with Josh and Chris.  Well, this year, they both had an addition to their families.  Chris and Katie welcomed son Carter on August 20 and Josh and Melissa welcome daughter Ruby on September 10th.  Chris and Katie live in Southern Florida so yesterday was the first time we have been able to meet Carter.  The photo above shows all of us together.  It was fun having everhone together -- they are extended family to me and I am so grateful to them continuing to stay in touch with me and being apart of their lives.",
        "title": "Merry Chirstmas"
    },
    {
        "content": "I know I haven't posted in awhile.....but I've been in Illinois visiting my family......but most of all, hanging out with my great niece and nephews.This is HenryThis is DekodaAnd this is OliverAren't they adorable?",
        "title": "I'm here"
    },
    {
        "content": "Jennifer and Alan were kind enough to invite us for dinner with Jen's parents. Nice to be a guest for a change! Thanks Alan and Jennifer!Relaxing after Thanksgiving DinnerJen and her mom enjoying the food.Alan after dinnerAlan and I sharing the swing at the park behind their apartment after dinner.I love to swing -- although only kids were suppose to be on the swings I couldn't resist!If I hadn't had a dress on I would have been in the middle of this!Of course, everyone cleaned their plate!Lots of good food made by Jen and AlanGoing through our Australian scrapbook with Jennifer's parents.Alan found this wine in Atlanta -- from Australia -- and the little island where we saw the \"Little Penguins\".Jen didn't have to call us twice to the dinner table!Carving the turkey she made for us!",
        "title": "Photos from Thanksgiving"
    },
    {
        "content": "I hope everyone had a great Thanksgiving. We can all be grateful for so many things. I'm most grateful for friends and family. Today, I met a new friend. I've known other members of her family for a long time, but never got to actually meet her until today. What a lovely young woman she is. So beautiful, so well spoken, so loving and so down to earth. What a refreshing friend to meet. I'm thankful for that. When you think about it, you don't really meet that many people that truly become friends -- usually just someone you meet in passing. It's a treasure to find a \"new friend\".We had a nice quiet Thanksgiving with son and daughter-in-law and her parents in Atlanta yesterday. Jennifer and Alan did most of the cooking and it was nice to sit back and be pampered a bit. I'm glad they are closer to home now and that we can enjoy their company more often.",
        "title": "Thanksgiving"
    },
    {
        "content": "came to visit me today.",
        "title": "My friend Ruby"
    },
    {
        "content": "In today's edition of the Atlanta Journal Consitution, the first articles of several about Alzheimer's is published. The link is herehttp://www.ajc.com/health/slow-descent-into-the-1224104.html. There will be more articles in the weeks to come. Thought you might want to take a look.",
        "title": "Series about Alzheimer's"
    },
    {
        "content": "is a book you must get if you are a friend or caregiver to someone with Alzheimer's. This book is a real \"hands on\" book in helping you to communicate with those that have the disease. Dr. Mary Cail is the author and she has certainly done her research on this book.After I was first diagnosed people didn't know how to talk to me. They thought (and some still do) that I couldn't think for myself, that I couldn't understand them and they would talk around me, not to me. They would (and some still do) say --\"You look great -- you don't have Alzheimer's\", or \"we all forget things every now and then I'm sure you're fine\". They say things like this because they don't know what else to say. Dr. Cail helps you out with this. She gives you avenues to go down with those with the disease -- in all stages of the disease, not just early on-set.Some of the stories in the book are sad, but you need to read them. It will help you understand the disease from the perspective of someone who has Alzheimer's.In terms of full disclosure, I must tell you that she has used some things from this blog in her book, but that isn't why you should buy it. She deals with the \"elephant in the room\" kinds of things that happen on a regular basis to us that have the disease. No one wants to broach the subject but she helps you through this. She shows that we don't have to be \"alone\" in our disease if our friends and family know how to deal with it. Most Alzheimer's patients and family will tell you that after the diagnosis, friends pull away. You don't get those invitations to go out, you don't get company very often. Dr. Cail tells you how to feel comfortable in those situations.Some of my friends point blank asked me after my diagnosis -- what should I say to you if I see you and you don't recognize me? I was grateful for the question, because they cared enough to want to know the answer. Today, sometimes I see people I know out shopping and they avoid me -- I don't know if they avoid me because they didn't see me or if they just don't know what to say. I know it's hard. but friends make the effort and this book helps.Dr. Cail's book can be found on Amazon athttp://www.amazon.com/s/ref=nb_sb_noss?url=search-alias%3Dstripbooks&field-keywords=The+All-Weather+Friend%27s+Guide+to+Alzheimer%27s+Disease&x=0&y=0I can't do the book justice here, but if you get the book, you'll be glad you did. And, share it with your friends -- it will help them understand Alzheimer's so much more.",
        "title": "The All Weather Friend's Guide to Alzheimer's Disease"
    },
    {
        "content": "Finally getting to the computer to write a few things. We are back, trying to get over the jet lag and also colds we caught on the trip. The trip was great -- guess I really don't need to say that to those that have been to Australia and seen how beautiful it is. I don't remember a lot of what we did, but hopefully going through photos will help me. My daughter-in-law took a lot of photos and they are really great. My husband is going through them now, and I hope to spend some time trying to chronicle our time there. It was a tough trip, but I'm so glad I went. I know it probably wasn't easy traveling with me, but my family didn't let on if it was. When I got tired, Jen and Alan did get to go out on their own and I don't think I held them back too much -- I appreciate everyone's patience with me.",
        "title": "I'm back"
    },
    {
        "content": "No explanation needed.",
        "title": "Up close and personal"
    },
    {
        "content": "I was having a problem with the computer downloading my first post, but I seem to have corrected it.  Things are still going great here in Australia.  We have had some amazing experiences.  Last night we went to Phillips Island, and saw thousands of \"little penguins\" come ashore for mating season.  You can't take photos of them, but the penguins are only 12 to 13 inches tall and they are so cute.  It was really amazing.Weather is cooperating although we are going to have a little rain today.  We are off to Rod Laver's arena today and the site of theAustralian Open.  Golf is really cheap to play here but we won't be doing that -- as it takes too much time.Alan is a great tour guide and getting me around the city pretty well.  I get tired, but I'm trying to keep up.  Jennifer and Alan are being very patient with me.  I thank them for that.",
        "title": "Down Under Part Two"
    },
    {
        "content": "Well, we made it Down Under.  I wasn't sure if I should kiss the ground or not when I got here as this is something I have always wanted to do.  The flight over was long, but certainly worth it.Sydney reminds me a lot of San Francisco.  We toured the infamous opera house yesterday and it was gorgeous.  I'll try to post some photos soon.  We also spent some time with kangaroos, koalas, wmbats, dingoes, wallabys, and lots of birds yesterday.  The variety of birds is just amazing and they are all so colorful.The harbour is beautiful.  As I see things I keep thinking about my friends back home as to what they would like about the city.  Pody -- if you are reading this -- this is definitely a city for you and Rick -- with all the art, architecture and boats!!!The time change has taken a while to get used to.  I have sinced stopped asking everyone what day it is.I have certainly become a follower on this trip.  Alan has taken the lead and I am grateful for that.  I've had a couple of meltdowns with all the people and the noise, but we have managed that.  Sydney is a big city and I have to remember that it has lots of people and that bothers me.  But, we are adjusting. Getting my medicine adjusted from morning and night time pills has been interesting.   Alan isn't around me that much anymore so it is difficult for him to guess when things might be a problem for me.  But, I'm here and I'm enjoying myself.  He's taking care of me and that is good!  Jennifer is taking lots of photos and once I get some more time on the internet I will try to post some.The weather has been beautiful.  It is the beginning of spring here.  And, it is after the \"busy season\" so it is not as crowded (or so I am told) as it during the peak months.Our airline, Qantas, is threatening to strike next week and we have four flights left including our return trip home next week.  We are watching it carefully, but it would be a shame if we had to stay longer --- although Alan's new employer would not appreciate that much I'm sure.Lots of seafood here as you can imagine.  Sydney is heavily influenced by Asians.  We are heading to Melbourne today and we are told that in addition to an Asian flair there as well, it has the second largest Greek population outside of Greece, so that should be interesting.Thanks for reading -- more soon.",
        "title": "Down Under"
    },
    {
        "content": "We had a beautiful day for our first Walk to End Alzheimer's. Thanks to all who came out, who gave and those that helped plan and work the event. I love you all!",
        "title": "WALK DAY!"
    },
    {
        "content": "It's been an interesting day for me. I always get up early each morning and go out and get the paper. Usually, still dressed in my pajamas with my robe on. Today, I went out to get the paper and then I went and got in my car. I have no idea how long I sat in my car, but eventually I realized that I should be in the house since I didn't have my keys.That was kind of a sign to me that I probably needed to stay inside today and not venture too far away from the house without someone with me.Kind of a bummer, when it is also your birthday.",
        "title": "Interesting Day"
    },
    {
        "content": "It's that time of year again -- the crisp cool mornings have finally returned to Georgia. I think fall is my favorite time of the year.There is a lot going on right now and it makes me anxious -- but I know this will pass. Our Walk To End Alzheimer's is October 15th. I am hoping for gorgeous weather like we have been having. The day after that I'm off to LA only to connect to my long awaited trip to Australia. I still can't believe it. That has been on my bucket list for so long. My son has made this happen. I don't travel all that well these days but I know that he will take good care of me. I also know that I have some followers from \"down under\" so if you have some suggestions for us, please let me know!He and his wife are moving back to the Atlanta area as I write this. When we return he'll be working for a large law firm in Atlanta. I'm so glad they will be close. I know part of the reason they are moving back here is because of my health, and I wish that weren't the case, but I am glad they are going to be \"home\" again.This afternoon I get to go speak to one of my favorite groups, a gerentology class at UGA. The professor invites me every year and I really enjoy talking with her students. They always have lots of questions. And, many times have a very different perspective on Alzheimer's. A chance meeting of this professor happened several years ago when I was on my way to an Alzheimer's meeting in Chicago and she was on the same shuttle bus from Athens to the Atlanta airport. I'm so glad I have gotten to know her. She also fields a team for our annual walk.And, I have a new book for you to consider. It's written by Dr. Mary Cail and it is called \"The All Weather Friend's Guide To Alzheimer's Disease\". I haven't personally read it yet, but it is available on Amazon. Here is a link to her websitehttp://www.allweatherfriend.com/. One of the lines on her website is \"Books to help friends be friends when it matters most\". I like that. One thing that you hear quite frequently with people that have Alzheimer's is how many of their friends turned their backs on them after receiving a diagnosis. I'm anxious to read her book.",
        "title": "October"
    },
    {
        "content": "My dear friend Meg Dure writes for Athens Patch. Today, she wrote this articlehttp://athens.patch.com/articles/all-aboard-e08083c9.I don't usually post articles that are about me, but I couldn't resist this one. Dear, true and loving friends don't come easy. I've known Meg for almost thirty years and although we don't see each other as often as I would like, each time we do see each other, we pick up exactly where we left off.Thank you, Meg, for being my friend. I love you.",
        "title": "My dear friend Meg"
    },
    {
        "content": "I've received quite a few emails and calls in the last couple of days regarding the new Intranatal Insulin drug therapy that has been mentioned so frequently in the news. You can read about this herehttp://archneur.ama-assn.org/cgi/content/full/archneurol.2011.233. The data that was reported this week, was initally presented at the 2010 Alzheimer's Association International conference. And, one of the lead researchers, Suzanne Craft, was awarded a research grant from the Alz. Assn. to follow up on these findings. Based on the article above, this will now go into further stages of clinical trials. Please note that only 104 people were used in this particular studay at this time. While it sounds promising, we need to remember that more trials are needed to determine if this is truly effective. Let's hope for the best -- we'll keep our fingers crossed.Our Walk To End Alzheimer's is coming up in a month. Hard to believe that it is already here. you can still make a contribution if you follow this linkhttp://walktoendalz.kintera.org/faf/donorReg/donorPledge.asp?ievent=454828&lis=1&kntae454828=4D7AE01A5EA5463FA8C3FF9F86D75AE0&supId=48686180. I would appreciate your support whatever size it is!!I've been extremely anxious these days and hard to settle myself down. I don't know the reason. I have a lot going on with the walk and some other things, but I just can't seem to get things together in my mind. I know I am a pain to live with -- I'm not liking myself that much these days, let alone know what I'm doing to my husband and others around me.On a brighter note, it is getting closer and closer to when my son and daughter-in-law move back to the Atlanta area. I'm so glad they are moving back. My son finishes his federal clerkship next week in Washington DC and has taken a law firm job in Atlanta.The day after our Walk to End Alzheimer's I'm heading to LA and then on to the trip of a lifetime. I am going to Australia. I can't believe it actually. This is something I have wanted to do my entire life and I'm a bit overwhelmed to think that I am actually doing it. It's on my bucket list and I have been trying to tick all those things off. This will be one big thing off that list for sure. Thanks to my son, this is happening. We have looked at going for some time, but there was never a right time. He was always in school or moving or working. But, we have a little window of opportunity before he starts his new job and we've taken it. I couldn't do it without him and I just can't believe that it is finally going to happen. It will have taken 56 years to get there and I'm sure it will be worth the wait!",
        "title": "Busy Busy Time"
    },
    {
        "content": "This year, help us in spreading the word by participating in World Alzheimer's Month. September 21st is World Alzheimer's Day, but the whole month is being highlighted by the Alzheimer's Association.Click here to see what you can do to help.http://www.alz.org/wam/wam.aspIt doesn't take much -- just adding an icon to your facebook page or any of your social media outlets is one simple thing you can do.Help us spread the word, because The End of Alzheimer's Starts With Me. And You.",
        "title": "Tomorrow Begins World Alzheimer's Month"
    },
    {
        "content": "I've received so many emails and calls today.As many of you know, I am a big women's college basketball fan. We've lived in Athens for 30 years and have followed the UGA Lady Bulldogs since moving here. Our head coach, Andy Landers, also starting coaching the team at the same time, so I like to consider Andy a friend of mine.When I was first diagnosed with early on set Alzheimer's, I sent an email out to all my friends. Within a matter of hours of sending that email out, Andy called and said he was coming to pick me up for lunch, to hear all about it and wanted to know what he could do to help. Those are the kinds of friends that we all need.So, I thought of that today, when I heard the news that Pat Summitt, head coach of the University of Tennessee Lady Vols was diagnosed with early on-set Alzheimer's at the age of 59. Coach Summitt has been a big adversary of ours, but she is also to be admired for what she has done with her teams over the years. She made a video statement on the Lady Vols site today talking about the diagnosis and being very upfront about it. She sensed some relief in knowing what she had and now know what she is facing. I felt the same way -- I wanted to know what my problem was and then to deal with it. Coach Summitt has a lot of support, from her family, her fans and her UT family. She plans to continue coaching and I'm sure she will try to live as normal of a life as she can. I know she has great assistance and will get the support she needs from them and the University. I hope, that she, like myself, will have many more productive years ahead of her. She's tough, she's strong and she will make the best of her life.I have had lots of people reach out to me today -- wanting to know if I heard about Coach Summitt and what I thought. No one wishes this on anyone, but I wish her the best.Also, tonight, Glen Campbell was interviewed for the ABC News -- his full interview will be played tonight on Nightline. Mr. Campbell was diagnosed with Alzheimer's and is speaking out about it for the first time.In other news, people inquired as to how Alan did with the earthquake in DC. He said that his building which is right across from the Capitol was evacuated and then they were sent home. He walked home as the traffic was bad because everyone was trying to get home, and the metro system had slowed down. I told him he should have had a big one like this when he was living in California not Washington DC. Tonight he and Jen went down to take a look at the new Martin Luther King memorial. He said it was pretty impressive. Comedian Dick Gregory was there tonight -- he wasn't sure who he was as he is a little old for Alan to know him. But lots of people were taking his picture and he called to see if I knew who he was. I guess moms are good for something.",
        "title": "Big news day"
    },
    {
        "content": "I'm not MIA -- although I'm sure it seems it. I've been busy. I was in Atlanta a few days, then in Chicago for a few days, then to a friend's cabin at Lake Russell (Thanks Suzanne for a quiet relaxing weekend) and then in Atlanta again for a few days to watch two days of the PGA Championship at the Atlanta Athletic Club. It was all great fun, but I need time to relax and rewind. Although -- I'm off again tomorrow to another Alzheimer's meeting in Atlanta.When we were at the golf tournament, I couldn't remember anyone's name. I saw the golfers and knew them, but then couldn't remember their name. On the practice days the golfers do not have people following them around with little signs with their names and scores on them. Their names usually only appear on their bags. And, if the caddies are carrying them the way they are suppose to (and they usually do) you don't see the name because the name part is always facing the ground. If the caddie stands the bag up on the green, you have to be lucky enough to have it facing you. Luckily enough for me there were enough people around that I usually overheard someone saying their name. I know I was tired when going but it was really bad. Once I get the photos from the camera downloaded I will try to post some. Sometimes I have a hard time doing that on this blog.More soon -- and hopefully sooner not later.",
        "title": "Busy"
    },
    {
        "content": "Several people over the last few weeks have asked me if I have a bucket list. I have never sat down and actually made a list, but maybe I should. Before my diagnosis, I used to say \"before I die I want to do _______\". Then sometimes I would get into my head that once I did that particular thing I was for sure going to die. So I started thinking of multiple things so I wouldn't exhaust my list. So, maybe that is why I don't write it down. However, since my diagnosis some of the things I had thought before I wanted to do, don't appeal to me as much. My priorities have certainly changed.I've read a couple of articles lately about improving your odds of being lucky. I'm not sure that is really a true statement as I thought lucky always meant by chance something fortunate happened to you. So strategically planning something isn't by chance. But several things that may have been on my bucket list at some point have happened because I was at the right place at the right time (like meeting certain people) -- that may be considered luck -- but when I think of it I had probably put myself in a certain spot in order for that to happen even though it wasn't a conscious decision on my part. I'm not sure I'm explaining this the best way I can -- but I think of a bucket list as something you concsiously set out to do and then achieve it.Some things I've always wanted to do or have:SkydiveGo to AustraliaWin a tennis tournamentShoot a hole in oneMeet Maria ShriverOwn a red Mazda MiataHave a screened in porchBe skinnyMake a difference to someoneSome of these I've achieved, some I haven't.What's on your bucket list?",
        "title": "Bucket List/Being Lucky"
    },
    {
        "content": "I wanted to take a few minutes to point you in the direction of a few upcoming events. I apologize for the late notice on the first one, but I've been out of town a few days.1.http://www.hsph.harvard.edu/forum/andelot-alzheimers.cfmHere is a link to a webcast tomorrow (Friday, July 22 at 12 noon ET) about the value of knowing about an early diagnosis of Alzheimer's. Here is a description I was forwardedOur upcoming webcast event, “Alzheimer’s: What is the Value of Knowing Early? A View Across Five Countries” presented in collaboration with Reuters will focus on the public’s perception of the disease, where the medical and scientific communities currently are with testing and treatment, and what governments in countries around the world are doing to address this growing public health crisisIf you go to the link you can post questions for the panelists.2. The National Alzheimer's Project Act (NAPA) is seeking input from people that have been affected by the disease. Many states are holding input sessions. (Ours in Georgia is on Saturday August 13th). To find a town hall meeting/input session in your area go tohttp://napa.alz.org/and click on the events tab. It will bring up many of the input sessions across the country that you have a chance to participate it. This is our chance for us to be heard. Please take a moment and check it out -- we don't get this opportunity very often, so please take advantage of it.",
        "title": "Several Opportunities for You to Share"
    },
    {
        "content": "Right now the Alzheimer's Association International Conference is taking place in Paris, France. You have probably seen some news stories about some of what is coming out of the conference. Here is a link to the page where you can catch up on the latest developments.http://www.alz.org/aaic/",
        "title": "Alz. Assoc. International Conference"
    },
    {
        "content": "Another Alzheimer's related story on StoryCorps. Thought you might like to listenhttp://storycorps.org/listen/stories/betsy-brooks-and-john-grecsek/This ran on NPR sometime late last week. I've written about StoryCorps before and it's worth listening to!",
        "title": "StoryCorps"
    },
    {
        "content": "It's 3 a.m. and I can't sleep. This doesn't happen too often for me, but I thinking I am coming down with a cold and I just don't feel real well. So, I'm up and thought I would write a few words.A few people I know are going through some \"transitions\" in life right now. Different circumstances for all of them, but transitions just the same. I got to thinking about how we perceive these times in our lives. Some take the bull by the horns and run with it, some fear change, some try to change their course and others just take what comes along. I think over the years I have tried all of these things. But, in the end, they weren't things I could control so the effort I put in didn't really matter because it was going to turn out the way it did for better or worse. It's funny how we envision things happening and then see the how they really happen.It's not what we thought it would look like at all. Kind of like thinking we knew the end to a good book and it didn't turn out to be anything like we thought is was going to be, but it was a good ending anyway. Or thinking that we found a missing piece of a puzzle only to find out it really wasn't the right one and the one we were looking for didn't seem to be the right fit the first time we looked at it. I know the people that are dealing with this right now will all make it through their respective transitions, but they might not believe they will. Things will work out and perhaps not in the way they envisioned them, but they are strong people and they will make it work in the end. It's hard to see when you are in the midst of it, but it will.For those that know me, I don't make lemonade out of the lemons, I just eat the lemons!",
        "title": "Lemons vs Lemonade"
    },
    {
        "content": "Yes, it has been awhile since I last posted. My husband was gone for a week and I must say that I took advantage of the peace and quiet at home and tried to do lots and lots of things around the house. I didn't get near as much accomplished as I had wanted because I can't seem to concentrate that long anymore, but I got some things done and I thoroughly enjoyed my \"alone time\".I've also had a few writing projects I have had to do lately. And, that hasn't been going so well. Can't quite seem to get those words down on paper and it gets me so frustrated. I don't know how many times I start and stop while still in the end having to ask for help. I might as well ask for help up front and be done with it -- but that is that stubborn independent streak I'm not willing to give up just yet!",
        "title": "A while"
    },
    {
        "content": "Last night, my good friend Carol and I went to Atlanta to a fundraising event for the Alzheimer's Association -- Dancing With The Stars. The event was great, had over 500 people in attendance and raised over $225,000! Great job by everyone! Former Atlanta Mayor Shirley Franklin won the dance contest. It was a great night and great effort by everyone involved. Thanks to Carol for being my date!",
        "title": "Dancing With The Stars"
    },
    {
        "content": "I'm back home after five days in DC. It was nice spending time with my son and daughter-in-law, but my main purpose there was to attend the Alzehimer's Association's Advocacy Forum. We spent one whole day on Capitol Hill talking to our legislators and their aides about the two bills I mentioned in my post below. Reaction was good and hopefully we will see some movement on these bills in the near future.I was also able to meet many folks who belong to a Facebook group called \"Memory People\". It was started several months ago and has almost 700 people in the group. Had I thought about it before, I would have planned to have a \"meet up\" with everyone, but as word spread that some of the group's members were there we were able to meet. At first the Facebook group started out with just those with Alzheimer's and has grown to include caregivers as well. It is a closed group and you need to be invited to be a part of it, but if you are interested in it, please leave me a message with your email address (I won't publish it) and I'll get back to you.My husband accompanied me to DC but didn't go to the meetings with me. He says it depresses him. I understand that -- it depresses me too, but I get through it. Having him with me was hard. Hard from the standpoint that I can only process so much information at a time. Usually when I go to these meetings, I'm able to go to my room at night and not have to talk to anyone, not have to listen to the television blaring and just have some down quiet time. When you are sharing a room, that is hard to do. I couldn't really relax or wind down before it was time to go to another meeting. I know I only absorbed about half of what was said because my brain was on overload, but I was there. I also worried about what my husband was doing, when and where to meet him, etc. Plus, as you know from my other posts, he worries about everything -- the weather, the cab fares, the restaurants, you name it he worries about it. And he doesn't just worry silently -- he has to share with me. I've lived with it for over 30 years -- i should be used to it right? Again.....slow learner!I encourage you to hop on over the website for the Alzheimer's Association and check out what happened at the Advocacy Forum. And, if you aren't already an advocate -- I hope you would consider doing it. It doesn't take much time, and we need you.Another site I would encourage you to go to ishttp://www.alzimpact.org/. Alzheimer's Impact movement (AIM) is a nonpartisan, nonprofit advocacy organization working in strategic partnership with the Alzheimer’s Association to make Alzheimer's disease a national priority. There's lots of great information on the site about current legislation and issues that are vital in moving our cause forward \"A World Without Alzheimer's\"",
        "title": "Washington DC Part Two"
    },
    {
        "content": "is a book written by Marianne Talbot. The book deals with caring for someone with dementia. Ms. Talbot tells the stories of caring for her mother in a truly unique, humorous and loving way. For all of my readers out there who care for someone with dementia, it's worth reading. You're not alone although I know you feel it sometimes. Believe me, the person with dementia does as well. Ms. Talbot's book starts out with the definition of \"piglet\" which she uses throughout her book. She borrowed it from another writer, but the word \"piglet\" is used throughout the book to stand for the person being cared for. It stands for \"PersonIGiveLove andEndlessTherapy to\". It took me a little while to get used to this word in the book, but before long I caught on -- yes, I'm a little slow to new ideas.The book deals with all phases of dementia as well as most phases of care-giving....from in home care to nursing home care. The author has friendly tips all throughout the book in dealing with her \"piglet\" to dealing with other family members. In the back of the book she offers practical advice on dealing with the stages of dementia.But it is humorous and warm and filled with compassion. If you are a caregiver, please look for this book. You'll see yourself in it, you'll have dealt with the same problems, and you'll feel like part of a community.One word of note -- the book was written in England and many of the references deal with British agencies, laws and legal issues inherent to the British ways. You will probably find something comparable in the country you live in, but there are lots of British references.Thanks to Ms. Talbot for having the courage to write such intimate details about her life and her relationship with her Mum. Knowing I am on the other side of the coin made me feel bad, knowing what my family has to look forward to. I'm not sure I could be a good caregiver if I had to be, but you never know I guess until you are facing it. God bless all the caregivers out there -- you are heroes in my book!",
        "title": "Keeping Mum"
    },
    {
        "content": "I'm in Washington DC right now. I'm getting ready in a few minutes to head to capitol hill for meetings with legislators and aides to ask for more funding for Alzheimer's research. It's a rainy day here in DC . I'm at an advocates forum and this year over 600 people are here. Over 300 of these people are here for the first time -- that says a lot! We are here to help get the Alzheimer's Breakthrough Act passed as well as the HOPE act which insures a care plan for those with an Azlheimer's diagnosis.Yesterday, Melody Barnes spoke to our group at lunch. She is the Director of Domestic Policy for President Obama. Imagine my surprise when in the middle of her speech she mentioned my name! She then began to quote from an article I had written for The Shriver Report. I was shocked when I heard my name mentioned by her. My cell phone started buzzing with text messages from others in the room commenting about my mention. It was a little embarassing but I was humbled at the same time. I guess the administration is looking at lots of sources out there on Alzheimer's. I've also met some folks from the Facebook Page Memory people. Many of them are here for the first time and are enjoying their experiences.Have also had a chance to spend time with my son and daughter-in-law while in DC. More when I return.",
        "title": "washington DC"
    },
    {
        "content": "I received a comment on my post below. It is from the cousin of the young man who got up to dance with his aunt. Thank you Ms. Reynolds for sharing this lovely story. I didn't want to just post this in comments, as many of my readers don't always read them. So, I hope you don't mind. And, speaking from someone that has Alzheimer's -- I know that this certainly meant a great deal to your mom. We should all wish for such a \"touching moment\" in our lives.I came across your blog and thought I'd tell you the story behind that \"touching moment\". The couple you saw dancing was my mom and my cousin (he's more like her grandson than nephew as his father is my father's baby brother). \"Look At Us\" was my parents song from the day they heard it until last year when Daddy was snatched away from us following a tragic accident. Mom has Alzheimers and Daddy was taking care of her. She now lives with me, my husband and daughter. On April 29, 2003, 3 days before my parents' 50th anniversary, my niece had gotten front row seats for my parents and aunt and uncle (parents of the young man you saw dancing) to go and see Vince in Sarasota, Florida. We had made them a sign and my aunt gave a letter to a security guard before the concert asking that Vince sing \"Look At Us\" for my parents. Not only did he sing it for them but he brought them up on stage and they danced on stage while he sang. It was a moment that is one of my mom's most treasured memories and one that Alzheimer's hasn't touched. Before Daddy died he promised Mom he'd take her to see Vince one more time. When my cousin heard on the radio that Vince was coming to Macon and it was an Alzheimers fundraiser he called to let us know and I bought tickets the day they went on sale. We knew this was orchestrated by God as it was 3 days after Daddy's birthday and Mom and Dad's anniversary and with Mom having Alzheimers we knew how special this opportunity was. Both of Daddy's sister's, his only living brother and his wife, their son,and my husband and I were there with Mom. We didn't tell her where we were going and she was so surprised and excited when she picked up the program from her chair. My aunt and I had written Vince letters and I gave them to the guitar player when he was tuning he guitar before the concert. If you remember Vince dedicated the song in memory of Dennis Segars - my dad. So now you know...... the rest of the story. Vince Gill is an amazing person that has given my mom and my family 2 of the most precious memories and I will forever be grateful to him for taking the time to read a letter and then having the compassion to touch the lives of people he's never met in such a special way!!",
        "title": "Vince Gill Story Part Two"
    },
    {
        "content": "Tonight I was in Macon for an Alzheimer's Fundraiser featuring Vince Gill. I'll post some photos soon, however, one very touching moment during the concert is when Vince played \"Look At Us\". I noticed a young man (late 20'as I would say) get up and an older lady followed him. I guess she was in her early 80's maybe? Anyway, the young man, took the lady in his arms and started dancing with her. I'm sure it was his grandmother or something, but it was so touching. It brought a tear to my eye. Several people got up to take their photo and when Vince Gill finished his song there were lots of women around that young man clapping for him and his partner. I shed a tear at that, too. How many young men would do that -- with 2,000 people in the room!",
        "title": "Vince Gill - Macon"
    },
    {
        "content": "Larry King did a special on Alzheimer's Sunday evening. You can find more about it herehttp://www.cnn.com/SPECIALS/2011/larryking/I recorded it and watched it this morning. It's very informative for those not knowing a lot about Alzheimer's. If you are already dealing with Alzheimer's you probably didn't learn much, but it was a good overview. Enough to get people talking some more about the disease. We can't stop talking about it!",
        "title": "Larry King Special"
    },
    {
        "content": "In a few weeks I'll be joining hundreds as we go to Washington DC to help lobby our legislators for more support for Alzheimer's Disease. In light of this, I'm asking for your help. There are several things you can do. One of the things that we will be asking support for is the HOPE for Alzheimer's Act. It stands for Health Outcome, Planning and Education for Alzheimer's. This will help with early and accurate diagnosis and information for familes dealing with this deadly disease.You can read more about it here -- including the legsilators that have actually signed on as a co-sponsor of the bill.http://www.kintera.org/site/pp.asp?c=mmKXLbP8E&b=6301189THEN -- you can go herehttp://www.kintera.org/siteapps/advocacy/ActionItem.aspx?c=mmKXLbP8E&b=6742875&auid=8213583&tr=yand send your legislators an email asking them for their support. It's only a few clicks people and it will certainly move our cause forward.Another item worth looking at: A new report put out by the Alzheimer's Association regarding Baby Boomers and the impact this disease will have on everyone! It's important information so please take a few minutes to look at it if you have a chance. You can find information about the report here:http://alz-news.org/And, lastly, for now, some of you may have seen that CNN is airing a special on Alzheimer's Disease on May1st. It is hosted by Larry King. It's on Sunday night, May 1st at 8:00 p.m. ET. Here is a short piece about it from CNNhttp://www.cnn.com/2011/HEALTH/04/27/seth.rogen.alzheimer/Thanks for reading and helping!",
        "title": "Washington DC and other things"
    },
    {
        "content": "Last night I caught a few minutes of Hallmark Hall of Fame movie, Beyond the Blackboard. And, while I didn't catch all of the movie, I caught many of the commercials. My mom used to say that I would always watch the commercials and leave when the shows were on, so I guess I come by that honestly. And, I worked for an advertising agency for many years, so yes, I'm into those commercials. One thing about the commercials last night was that Hallmark showed a current commercial and then a commercial from twenty or thirty years ago. The fact that I actually remember some of the old commercials was amazing.One of the commercials depicted a woman looking into an old box with cards that her children had given her over the years. This tugged at my heart strings for a bit, because, what mother doesn't do that? Don't we all save things our children have made or given us at one time or another? I know we can't keep everything, but I'll bet that most moms that are reading this also have a little treasure box tucked away where they can go and get some of those special treaures from their children (or other loved ones). I know I do. Quite often I find myself going back to \"my box\" because I don't know when I am going to forget those things. I think,too, that your children don't realize how much those things mean to you until they themselves become parents. I think about the elctronic age (yes I realize I am writing this in the electronic age) we live in and how in the not too distant future cards (like books and newspapers) will become a thing of the past. It's not the same printing out an email as to when someone takes the time to sign a card or write a note. I know I have written about this before, but the Hallmark commercial last night had me thinking about it all day today.Please think twice when the next holiday or event comes up and you quickly type that email to a special person. Think how much more it would mean to them to have a hand written note they can cherish. I hope that never goes away.And, speaking of special things, my two \"surrogate sons\" that I have talked about so much on my blog, have both found out that their wives are expecting babies and within two weeks of each other. One found out today that they are having a girl. The other couple doesn't want to know. I'm so excited for them.",
        "title": "Memories"
    },
    {
        "content": "I just received this information about new guidelines for Alzheimer's Disease Diagnosis. I haven't had time to digest it all yet, but I thought I would put the link up anyway.http://www.alz.org/research/diagnostic_criteria/overview.asp?type=homepageflash",
        "title": "New information"
    },
    {
        "content": "It's 91 degrees today April 10th -- what will July be like?",
        "title": "April or July?"
    },
    {
        "content": "This event is being held in Washington DC next month. I plan on attending and having my voice heard. If you are reader of my blog, and are planning on attending, leave me a message or shoot me an email and let me know. If you have never been, I would seriously urge you to check it out. This a chance for us to find out what the status of things are in Washington that affect the way Alzheimer's is being researched and how it is being funded. We need everyone's voice. For more information here is a linkhttp://alz.org/forum/",
        "title": "2011 Advocacy Forum"
    },
    {
        "content": "I've been getting out a little more since my knee surgery -- trying to get my stamina back. I am still prone to swelling when I'm up on my knee too much so I have to watch it, but it is coming along. Yesterday, I went out to pick up a few things at the store. I had some coupons and there were some specials going on at the office supply store I was at. When I was looking at what I wanted to buy, I couldn't figure out what the best deal was. Should I buy more than one with my coupon? some items were buy one get one free, was that a better deal than what I went in there for? Too many choices and too many variables for my mind to wrap around . Since I was looking at an item with a relatively high ticket price I didn't want to make a mistake. The sales people kept asking me if they could help me and I was so confused by everything I couldn't even explain what I needed to tell them or ask them. I know I stood there for a very long time trying to figure it out. I know that it was probably something very simple, but I just got so frustrated I left the store. Why do I keep putting myself in these situations? Because I want to be able to do it and I used to be able to do it. I have to keep telling myself that I am not stupid......Simple things can be difficult for those with Alzheimer's.",
        "title": "Confusion - why do I do this?"
    },
    {
        "content": "I'm having trouble letting things go that seem to bother me. I hate it, because I'm one to say, \"get over it, life is too short\". So, I guess I am admitting that is harder to do than say. I think because of my Alzheimer's I'm overly sensitive and maybe that plays into it. That's not an excuse....I think I need to categorize those things that bother me and see if they are even worth the time to think about twice. I think I can do that, but I know it will take some time,",
        "title": "Letting Go"
    },
    {
        "content": "I write this with tongue in cheek -- those of you that know my husband knows that he is a man of few words. I often joke that he doesn't say 20 words in twenty four hours. But, a couple of days ago he talked to his brother on the telephone for over 2 and half hours! I didn't know he had it in him. I told him he didn't talk to me that much in two months!",
        "title": "He Does Talk"
    },
    {
        "content": "about a lot of things. One is posting to this blog. Some of my friends have one day week where they devote to writing something in their blog and they give it a name, i.e. Mindful Mondays, Terrific Tuesday.....you get the drift. Maybe I will have to resort to that. My knee is healing. That's a good thing. Most of you that know me, know that I am not a real patient person and of course I want to be all better, right now. But, that ain't happening. But I have started walking around the house without my cane, am doing physical therapy three times a week. I started driving this week -- o.k. only to therapy but it is a start. I still have a difficult time sleeping but hopefully that will get better as well. It's coming along....just slowly. A dear friend dropped by this morning with dinner for us. She is someone I have known for close to twenty years. Our paths first crossed when she was working for the local newspaper and she covered some of the work I was doing special events for Downtown Athens. We kind of drifted apart as our jobs and lives took some twists and turns. But we've picked up right where we left off several years ago when we both made an effort to get together. You know how it is -- one will say \"we need to do lunch\" or \"we need to go have coffee\" and then you never do. Well, we finally did and I'm so thankful for that. Thanks for being a great friend Meg -- I love you! Mentally, I haven't been feeling real good. I think basically because of the limitations my knee has given me. Hate being housebound and feeling useless. Plus, it has been raining for about the last 5 days and it has just been dreary. But, I probably turned somewhat of a corner this week. I am finally able to wear \"regular clothes\" -- mainly meaning my jeans/slacks/pants. I couldn't before because my knee was so swollen I couldn't get the pants on over my knee. So, I have been living in sweat pants or shorts and it has been a little too cool for shorts. Getting dressed in real clothes has helped me mood a little. And, since I have started strenuous therapy I at least am able to ride the stationary bike to get my blood pumping! This also helps with my mental attitude as well as helps me think clearer. I realized some time ago that there is definitely a connection between exercising and brain function -- or at least there is for me. I definitely do better dealing with my Alzheimer's when I am exercising on a regular basis. Remember, whatever is good for your body is good for your brain! Here's to getting better faster!!!!",
        "title": "Want to get better"
    },
    {
        "content": "I know this is rambling today because I can't wrap my thoughts around this. People's actions or inactions as the case may be drive me crazy.My mom and I never really got along as I was growing up, but she did teach me to be decent and kind to other people. I also met a young man in college that had a big influence over me -- he was such a giving person and he taught me that doing for others made you feel good. And, it does -- or at least for me anyway.So, when people say they are going to do things, they should do them, or at least let you know that they aren't.It amazes me how people expect certain things from you and just take this for granted. I do things for people because I want to, not because I'm suppose to. There's a big difference there.I know this post probably doesn't make much sense to you, as I said I am rambling. I just needed to write it down!Sometimes, these posts, can't be about Alzheimer's. There is more to life, and life is too short.On another note, my staples are out and physical therapy is in full swing.",
        "title": "Rambling"
    },
    {
        "content": "I'm going to the doctor today to get the staples out of my knee.  It looks pretty ugly, but I guess I am progressing o.k.  Physical therapy will take awhile but I'll get there eventually.It's been so nice out that I'm planning to at least get some fresh air in the next couple of days just by sitting outside.  Even if I can't walk, I can at least enjoy the beautiful weather.Today, the head of the nuclear regulatory commission was on tv discussing the radiation situation in Japan.  I'm not sure I could have told you this gentleman's name, as he doesn't get much press and that is probably a good thing.  But I had to laugh, as my son Alan was looking at colleges he was saying that he either wanted to be \"head of the nuclear regulatory commission, or write speeches for the president\". Go figure. He turned out to be an attorney -- not sure where that fits into this but I'm sure he is rolling his eyes if he reads this!",
        "title": "Different things"
    },
    {
        "content": "I haven't had a chance to read this yet, but the Alzheimer's Association has just released their annual Facts and Figures -- you can get ithttp://www.alz.org/alzheimers_disease_facts_and_figures.aspAlso, it's Alzheimer's Day at the Georgia State Capitol.  Hope all goes well -- wish I could be there -- but certainly am there in spirit.",
        "title": "New Facts and Figures are out"
    },
    {
        "content": "has started on my knee.  The day after I got home from the hospital the physical therapist was there and they are back today -- ten visits by the end of the month.  I go back on thursday to get the staples out of my knee.  I'll feel better doing therapy after I get them out, as when I feel something kind of \"pulling\" I'm not sure if it the incision/staples or just normal.Friends have been great to bring over meals to help my husband out. I really appreciate them for doing that.  Now, if I could just get some folks to volunteer to come clean my house!  Why is it that whenever you are sick or incapacitated that your house always looks messier -- or maybe it is just me.  But, I mopped and cleaned the kitchen floor before I went into the hospital and it is already dirty.  Ralph use to complain it was me spilling coffee and food in the kitchen that made it dirty -- but now I know that is definitely not the case since I haven't been in the kitchen!  Oh well -- having a dirty kitchen floor is the least of my worries!The weather is beautiful here.  Wish I could go out and enjoy it.  My allergies are so bad that I'm afraid if I even go out and sit in it at this point it wouldn't be good.  But, before the week is out I know I will have to get out -- I don't want to be cooped up all day long every day!",
        "title": "rehab"
    },
    {
        "content": "Thanks for everyone's well wishes -- I'm home from the hospital with a new knee.  Surgery went well, glad to be home.  I have a big scar, but hopefully, the result will be worth it!  More soon.  KrisPS Thanks for the note from Tamar's class at UGA -- I apreciate it!",
        "title": "Home from the hospital"
    },
    {
        "content": "What a classy lady Maria Shriver is.  After the Shriver Report came out, she was nice enough to send me a hand written note, thanking me for my contribution.  I sent a condolence letter to her after her father passed away from Alzheimer's not too long ago.  Then, yesterday, in the mail I receive a handout that was given out at the funeral for her father, as well as a personal note.  How thoughtful of her. Thanks to her for helping move our cause forward. I would love to meet her one day.",
        "title": "Classy"
    },
    {
        "content": "I'm in Nashville with friends for the women's  SEC basketball tournament.  One day, when theUGAwomen weren't playing my friends took a little side trip and I found myself alone in Nashville.  Lots of things within walking distance from the hotel, so no problem. Except......the little problem I have about crossing streets by myself.  I know, it sounds silly and stupid. But, if you think about it, we don't cross the street by foot much anymore.  We pull up to the grocery, or the bank or wherever we are going and then walk into the business.  Or at least, that is the way I usually do it.  I don't find myself having to walk too far on the streets in Athens.  So, I ventured out into the streets of downtown Nashville and came to my first cross walk. I panicked. I forgot that this is a problem for me......mainly because I don't usually do this and normally I have someone with me.  The problem is that there are too many conflicting signals for my brain to decipher.  Thwe blinking cross walk sign, the traffic signals and traffic noise don't move smoothly through my brain.  They collide into a huge mass of confusion for me. I don't trust the other people walking (because I don't know them) and that people walk when they are not suppose to.  I didn't want to turn back the block or so that I had walked from the hotel so I thought I would venture on and see what I could do by myself. Sometimes, I am just determined to do it come hell or high water!  I stood at the corner for a good while before deciding to move.  I only went across the street when there wereabsolutelyno cars coming.  This, by the way, was after the lights had cycled maybe three times. I'm sure if there was someone watching me they were thinking this lady is a lunatic.Down the next block I saw an officer and thought I could ask for his assistance at the next block -- which I did.  All the while thinking, what happens if this police officer is not here when I come back?  I always try to think of a contingency plan -- and it is so odd that I can usually come up with something to work (for now anyway) but I can't figure out how to get across the street!  Anyway, this officer was very friendly.  I explained my situation to him and he told me that in the direction I was going there were police officers on every corner because of the high volume of people in town --- thank you Nashville!  I ran into one officer that was on asegue wayand he helped me for several blocks.  After walking around for an hour or so, I made my way back to the hotel with help from mainly the men in blue.  But, I haven't ventured out alone to walk since then.  I have stayed in a pack with my friends and they help me get by.Just another adventure in the life of someone with Alzheimer's.",
        "title": "Nasvhille"
    },
    {
        "content": "One of my best friends from Illinoisduaghterwill be having a baby soon.  I can't believe she is going to be a mother. She and her husband will make excellent parents, but I guess I just get to feeling old and sentimental when I think about it.  I remember when my friend first found out she was pregnant with her daughter -- its a long and funny story but it was over thirty years ago and it seems like just yesterday. Anyway -- my best and all my love to Rachel, Mark and the new baby soon to be here.And, two of my favorite friends -- I like to think of them as my surrogate sons, announced recently that they and their wives are soon expecting a baby. Their due dates are just weeks apart and it will be truly amazing seeing these guys go from husbands to dads -- but they will be great.  I'm so happy for them.On another note, I spoke to anotherpyschologyclass on campus atUGAthis week about Alzheimer's.  The professor gave me some questions that her students had the last time I spoke to give me an idea of some of the their thoughts.  They were certainly interesting and I will try to keep them in mind the next time I speak to a group.  Thanks Tamar for having me and best of luck to you in your studies!Next week, I'm going to get a new knee! Yes, it's time for it. I'll be in the hospital for a few days and thenrecuperatingfor a few months. I'm not looking forward to the rehab time, but I'm glad to get it over with.  I'll try to be better about blogging in the next week or so, as I'll be MIA for awhile after that.  The one thing that had concerned me was going under anesthesia, as that from what I understand, can be an issue for those diagnosed with Alzheimer's.  However, it appears they will be doing an epidural for the procedure so hopefully that will be much better.Oh -- and after I get back on line, I'm going to try to be better about posting on aregularbasis even if the words don't come out like they should!  I have many friends that have blogs that keep on task by coming up with weekly \"issues\" of their blogs by calling them, \"Truthful Tuesday\" or \"Wacky Wednesday thoughts\" -- you get it.  I'll just have to try to come up with something clever -- and I'm all for suggestions.",
        "title": "Babies"
    },
    {
        "content": "After several years of emailing, and corresponding, I finally got to meet Lisa Genova, author of Still Alice and Left Neglected.  If you have been reading this blog for long, you know how I have raved about her books.  Still Alice deals with Alzheimer's disease and that is how I first became aware of Lisa. Her second book which just came out deals with a neurological condition called Left Neglect.  It is a very interesting disorder and almost hard to believe.  But, her book certainly describes it well.   Lisa was at a Book Festival in Savannah Georgia and I took the opportunity to go hear her speak.  She was gracious enough to give me some of her free time while she was there and I so appreciate it.  I'm glad we finally got to meet in person after being \"cyber friends\" for so long.  Hope all went well with the rest of the festival Lisa and thanks again for sharing your time with me!",
        "title": "Finally"
    },
    {
        "content": "Everyone that knows me, knows that a red Mazda Miata is my dream car. My daughter in law sent me this photo of my son in a red Mazda Miata at the DC car show. This is so wrong -- it should be me in that driver's seat!",
        "title": "Mazda Miata"
    },
    {
        "content": "I've been looking at some blogs lately of people I know and I feel so inadequate after reading theirs. They all sound intelligent, well thought out and put together. Mine, on the other hand, are disconnected and jump around from thought to thought. I find that I want my friends to write more so I can read more. I'm not amazed by what they right, I guess I'm amazed at how effortless it probably is for them (and maybe it's not, but they've fooled me). It seems they put lots and lots of thought into what they are going to write so it really has a story -- with a beginning, middle and end. I used to fuss at my son when he was writing for school projects about having the beginning, middle and end. Now I can't seem to find those things myself. So, I appreciate all those that still read this blog, because a lot of times I do just ramble......without structure.....random thoughts that pop into my head -- have to write them quickly or they pop out just as fast. Having said all of this, I want to share an experience I had yesterday and you may have to weave it all together, but it means a lot to me.Yesterday was one of those days where it was cold and rainy. A day where you wanted to stay inside and read a book or take a nap. But, I had plans to go out and meet some old friends for lunch. I met these ladies thirty years ago. That's shortly after we moved to the south. My husband had been transferred and when he transferred many of the same people he worked with up north transferred along with him. So when he went to work here, it was kind of like working where we used to live, because although he was in a different building, he was doing the same thing and working with the same people.I, on the other hand, was the new wife, moving to a small town, had no job and knew no one. So, we joined a small community country club -- and when you think of country club, I'm sure you are not thinking of this one -- no white table cloths, no exclusive parties, no high initiation fees, no valet parking, no waiting list to join. It was an affordable one for what we wanted to do --which was mainly play tennis. There was a golf course and a swimming pool, but our main focus at the time was to play tennis. We paid our modest amount of money to join and bought basically the \"tennis package\" which allowed us to make reservations for a court and play about as much tennis as we wanted.We slowly began to meet other people that played tennis and before I knew it I was on a tennis team. Then, I was on two tennis teams. Then I was playing in some socials....and you get the drift. The ladies that I played with became my newest best friends. It was my \"community\" at the time. I didn't realize what an important part of my life these people would become. We seemed to live at the tennis courts and traveled together for matches. As we each had children, we started bringing them to the courts where the bigger ones would watch the smaller ones. We came from different backgrounds, different counties and different cultures. But we were all a family on the tennis court -- even though we liked some strong but friendly competition.Over the years, one by one we stopped playing tennis, or we stopped playing in league play. We all had our reasons, whether it be family, injuries, returning to work or whatever. But, those 25-30 people that became my community back then, still surface from time to time and we picked up where we left off.That's a long way of saying, that yesterday, I met two of these ladies for lunch. One I had not seen in probably twenty years, the other, I have just recently gotten back in touch with and renewed that friendship. It was great catching up with both of them and I realized how lucky I was (or am) to have these women in my life. It didn't seem like we missed a beat in picking up our conversation -- like we were talking over the tennis net. Although we have lost touch over the years, they (and all my tennis buddies) are people I know that I could pick up the phone and ask for help if I needed it. We all need friends like that. I hope they consider me to be just as an important friend to them.  I thank them for being in my life.I can remember times my son and I would be out shopping and I would run into one of my tennis friends and introduce Alan. Many times he would turn to me and say \"Mom, is there anyone you haven't played tennis with?\" It always made me smile. I would reply \"Of course, there is -- but this lady was a friend of mine, too\". They were all friends and \"my family\" as well.We all have our own little communities and they change the way we look at things. Sometimes we forget that our friends help shape who we are. I'm glad I have the friends I have....even if I don't see them as often as I should.",
        "title": "Blogs and Friends"
    },
    {
        "content": "It's been awhile I know.  I just haven't had luck getting my words out right lately.  I did an interview with a young student yesterday from UGA for a journalism class that she was doing.  I did awful -- I didn't even make sense most of the time.  I guess it will give her a chance to use her editing skills.  I knew exactly what I wanted to say, but couldn't get it to come out the way I wanted it to.Since I last wrote, Ralph was in St. Louis for almost a week for a family funeral. It was nice to have the house to myself.  Alan and Jennifer visited Jen's sister Christine in Chicago over the MLK weekend, and they also got to visit with my friends the Atterberrys. I went to Alabama for a women's basketball game and am going to South Carolina this week for another women's game.Thanks to all that have commented lately -- it's interesting to see what people have on their minds.  Thanks to to Barry Petersen for making my friend Suzanne a very happy lady! You made her day.I'm having a partial knee replacement done next month. Not looking forward to it -- more on that later.",
        "title": "This and That"
    },
    {
        "content": "So far we have 6.5 inches of snow on the ground -- according to my ruler of course! For the last few hours we have had sleet and freezing rain.  Schools/businesses have been closed all day and they are already scheduled to close tomorrow. It's just not suppose to do this in the south! We are hoping that we don't get much more freezing rain, as we certainly don't want the power lines to come down.  We've been there before!",
        "title": "Snow"
    },
    {
        "content": "is a new book out by Lisa Genova.  Lisa is my friend that wrote the best seller Still Alice about a young woman with Younger On Set Alzheimer's.  Lisa's new book is about a woman who has a condition called \"Left Neglect\".  It is where a person with this, does not recognize his/her left side.  Lisa first told me about this condition a year or so ago when she was working on the book before Still Alice even came out.  I was intrigued with it and looked up what I could on-line.  It's a very interesting brain disease. I'm sure this book will bring loads of attention to Left Neglected.As I said with Still Alice, run to the bookstore to get this book, don't walk.  I was mesmerized by it and it is an easy read -- even for someone with Alzheimer's.   And, while I don't suffer from left Neglected, it is a brain disease just as Alzheimer's is.  And, like I could relate to Alice in Still Alice, I can relate to the character in Left Neglected, Sarah.In the book, Sarah has a car accident and ends up with a brain injury - Left Neglected.At one point in the book she is working on her physical therapy and her son is by her side.  Her son has Attention Deficit Disorder and while he is working on his homework, he declares himself stupid because he can't get his homework right.  Sarah asks him if he thinks she is stupid because she can't do some things right.  He tells her no.  Then Sarah says, \"Right. Neither of us is stupid. Our brains work in a different way than most people's do, and we have to figure out how to make ours work.  But we're not stupid, okay?\"  How this hit home......I feel stupid a lot of times because I can't do some simple things.  It's easy to say your stupid, even though you're not. I guess it is the easy way out, but I fight this on a daily basis.In another instance Sarah remarks on all the changes that have been thrust upon her in the last few months....getting used to it and redefining \"normal\".  I feel like I redefine the meaning of normal everyday!In another instance Sarah talks about being helpless. She is crying to her mother that she doesn't want to be helpless. Her crying intensifies as she says the word helpless.  Her mother tells her she is not helpless, she just needs some help. They are not the same.\"  I had to really stop and take a deep breath over this one.  While I am not helpless (now) I know I need help and it is hard to ask for help.  But there is a difference and I need to recognize that and keep moving forward.Thanks, Lisa, for writing this book. You have another winner on your hands.",
        "title": "Left Neglected"
    },
    {
        "content": "was signed into law yesterday by President Obama!  Thanks to all who helped support this and asked their legislators for their help.  Here is a link to the full story on the Alzheimer's Association website.....http://www.alz.org/news_and_events_Obama_signs_NAPA.asp",
        "title": "National Alzheimer's Project Act"
    },
    {
        "content": "Something I like most about the holidays is hearing from everyone through Christmas Cards. I know a lot of people have stopped sending cards in favor of electronic greetings. But I love seeing the photo cards that come in the mail and can't believe seeing everyone's children or grandchildren growing up so fast. And, I like hearing about what everyone has done the past year. Staying connected with people is important to me. And, I appreciate the cards I get each year --that people are still willing to keep in touch with me. Then, out of the blue, I'll get a phone call from someone I haven't heard from in a very long time. That happened again yesterday, when Patty Smith called me from Falls Church Virginia. Patty was on the Alzheimer's Association Early Stage Advisory group several years ago. Patty and her husband were also the driving force behind the Alzheimer's Association getting a multi million dollar grant from the American Express company for the Alz. Association. How nice it was to talk to Patty and hear her voice. That meant a lot to me. I also heard from other former advisory members over the holidays that I haven't heard from in awhile.The holidays were a little more trying for me this year. I think a lot played into it, but I must do a better job of pacing myself, as well as not trying to get so overwhelmed. The latter is a little harder to do because you never know when one of those simple projects you start, are going to turn into something different -- thus the result is not so good. But, I guess I need to relish in the fact that I cans till do so much -- although not happy with the outcome much of the time.My son and daughter-in-law were here over the holidays. I'm sure you have figured out that is them above. It was nice to have them home. I really appreciate the effort they take to get here -- with traveling during the holidays. Luckily the snow we got in Georgia and the snow up the east coast didn't get them stranded anywhere with the times they were flying.The new year brings on lots of new challenges for me. I think I need to look at them more as opportunities to keep me going.Thanks to the UGA Pyschology class I spoke to for the lovely note they sent to me after speaking to their group. One of my followers asked what type of questions they asked. Some wanted to know if I still drove, how did I deal with the fact that I could no longer do things I once did everyday. I shared with them how I had a difficult time crossing the streets in large cities because of all the signals flashing at once and this was a little hard for them to understand. And, when I told them how difficult it was for me to talk on the phone and that I relied heavily on email and they asked if I was able to utilitze all the new technology with smart phones, texting and the like. I told them that I had a hard time learning new things and had a difficult time with all the new \"lingo or abbreviations\" they used now! Although, my old phone does not have a regular keyboard -- I'm still relying on the phone key pad and that takes me forever to text a message to someone. It's interesting to hear the questions that the students ask. The older students have a different perspective on things. Most everyone in the classes I speak to though have known or do know someone with Alzheimer's so they can relate in some way to what I am saying. I think the most awkward question was when someone asked me how Alzheimer's affected my sex life!Happy New Year to all!",
        "title": "Happy New Year"
    }
]