[
    {
        "content": "It's New Year's Eve and all is quiet.  Alan went out to lunch with a friend. Ralph is in St. Louis -- his sister-in-law passed away a couple of days ago and he drove up for the funeral.  This was his brother Tom's wife and it is very tragic.  Not only to pass away at the holidays but to pass away so young -- she was in her late 50's and had cancer.  She got extremely ill very quickly.So, it has been a bittersweet holiday.  It has been nice having Alan home -- since he has been studying for final exams we haven't been doing a lot. He has been very very good and staying in his room and studying.  It's very hard for me to not go into his room when he is studying and I have probably interrupted him more times than I should have!But, because he has been so \"quiet\" I have found this holiday to not be too bad.  Usually we are doing a lot more and I get more tired.  But, this has been a good one on that side of things.Well, I guess while the house is quiet I'll try to retire for a nap.  I really notice a difference when I don't get my rest.Hope everyone has a great new year!",
        "title": "Happy New Year"
    },
    {
        "content": "I promise to write much more soon -- this was taken on Christmas Day.Hope everyone had a great holiday.",
        "title": "Holidays"
    },
    {
        "content": "It's a few days before Christmas and all through our house it is pretty quiet.  Alan is home and studying hard since his finals are January 4th.  What a great way to spend your Christmas vacation.  Ralph is taking some time off while Alan is home.  We are trying to visit with friends when we can and relax at the same time.  Alan's girlfriend, Jennifer and her parents and sister are coming over for dinner on Christmas as well as some other friends.  That's what Christmas is about -- spending time with those you care for and all of these people are as close to family as we can get down here in the South.  I miss being with my family in Illinois, but maybe some year we will try to do that.I hope everyone has a wonderful Christmas and I'll post again soon -- I promise!",
        "title": "Christmas Time"
    },
    {
        "content": "It's hard to admit doing stupid things -- I certainly have my share of that lately.  I think that I need to stop trying to cook when others are not in the house.  On Friday, I decided to try to make some cookies.  I got out my ingredients and turned the oven on.  A few minutes later there was smoke coming from the oven --- when I opened it I found that I had but the sticks of butter in the oven when I got them out!  I had a real mess on my hands.  That's what happens when I try to do things when I'm tired.   A friend of mine who has Alzheimer's once told me that her smoke detector was her kitchen timer!  At least I caught it before the smoke detector went off -- I did think to turn the fan on to get rid of the smoke.In England, I had one day where I could not remember where I had been the day before.  I tried and tried and got so frustrated.  We were doing so much, and eventually, with a little prodding from my husband I remembered parts of my day.  I guess that is why it isn't a good idea for me to travel by myself.",
        "title": "Funny things"
    },
    {
        "content": "This is my first attempt at putting photos in my blog so you will have to forgive my sidewaysphoto of the Canterbuy Cathedral -- I can't figure out how to change it!  If my son is reading this, perhaps he can fix it!The top photo is me in the small town of Sandwich -- it was a very quaint town, but you can see that the streets are very narrow.  I didn't like going down them in the big double decker bus!The second photo was taken in Whitstable, a town on the North Sea -- these little \"beach houses\" that are behind Pody, Rick and I are owned by people that have boats on the North Sea to house equipment, change their clothes and just to hang out in while they are at the North Sea.  The amazing thing is that they cost $20,000 in American money -- and we don't think that includes the land!The third phot is the Archbishop of Canterbury talking with Father Christmas.  Father Christmas was much more popular than the Archbishop.  See post below for more on that! Then the photo of the Canterbury Cathedral.The last photo is of Pody and I with a volunteer in the Royal Navy Lifesaving Institute (I think I remembered the name correctly) -- anyway he had just finished a training mission in Whitstable -- they volunteer to do lifesaving tasks on the North Sea.  He kindly let Pody wear his hat and pose for a photo with us.I have more photos but since this is my first venture I'm going to see how this works out.",
        "title": "More On England"
    },
    {
        "content": "Well, we are back from a wonderful trip to England.  We spent most of our time with our friends, Pody and Rick from Illinois.  Pody is teaching in Canterbury this semester and what a lovely city.  It reminded me of going to a Renaissance Festival.  It was so beautiful.  The Canterbury Cathedral is just a five minute walk from Pody's apartment and it is so amazing.Pody got us tickets to a Christmas Carol concert at the Cathedral one night and it was a candlelight service with their boy's choir singing.  You can just imagine how that was.  And on Saturday morning, there was a Christmas parade and Father Christmas met the Archbishop of Canterbury at the end of the processional.  Then there were carols and a small ceremony.  Father Christmas garnered much more attention than the Archbishop.  The amazing thing that Pody and I both noticed was that if this had been done in America there would have been security all over the place with barricades and crowd control.  But not the case in Canterbury.  The parade was not what we think of as a parade here -- it is hard to describe but soon I will post some photos on the blog.  But the meeting of the Archbishop is a big deal and there was no one \"protecting\" him or security.  And, Pody and I actually got to speak with him....which was even more amazing.  Pody had greetings for him from the University of Illinois where the Archbiship had a god daughter that attended there.  Someone casually said to Pody before she left Illinois, if you ever see the Archbishop send him our regards.  Well, who ever thought that would happen but it did!I guess the funny thing to me was that when I was in England over 30 years ago, I stayed with some friends in Manchester.  They had a dinner to go to in London and they took me along and at the dinner was the Archbishop of Canterbury.  I had no idea who he even was (I was only 18 and pretty ignorant about all that stuff) and I got to meet him and talk with him.  I wasn't real impressed at the time because I really didn't know anything about the Church and all of that stuff!  It is a different Archbishop now, but to think that my path crossed with the Archbishop's twice is something I would have never thought would happen.Pody has been sick with a cold and I felt bad as she and her husband played host since she was sick, she should have been getting some rest.I did o.k. -- got tired but we did a lot and that was to be expected.  There is more to tell and I will at another post with promised pictures.  I just wanted to give you a quick post and let you know that we have returned.  I'm anxious to share our adventure with you.Kris",
        "title": "Britain"
    },
    {
        "content": "I hope everyone had a nice Thanksgiving.  It was very strange to have a Thanksgiving without our son.  The day seemed a little empty.  But, on Thanksgiving night we shared a wonderful meal with long time friends, who have become our extended family since moving to Athens twenty five years ago.  I am thankful for that -- it just would have been nicer to have the kid here!The next few days will be spent cleaning out the refrigerator and getting packed for England.  We are looking forward to going and visiting with our friend Pody and her husband Rick.  My sister-in-law is from London and although she has lived in Illinois for over 30 years, she was still able to give us some ideas to see some sights in London that would be decorated for Christmas.  I worry that I will be a drag on my husband, but hopefully he has traveled enough with me that he will be used to it.  I don't travel real well these days and when I get tired, I get very forgetful and confused.  Hopefully, we will pace ourselves.  When I was in California it was hard, but I did realize that I was there with my family and it didn't matter if I was confused or forgot something, because they were there with me to get me through it.Ta Ta For Now",
        "title": "Thanksgiving"
    },
    {
        "content": "I hope that all of my friends out there know that I am truly grateful for their friendship, support and love they give me all year round -- not just at Thanksgiving.A friend of mine's mother was in town from the Northeast for Thanksgiving.  I met the mother several years ago when my friend invited me to have lunch with them.  Since then, her mother and I have exchanged friendly emails and I usually catch up with her for lunch when she is in town.  Yesterday, we spent the better part of the day together as her daughter was working. I enjoyed the day so much -- I think I enjoyed mostly feeling for a few hours that I was \"part of the family\".  I miss that -- not having a large family, not having family close by.  Thanks Mrs. K for making my day special....and thanks to your daughter for sharing you with me!Happy Thanksgiving to everyone!",
        "title": "Thanksgiving"
    },
    {
        "content": "It's hard for me to write about my bad days even though I know that many of you like to hear the good and bad.  I had a really busy week last week and definitely over did it.  I try to pace myself but I'm not very good at it sometimes.  I was so tired after doing too much.  On Saturday morning I tried to do a task of organizing things and getting them into piles -- pretty easy stuff.  It took me three hours and then asking my husband for help, to do a job that should have taken at most about 20 minutes.  It's so frustrating.  I just need to not put myself in those situations -- or manage my time better.  I keep saying to myself \"if I can just get past Wednesday, or Thursday or whatever\"....but sometimes it just doesn't seem to end.  I have got to do better.And, I get in a panic too easily.  A panick attack came on over the weekend out of the blue and I hate that.  I didn't leave the house all weekend.  Not fair to my husband when he wants to do stuff -- but I don't know that I can do anything about it.  The doctor said if they got too bad that he would give me some medicine, but I just don't want to take any more medicine.We have a trip to England coming up in a few weeks.  I am very very anxious to go but at the same time a little worried about the crowds and the confusion.  I'm looking to my husband to take the lead and to help me -- he will if I ask him to, but he really needs to do it this time without me having to ask him to.  He has got to take charge (something he is not used to) or he will probably have a pretty hysterical wife on his hands!",
        "title": "Not The Best of Days"
    },
    {
        "content": "Learning new things is difficult to someone that has Alzheimer's. Your brain just can't process things like it used to. Today I was doing something around the house and came across a task that I hadn't done in quite awhile. So, I decided to tackle it. I'm not going to say what is was because it was really quite trivial and it will make me sound stupid. But, for the life of me I couldn't remember how to do it and the directions just didn't make sense. Frustration is not even a word that can relate to how I felt. After a few tears about it I left it alone. I then came back to it with not much more success. How incompetent this can make you feel. It's hard for me to accept that I just can't do certain things anymore. Perhaps I'll try again later.",
        "title": "Learning New Things"
    },
    {
        "content": "It's funny what you remember and what your kids remember about certain things.  Years ago when I would take Alan trick or treating, he would come home with way too much candy.  Because I didn't want him consuming all that candy at once, and because I didn't want him turning out short and fat like me, I decided to ration his candy.  After an initial indulgence, I would let him pick out one piece of candy a day until it was all gone. (I know this sounds harsh). Years later Alan shared with me how he would lay awake at night trying to decide what piece of candy he wanted the next day.  And, sometime Ralph or I would help ourselves to some of his candy, and when he went to get that piece of candy that he had yearned for it wasn't there -- wasn't I awful?  Who knew it meant that much to him.  He never said anything at the time.  Now, this is what he is up to on Halloween --http://www.stanford.edu/~bakowski/blog/index.htmlI'm sorry Alan.",
        "title": "Halloween Memories"
    },
    {
        "content": "Well, the trip to California is now history.  It was a great trip -- the weather was great and seeing Alan (and Jennifer) was even greater.  I forget how much I miss Alan when I don't see him.  It seems like it was harder for me to leave this time, than it was for me to see him leave on his trip out there.  It's hard to imagine that he is his own man now, not relying on his parents and making his way for himself.  I know that is what we raise them for, but it's hard to see that happen sometimes.We spend Alan's 22nd birthday with him.  It was nice to be able to spend it together.  We spent the day walking around the Stanford campus, Ralph and Alan played some tennis, we went out for dinner and came back to their apartment for cake and presents.  The weather was so beautiful.On Saturday we went up to San Francisco and went to Golden Gate Park and to the Japanese Tea Garden there.  It was really pretty.  Then we went to the Presidio and took a hiking trail.  We didn't go down to the tourist spots on Fisherman's Wharf because we had been there before.  We were searching for new places to explore.  I had a hard time that day because I kept forgetting where we were.  Later in the day, I just realized that it didn't matter where I was but that I was with my family and that is all that mattered.I don't think I could ever get used to living on the Pacific Coast in Pacific Time Zone.  It is just not right to be watching football in the morning!  All of the live ESPN programming ran at it's usual time on Eastern time, but it is three hours earlier out there so football games that start at noon show in California at 9:00 a.m. --- that's just not right.  The prime time programming on the major networks is held back, but it is still odd.I'm still somewhat jet lagged.  I think I stayed in CA long enough to get used to their time, only to come back and have to get readjusted to our time.  So, as I remember more, I will write more.All in all -- it was a good trip.",
        "title": "California and Back"
    },
    {
        "content": "Well the Memory Walk is over.  It was a great day weather wise and we are hopefully going to come close to our goal of $50,000.  It will be close but we are keeping our fingers crossed.  It was an exhausting day after setting up the night before, walking the 3 miles and tearing everything down after the walk.  Luckily, we had a fraternity on the UGA campus helping us and they was a huge help.  They are much younger than we are!  Thanks again to everyone that donated to the cause!But the walk took a toll on me.  I was really tired and didn't have a good day today (Monday). I went out to run some errands but just got too confused -- partly I think because I was still tired.  A good long nap this afternoon helped clear my fuzzy brain a little.We are going to visit Alan on Wednesday and I'm looking forward to it.  I know it will be a hard trip for me but I need to see my son.  It's been almost two months that he has been gone and it's time to see him.  His birthday is Friday and I'm glad we will get a chance to be with him.  It's kind of an insignificant number (22) but it's a birthday just the same.  It's nice to be with family on your birthday.  I really missed him on mine a week or so ago.So, when we return I hope I have great things to tell you about the trip.  I just have to pace myself and try not to get too tired.  Although I've been to California a couple of times, it is still not that familiar to me to feel comfortable.  At least I won't be alone.",
        "title": "The Weekend"
    },
    {
        "content": "Our Memory Walk is tomorrow and I would like to thank everyone again who donated to the cause.  The generosity of everyone has been overwhelming to me.  I really appreciate everything!  The weather looks like it is going to be nice and that's a good thing!  I'll write more after the walk and before we take off next week to see Alan at Stanford.  Thanks again everyone.",
        "title": "Memory Walk"
    },
    {
        "content": "On Sunday, I turn 50 years old....a milestone in most people's books.  But as I get older I feel how much I am regressing (I hope that is the right word) into a world that is unknown to me.  Some days I feel as young as a five year old, when I can't do simple tasks like sorting shapes and objects.  Other days I feel more than my age with my aches and pains of getting older and being out of shape.We all \"have our days\" I guess, but as I look into the future I see more dark days than light ones.  And, since the concept of age is all in our minds, you can only imagine what type of a concept I have in mine.",
        "title": "A Milestone of Sorts"
    },
    {
        "content": "This past weekend my husband and I went to the mountains in northeast Georgia with a friend whose family has a cabin up there.  This was our second trip and it is so peaceful up there.  It was much cooler up there and it was a nice break from the heat we have been experiencing.  It's nice to get away even for a day or so.  I was bothered by panic attacks while there and I was surprised by that -- I don't know if it was because I was in a somewhat unfamiliar place or not -- but I got through it.I've been working a lot on the Memory Walk which is October 15th.  I don't think I can be on the organizing committee next year, as it is taking way too much out of me. I can only imagine what next year would be like for me if I continue.  But, there are many people that are stepping forward and it will certainly be in good hands.I was doing a radio interview this week for the walk. And, the show's host is a friend of mine.  She said something at the end of the interview that made me pause.  She told me that since my diagnosis so many people in the community have been pulling for me and that I have so many people who care about me that I am blessed.  I know that and I appreciate everyone.  But sometimes it takes someone to remind you how blessed you are.  Thanks to everyone.",
        "title": "This and That"
    },
    {
        "content": "a way to express what happens with a lot of noise -- many of you know how distracting it is to me with lots of noise around me and how difficult it is for me to concentrate.  It is hard for me to put into words but I found this article this morning and it makes me feel better --http://my.webmd.com/content/article/112/110336.htm",
        "title": "Finally......"
    },
    {
        "content": "I couldn't think of a title for this post -- so for now \"untitled\" is what it will be.  It has been one of those weeks -- things not quite synching in the way they should.  I have been so unmotivated this week -- I think mainly because I have been unable to focus and get things into perspective.  It isn't that I dont' have a lot that I can be doing -- I just can't seem to get there.  My medicines have been acting up on me -- making me sick to my stomach.  I've been trying to lose weight again and I think my lower caloric intake is upsetting my stomach with the medicine.  But, I'm going to try to work through it and hopefully it will get better.  It is always something isn't it?  But, it has been hard for me to concentrate this week and getting anything accomplished has been a chore.  Some weeks are like that. Hopefully, I'll have a better outlook soon. It's very frustrating to know that you have things to be doing and just can't quite figure out how to get them done! It's like I don't know what I am suppose to be doing and I need someone to draw me a map. Then I think I could follow it.",
        "title": "Unititled"
    },
    {
        "content": "I'm having one of those \"anxiety\" weeks -- trying to fend off all too common panic attacks.  It is very weird how they come on -- but I just get this feeling that I have to be home.  I feel much better when I am home -- last week when I went to the neurologist he asked me if it was making me a \"hermit\" --and I wouldn't say that that is the case, I just feel better at home.  I can't quite wrap my feelings around it -- it is just that I need to be home.On another note, I received a lovely note from a lady that attended my talk in Gainesville last week.  That meant so much to me.",
        "title": "The Week"
    },
    {
        "content": "Yesterday I drove t Gainesville Georgia where I spoke to the Commerce Club.  My friend Carol set it up for me and there were about 20 women there.  I decided I was having a good enough day that I could speak from just my notes and it turned out pretty well.  I'm never quite sure going into it whether I'm going to hit a chord with the group I'm speaking to or not.  But, as I have said before, this is much for therapy for me as it is hopefully an education for them.  They were extremely gracious women and made me feel very comfortable -- I'm sure it is that Southern Charm.  But, I appreciate them taking the time to listen to my message and hopefully I was able to answer a few questions for them.  I enjoyed myself but I was extremely tired when I returned home and a nap was in store.  I have spoken to a group in about a month and it took more out of me than I thought it would -- but it was worth it -- it is always worth it!  Thanks again to the ladies in Gainesville for having me.",
        "title": "Speaking in Gainesville"
    },
    {
        "content": "as you will see -- you can now add a comment.  My son came through for me (as I knew he would!) but be nice --- everyone else can read your comments!",
        "title": "A little change"
    },
    {
        "content": "is what it seems like to me when I look at the devastating photos from New Orleans.  I was glued to my tv set for the first few days of Katrina and then I started getting so depressed I stopped watching.  I cannot even imagine what those people are going through.  My problems don't seem to be very big when I see that.My son has made it to Stanford and starts his classes tomorrow.  It seems like it has been a long time coming -- I know he will enjoy his studies.Before he left, he was going to alter my blog site somewhat in order for you to send comments, but that is a task that didn't get done and probably won't for awhile.  That is certainly not a priority now.I have been working as much as I can on the Memory Walk as it is in about 6 weeks.  It overwhelms me at times and I keep thinking that I can continue like I used to and I know that I can't.  It's just hard to get that in my mind sometimes!  I don't know what my role will be next year, it is probably time for me to be off the committee and just gather my friends, raise money and walk for the good of the cause.To all of those that have donated to the Walk in my honor, thank you.  I know for many there are more pressing issues in the world right now than finding a cure for Alzheimer's -- but I hope we don't lose sight of it.",
        "title": "Another world away"
    },
    {
        "content": "Well, yesterday was an emotional day for my husband and I.  Our son drove off to California to go to Stanford Law School.  Considering we live in Georgia, it's a long way away.  There were naturally lots of tears, but we know that this is the right place for him.  We are very proud of him and we know that he will do well.  He is a great son.",
        "title": "Off To Law School"
    },
    {
        "content": "On Sunday night we had a going away party for my son and his girlfriend.  It was so nice that everyone showed up and we had a good time.  I was really exhausted after it though.  On Monday Alan and I went out to play golf.  I've been having a problem with my right foot -- the same one I broke awhile back.  And, it was hurting so bad when I got home that I decided it was finally time to go see the doctor.  To make a long story short, I am now in a \"boot\" and go back in ten days to see what is going on.  It appears that I have a stress fracture in my foot and a bone spur that is rubbing up against my Achilles Tendon.  None of this is good.  We'll see what happens after I go back to the doctor.Alan is getting all of his stuff ready for Stanford.  He'll leave next Tuesday.  I have been dreading this day -- and it will be here before I know it.I go back to the neurologist on Monday.  I haven't been in awhile and I can't imagine he is going to tell me a lot -- wish there were some new \"cures\" out there!Our computer has been sick for a few days and it hasn't allowed me to get to the internet or my email.  Since it is difficult for me to talk on the phone my computer is kind of like my \"lifeline\" if you will.  I can go back and re-read emails and take me time composing as that is difficult sometimes.  Luckily, my husband was able to fix it and now I feel \"back to normal\".",
        "title": "It's been a long week"
    },
    {
        "content": "Today started out a good day.  Today was our Memory Walk Captain's Luncheon.  Outback Steakhouse provided lunch for our committee and for those who are going to have a team in this year's Memory Walk.  I didn't have to do much for it -- I got some door prizes together and helped with whatever I could.  I wasn't even speaking -- I did last year, but I thought they needed to hear someone else speak this year.The lunch went well but in the end I realized how stressed I was.  I shouldn't have been.....it was just a lunch.  And when I think that I used to be able to plan and carry out functions for several thousand people at a time it's a little unnerving.When I was driving home from the luncheon I noticed that my reaction time was off.  Not bad, but it seemed like I was about a second or two off from what I should have been.  I never thought too much about it at the time.Then when my husband came home we went out to play tennis.  And, I noticed my reaction time on the court was really off.  Now sometimes I just don't go race down a shot out of sheer laziness but tonight, my brain didn't even tell my body to run for the ball until after it had bounced -- and then it was way too late.  I've had a few problems before playing tennis but nothing like that.  I hated it because there was absolutely nothing I could do about it -- the brain just didn't work.I don't know what else to say!",
        "title": "A Bad Day When You Least Expect It"
    },
    {
        "content": "it has been so long since I posted. I have been waiting for my son to \"fix\" my blog by being able to add comments but he said he had a problem doing it --- that's why it hasn't been done.  I asked him to ask his girlfriend to do it so it might get done -- Ithink she knows more about that stuff anyway -- so hopefully before they go off to California we'll get it done. However, as I write this I see that there might be a place for comments so he might have done it and now it works.  After I push the button to \"publish this\" I guess we'll see if a comments area comes up.  If not, stay tuned!We went white water rafting a few weeks ago.  I was dreading it because it was class IV and V rapids.  I've never done anything like that before (highest I've ever gone is Class III and only one or two of them) -- but the trip wasn't too bad.  We never fell out of the raft and that was a good thing.  The bad thing was that I hurt in places I didn't know you could hurt the next day.Then we took a train ride through the Blue Ridge Mountain area.  It was a three hour trip and went through Tennessee and Georgia.  We had done our rafting in South Carolina so we got around a bit those few days!Today Alan and I went to a Braves games despite the heat we are having -- but it wasn't too bad.  After about an hour and a half we were in the shade so we survived and the Braves won.Last weekend Alan his dad and Jennifer painted his room.  Then we had new carpet put down.  The house was a mess for several days and it really took its toll on me.  Things were not in the right spot and I got really confused. Alan's stuff was all over the house and it was so confusing to me that I had a few pretty rocky days until it was finished.  Now the house is somewhat back to normal and I am feeling better.  I was close to having severe panic attacks with everything strewn all over the house.I have lots of Alzheimer's stuff to go over with you -- but need to save it for the next post.  Thanks to all of you that read this and give me your support -- it means a lot to me.",
        "title": "Sorry"
    },
    {
        "content": "Well we made it back from Hilton Head.  The weather was hot but we still managed some tennis, swimming (pool and ocean) and bicycling around the island.  Alan and Jennifer also ventured into the waters with a kayak.It was nice to get away but it is always nice to get home as well.  The trip was much harder for me than I thought it was going to be.  And mostly, because things were new to me.  We stayed in a villa for the week and of course, everything was different.  I found it extemely difficult to work in the kitchen -- I had to ask for help several times.  I was just so confused because I didn't know where things were and where to put them back when I got them out, etc. etc.  Also, Hilton Head was a lot busier in general than we had remembered it. There were  a lot more people and a couple of times, I found myself very close to a panic attack because there were so many people around and I was in a strange place.Sometimes when we go on vacation I like to venture out on my own.  But I couldn't do that either on foot, bike or by car because I was so confused by my surroundings.  I hate it when that happens!  Luckily, my family was by my side and didn't leave me alone too often.We have a few more two and three day trips left for the summer but they shouldn't be too bad.  Then, we'll be packing Alan up for the drive to California. What fun that will be.",
        "title": "Vacation's over"
    },
    {
        "content": "I didn't realize it had been so long since I posted here.  Sorry about that -- not really much happening I guess.  I've been trying to stay ahead of the curve with the Memory Walk stuff and so far I've been doing o.k. with it.  We are only a few months away from it and we still have lots to do.We'll be vacationing next week at Hilton Head and I'm looking forward to getting away.  It has been at least 10 years since we have been down there.  I don't really know why I should be looking forward to it as much as I am -- since I used to look forward to vacations to get away from work!  I guess I'm interested in a change of scenery.Alan has promised he is going to redo this blog site before he leaves for Stanford.  He is going to add a place you can add comments to it.  I'm not sure that is a good thing or not!  Sometimes the comments might not be too good -- in fact, a few weeks ago a lady told me that \"the only reason you speak out about your Alzheimer's is so that people will feel sorry for you\".  That upset me terribly and I haven't told anyone about that until now.  I hope that isn't what everyone thinks because if it is I need to stop now!",
        "title": "Vacation"
    },
    {
        "content": "The heat has continued here in the south.  But, it looks as if it is going to cool down to the lower or mid 80's by the weekend.  Alan and I have been playing some golf, I'm getting pretty frustrated with it all.  Can't seem to find my swing.  But, I guess I just have to play through it.It has been nice to have Alan home to help me run errands and the like.  It is hard for me to do on my own sometimes, and having someone with me really helps.  I'm going to miss that when he is gone -- he's spoiling me by being home!We still have lots we want to do this summer and although it is only the middle of June it seems like there won't be enough summer to get everything done.  I guess that always seems to be the case though doesn't it?",
        "title": "Summer"
    },
    {
        "content": "Well, we jumped from spring to mid summer with the temperatures this week.  It has been in the mid 80's and pretty humid.  But, despite the heat Alan and I managed to get in some golf and tennis.  I keep thinking it is going to help me shed these extra pounds, but so far, I've just sweated a lot!On Monday, I went to Atlanta to do an interview/q&a type thing with Col. Nimrod MacNair (Mac) and Dr. Neil Shulman (best known for being Doc Hollywood, being portrayed by Michael J. Fox in the movie -- he is also an author). Neil's mother passed away a few months ago with Alzheimer's and Mac's wife suffers from the disease.  In many discussions over the last few months with these gentlemen and the director of the Alzheimer's Association, we realized it is important to talk about the disease in \"not so frightening\" terms -- as Neil uses humor as a technique in teaching medicine as well as his writings.  So, we had some fun and taped about an hour's worth of material.  The Alzheimer's Assn. is hopefully going to be able to edit in some form that it will be useful to those suffering from the disease as well as those that are caring for their loved ones.Mac is also organizing a fund raiser for Alzheimer's in the community he is currently living in.  Heather Whitestone (Miss America 1995 (I think) who is hearing impaired) is going to be the featured speaker.  She talks about overcoming diversity in her speeches.  She and Mac have done some other motivational type programs in the past.I know I haven't posted for awhile but I wanted to put something down.  It seems like I am staying busy -- it is nice to be able to spend some time with Alan before he goes to California.  His girlfriend, Jennifer, is in Taiwan for a month.  She has been sending some beautiful pictures back as well as an account of her trip.  Her parents are from Taiwan and she hasn't been over to visit her extended family for about six years.  I'm sure she is seeing a lot of new things.  What a wonderful opportunity.",
        "title": "Hot Week"
    },
    {
        "content": "I feel like I am staying busy all the time, but then when I go back and look at what I did when I said I was \"busy\" it doesn't amount to much.  The fatigue seems to be getting to me more and more -- just trying to concentrate so much and stay on task. I think that is why I sometimes don't do things because it just takes too much effort.I have had some bad days recently.  I forgot how to get home one day and had to call my husband for help.  I get more confused around the house and feel as if I am forgetting more things.  I try to stay as focused as I can.I have enjoyed being with Alan this summer although our time is limited with him working in Atlanta  a few days a week.  But he still will \"hang out\" with me -- we went to play golf a few times last week and we generally enjoy each other's company.  I guess I should speak for myself -- I enjoy his company anyway!He is anxiously awaiting his trip to California and steadily looking at all the things he has to work out.  His girlfriend is in Taiwan for a month visiting her family and when she returns she too will be looking at what needs to be done for her move to the west coast.It has been raining here for days and that gets to be a little depressing at times.  But, hopefully, the sun will come out tomorrow.",
        "title": "Staying Busy and Not Staying Busy"
    },
    {
        "content": "This is going to be a long post so if you don't have a few minutes I would come back to this!Yesterday, my son took me to a conference on Alzheimer's Education. The speaker was Joanne Koenig Coste and you have probably heard me speak about her book Learning To Speak Alzheimers.  She was a terrific speaker and had some great points about Alzheimer's.  If you are dealing with Alzheimers please go out and buy this book -- it is worth every penny.  When I speak I usually take this book with me and end up giving it to someone at my talks -- it brings this disease down to a patient's perspective and I obviously can't say enough about it.Yesterday, I also recieved word from the Social Security office telling me that I wasn't disabled. Tell that to my brain!  They basically said that I need to get myself back to work -- which I guess we will appeal in time.  How can it be that three doctors have said I can't work and I take a test from a grad student at UGA and it is deemed that I can work.  That's our government at its best.I haven't written about this experience or really mentioned it to many people but my son thought I should write about it since this journal is really for that purpose.  It has often been said that Alzheimer's is a lonely disease -- and it is kind of hard to explain that.  And, I have said that you certainly know who your friends are as many drop you like a hot potato when they find out that you have Alzheimer's.  The phone stops ringing and many write you off.  When people find out about it they literally stop talking to you as if you are stupid and can't understand what they are saying.  They don't realize that you still have feelings. I say this only to preface an incident that occured a couple of weeks ago.  I attended a luncheon that was honoring a friend of mine.   I didn't know any of the women sitting at my table, but I did know several others that were at the luncheon.  They came up and spoke to me and we chatted for awhile.  Those at the table were good at making small talk since none of us really knew each other.  Then, a person seated nearby made a comment that she knew who I was -- I was that lady that had to stop working because of Alzheimer's.  I replied that \"yes, I was\".  At that moment, everyone at the table and near me stopped talking to me -- it was as if I disappeared in a puff of smoke.  It made me so mad.  Luckily the program started shortly after that and it diverted my attention......if someone said I had cancer or heart disease, I doubt they would have stopped talking to me -- it's a shame really.  Now you can understand why my real friends are important to me -- you know who you are and thank you for standing by me!On a lighter note, I haven't really mentioned much about my trip to Illinois to see my brothers and friends.  It was a great trip -- I realize how I can't really travel by myself anymore though so it was great to have Alan along with me.  We always laugh alot when we are together and that is so refreshing.  My world is a lot smaller now and having those around me that can laugh with me is a joy.  I got to catch up with an old friend of mine that used to be a client.  We don't see each other often enough, but he is a great guy and has been a friend for 30 years.  Lunch once a year doesn't seem like enough but we do stay in contact with each other and it is so nice that he still cares about me and I care so much about him.  We have been great friends over the years. Thanks Dave!My friends Pody and Rick and their daughter Rachel have been friends for just about as long.  We always have a great time together -- Pody actually cooked a meal for us and for Pody that is saying a lot -- her claim to fame is that she can't make jello so her cooking always brings us a chuckle!  But the lunch was great and I think after all these years she has finally learned to cook -- just kidding Pody.  Their daughter Rachel is an attorney in downtown Chicago and she and Alan had a lot to talk about.  We enjoy their company -- I wish we lived closer but they have been great to keep in touch with us.My family is growing with great neices and nephews.  It's fun to be around the little ones and see their moms with the children.  Thankfully, the weather was nice for a great big family picnic and the children got to play outside.  I'm not sure with all the noise they make that I could have taken having them all in the house with us -- but they seem to be doing well and I wish I could see them more often --they grow up fast.I've probably written enough for this post.  Sorry it was so long, but I thought while I was on a roll I would keep going!",
        "title": "Lots to Say"
    },
    {
        "content": "My son and I just returned from seeing my family in Illinois.  It is always a lot of fun and we laugh a lot.  I needed that.  I sometimes get the \"giggles\" and can't stop laughing.  When my son starts to laugh that way it is really hard.  We had a great time, but as usual, it is always nice to get home too.  The trips take a lot more out of me now, because I tire so easily.  And, of course, my routine gets shot to hell so that doesn't make it easier.  But time with my family and friends is important and I need to do it when I can.Tomorrow my son and I are going to Greenville SC to an Alzheimer's meeting.  The lady that wrote the book \"Learning to Speak Alzheimer's\" is one of the speakers and her book is great -- I would recommend it to anyone dealing with this disease.I have lots more to post but it will have to wait until another time.",
        "title": "The past week"
    },
    {
        "content": "I finally got caught up with rest and then tomorrow my son and I are going to Illinois to see my family.  It has been a long time since we last visited.  I can't even remember -- but it will be nice to catchup with all my family and my friends that still live in the area.When we return Alan and I are going to Greenville SC to an educational conference on Alzheimer's.  The lady that wrote the book \"Learning to Speak Alzheimer's\" is the featured speaker.  Her book is great and I look forward to meeting her.I know our trip will be tiring.  It is harder for me to travel because I get worn out so quickly.  Luckily my family knows this and allows \"rest time\" for me.  But I am anxious to see everyone.More when I return next week.",
        "title": "Another busy week"
    },
    {
        "content": "My son graduates with his Masters in Public Policy tomorrow from Georgia Tech.  What a nice Mother's Day present!  I'm so proud of him.  I'm glad he'll be home for a few months so I can spend some time with him.  Yes, he'll be working a few days a week, but every summer he has not only worked but been taking classes or doing research.  This will be the only summer for a few more years that he will just be working.  Hopefully, we can go to those baseball games, play golf, tennis or just hang out.  By the time August rolls around he will be ready to leave for the West Coast and start a new chapter in his life.Happy Mother's Day to all those wonderful moms out there!",
        "title": "A big Weekend"
    },
    {
        "content": "My husband and I just returned from a Public Policy Forum on Alzheimer's in Washington DC.  I was so glad to see so many people with Early On Set Alzheimer's there -- it is nice to know that you are not alone.  I think we all know it, but it is nice to actually see and talk to others that have this awful disease.The Alzheimer's Association asked me to speak at a forum on Early On Set and I am so happy that the National Office is looking into the ramifications of those diagnosed early.  We have our own set of problems and I am glad to have been a part of it.  There was a lot of energy in the room and I do hope that we can find some solutions to some of our problems. Thank you for all you are doing.I was disappointed, however, to sit in on the research session only to find that I didn't really hear anything new on the horizon.  The last policy session I went to and listen to those from the NIH and National Institute on Aging, I was impressed with all the strides that had been made.  We all want that miracle drug if you will, but it is a long way away.The conference took a lot out of me.  I've been home for a day now and just found the words to sit down and right something in this blog.  I get tired so easily and it is just harder for me to try to be attentive for three days!  I did manage a nap or two while I was there, but it is extremely exhausting to me -- takes me too long to recover!Thanks to all those I met in Washington for all you do and in helping our cause.  The conference was certainly filled with compassionate people and we need to keep the fight going.",
        "title": "Washington DC"
    },
    {
        "content": "This has been a busy week -- too busy for me.  After my awful testing on Monday I was pretty run down and as a result didn't have a great week.Next weekend my husband and I will be heading to Washington DC for the National Public Policy Forum for Alzheimer's.  We went two years ago and it was a great event -- although depressing because it hits you smack in the face as to what we are facing -- not that you don't know that -- but when you have alot of people in one conference talking about it -- it can become overwhelming.  But in the long run it does us good to hear what is going on and to catch up on the latest research.  I've been told that about 20% of the people that are at the conference will be Early-On Set people such as myself.  That will be good for me.My son made his decsion about law school this week --he is going to become a \"surfer dude\" and go to Stanford in California.  I'm glad the decision is behind him and I think he will be happy there.  Selfishly, I was hoping he would pick Harvard because it is closer to us, but we'll just have to be content in visiting him in California -- which isn't all that bad when you think about it!",
        "title": "The Week"
    },
    {
        "content": "For quite a few months now, I have been in an \"exchange\" with the Social Security office to try to collect disability.  I've been rejected a couple of times, which, we've been told is pretty normal for the Social Security office.  But, they decided to send me for some neuro-psychological tests this past Monday I guess to assess \"my disability\".  I've had these tests before and they are difficult but I had to go......so I went.The tests were suppose to last three hours.  They began at 10:00 a.m. and didn't end until five hours later!  We had no lunch break and I had one rest room break.  They kept asking me if I wanted a rest room break but I settled for one during the five hours.Now, think about it, it is very difficult for anyone to sit and take tests for five hours, let alone someone that has Alzheimer's.  The last time I took these tests (for my original diagnosis) it was done over two sessions both lasting about two hours.The tests I had done Monday were done at the UGA Psychology clinic and were administered by a grad student.  (My nephew is studying for his doctorate in psychology so I kept envisioning him sitting across the table from me.)  The sessions were videotaped and we were also in a room that had a two way mirror for observation.  I felt like I was in a police precinct (although I have never been in one, it looks like those interrogation rooms from television).The tests started off with me telling them a little about my condition and the things I could not do.  Then of course, most of the tests were \"things I can no longer do\" -- like math for example.  I just can't do that sort of thing -- in my head or on paper.  It was all being timed  so I didn't get many answers right.  After doing a bunch of memory tests and sequencing tests they then moved on to vocabulary and general knowledge questions.  I must admit that after about two and a half hours I probably couldn't have told you my name at that point, let alone who Cleopatra was or who the President of the United States was during the Civil War.  Many times when I confessed to not knowing I was prompted for a guess.  I'm sure they thought I was being a smart a** but I wasn't.....I was tired and cranky and just couldn't go on.I'm not stupid......but how do they know I'm not stupid?  These tests are designed to try to find me employment.....I can see them coming back and saying she can work....\"she's just stupid\". Alzheimer's certainly makes you feel stupid and many of us fight that all the time.  We have to keep reminding ourselves that it isn't us --- it's the Alzheimer's. When you're tired it is hard to distinguish the two.I was so exhausted when I got home (and I'm lucky I could get home on my own), that I fell asleep in the chair, couldn't carry on a conversation with my husband, went to bed at 7:30 and slept until 6 the next morning.  The next day I was still dragging and not thinking real clearly.I was talking with someone at the Alzheimer's Association in Atlanta yesterday and relaying this information to them.  When I told her that \"they probably just think I'm stupid\".....she said that sounded like a title to a book.  And it could be.",
        "title": "They probably just think I'm stupid"
    },
    {
        "content": "I just returned from a trip to Albany Georgia where I spoke to a conference put on by the Alzheimer's Association for Caregivers, some professional, some family members.  There were about 250 people there and I admire each and everyone of those people -- enough can not be said about what these people do for their loved ones in a day's time.   Their unconditional love certainly shines through.I am always honored when I get a chance to meet them.  I've said before that when I speak to groups I believe it is therapy for me.  After I meet these people I am just in awe.",
        "title": "The Week"
    },
    {
        "content": "Yesterday was our 25th wedding anniversary.  I never thought I would ever be married 25 years -- it just seems like a long time -- and it is I guess -- it certainly hasn't seemed that long. My husband and I enjoyed a nice quiet dinner last night.  Our son sent us a card and a nice letter.  In it he said he didn't think he had ever written us a letter -- which is not true as he went away a few times and actually wrote us a letter but I don't think he remembers.  With the age of email and instant communication I feel like letter writing is a lost art. But don't we all love to get \"real mail\" and a letter from our son was a beautiful gift.  It was filled with lots of reflection on his part and he raised some interesting points -- some which need to be addressed before too long and some that he will never understand until he is a parent himelf.  I used to hate it when my mom would say this to me \"You'll understand when you have kids of your own\" -- but it is oh so true.Lots of wonderful things have come out of our marriage but our son is the most wonderful thing. I'm sure that all parents feel that way.My husband --a man of few words -- also sent me a \"letter\" of sorts --this time electing to use the electronic version of email.  He said some things I would have never expected him to say but they were nice words to read.  Even though we have been married 25 years it is hard for me to figure out what goes on his mind -- for those of you that know him -- you will certainly understand.  He has certainly been good to me and Alan over the years.  I am not sure I have been as good -- but we are still together.I hate the fact that \"Big Al\" (Alzheimer's) will be taking more of my time as we continue our journey through life. My husband didn't marry that and for that I am truly sorry.",
        "title": "25th Anniversary"
    },
    {
        "content": "I have been extremely busy and of course that throws me out of my routine, so that is my excuse for this week for not entering information in here.  It's not a great excuse but one just the same.My nephew visited us for three days.  He had two conferences in Atlanta -- on consecutive weekends so he came to visit us for a few days in between.  While he was here I had  a talk to give in Dahlonega and he went with me.  It was nice to spend some time with him.  He is 25 years old and we moved here 25 years ago so I never really had a chance to get to know him. He's a bright kid and studying for his PhD in School Pyschology.  But we had a great time going to Dahlonega and the folks there were so gracious.  When I speak about my Alzheimer's it is really more therapy for me I think than the groups I speak to so I'm always grateful to get the opportunity.Then we took my nephew to meet up with my son in Atlanta and he spent a night with him before his next conference started.  This weekend my nephew will fly back to Illinois late on Sunday and my brother is coming into Atlanta on business on Sunday morning.  Our plan right now is to meet my brother, get my son, catch up with my nephew and all have a meal before my nephew gets on a plane.  It's hard for me to follow -- so I am hoping that someone else is keeping track of all of this!As I write this my son is at the University of Chicago Law School for their admitted students weekend.  He went to Harvard's and last weekend he went to Stanford's.  It is down to these three and I feel that a decision will be soon.  I know this is a difficult decision for him and I'm trying to keep out of it -- it needs to be his decision.  That's hard for me to do!Next week is our 25th wedding anniversary.  That is a milestone.  I never thought I would ever be married to anyone that long!I have another speaking engagement in Albany next week and after that I think I need to rest.  Not being on my routine is difficult and I'll be glad when I can get back to it.  I just have too many bad days when I am not on my routine.",
        "title": "A busy few weeks"
    },
    {
        "content": "Well it appears spring is here.  We are getting a few days of nice weather, then rain and cold and then a few more nice days.  Hopefully, soon we will see more nice days than cold days!Things have been busy here for me lately and of course that means getting out of my routine and I certainly can feel a difference.  It's hard for me function normally when I am out of my comfort zone.  I'm trying desperately to back to \"normal\" whatever that means these days but every time I try I get sidetracked.  Over the next couple of weeks I have out of town company  coming and several speaking engagements out of town.  I hope by April 15th I will be able to be back on more of a regular schedule and calm down some.  I get really anxious when things don't follow a routine.  I know I need to be better about controlling and that is something I am going to really have to work on this summer when my son is home.It is hard for me to just do something on the \"spur of the moment\" like I used to.  I feel uneasy and unsettled and pretty confused.  I know my son will understand when he decides at the last minute he wants to go play tennis or do something that I can't always do it.  I have to plan and stick to my plan -- and I hate that!  I used to be pretty spontaneous and enjoyed just picking up and doing whatever I wanted when I wanted.  So much for that independence!",
        "title": "Spring"
    },
    {
        "content": "Well spring is here and hopefully the weather will start acting like it -- we get a few good days and then some bad ones.  But, I guess March is always unpredicatable.There is a lot going on in the next couple of weeks.  My son is in Boston this week checking out Harvard -- heard from him once that he was more impressed with it than he thought he would be. Not exactly sure what that means, but I know he had some concerns before leaving so maybe those concerns have been cleared up.  The first of April he heads to Stanford and then he is off to Chicago.  We will all be glad when this law school decision is over.  It is very hard!I have several Alzheimer's speeches to give in the next month -- one in Dahlonega, one in Albany and I will be returning to Washington DC for the Public Policy conference.  All of these are so important -- it does me good to do them, but it is also exhausting and makes me realize all the challenges ahead.  I'm usually pretty good at blocking them out (I think that is the survival instinct) but when I do the talks it hits home even more.  It is harder for me to travel by myself and I know that limits what I can do for the cause.  I hate to ask people to go with me because I see it as an inconvenience, but I know people would go if I ask.  I guess I might have to get over that!My nephew will be visiting in a few weeks.  He has two conferences to attend in Atlanta on two consecutive weekends, so during the week he will be able to spend some time with us.  And, my brother is going to visit a day or so in the next few weeks as he is close by on business.  It's going to be a busy time.",
        "title": "Spring"
    },
    {
        "content": "Gosh -- it's been awhile I know, but I think I am finally getting back on track after being sick for several weeks.  I just have to watch it and not over do now or I'll be back in the same situation!  Thanks to all those that have called since I haven't been blogging.  I guess I don't realize how many people actually read this.Getting back to my routine is important now to help me keep on track.  I'm doing pretty well, but then I haven't ventured out much lately!My son is in the final stages of selecting law schools.  It is such a difficult decision for him.  He applied to way too many schools, but then he wasn't sure if he would get in them so you have to have your bases covered.  He has it narrowed down to four Stanford, Harvard, Yale and the University of Chicago.  He will be visiting all of them in the next month so hopefully in a month's time he will be able to make a decision.  It will be hard for me to have him farther away than an hour as he has been for the last four years.I promise to write more soon. Thanks again for checking up on me.",
        "title": "Back on Track"
    },
    {
        "content": "I know I haven't posted in awhile, but I have had the flu and a bad cold for several weeks.  I promise to be back soon with a good post!",
        "title": "Cold/Flu"
    },
    {
        "content": "It has been a busy week for me and a long one!  I went to the Southern part of Georgia this week for an Alzheimer's conference which focused on our annual Memory Walk.  Many of the Walks around the state were represented and it was good to learn and hear what they are doing in their communites.  We have a big goal set for us this year but I know that we can make it.But, these people are phenomenal.  They give and they give and they give.  What they have accomplished with their walks in their communities is unbelievable to me.  The world is such a better place with individuals like that.  I am indebted to them for all they do on behalf of the Alzheimer's cause.Today, our family is being interviewed for a documentary about Alzheimer's.  I know this is not something that my husband in particular is fond of doing because he is pretty soft spoken.  But, it means a great deal to me that he is willing to do it.  He always does extremely well, although when people interview him, it is hard for me to be in the room.  I realize what a burden I am and that always makes me sad.",
        "title": "The Week"
    },
    {
        "content": "I always tell people that I have \"good days and bad days\" -- and I realize that they don't really know what that means -- but it gets me through the question without a lot of conversation.  But, yesterday -- I had a bad day and what that really means is:1. I have an electric toothbrush and when I was brushing my teeth yesterday I couldn't remember how to turn the toothbrush off!  It sounds funny now, but I just didn't have a clue.  I ended up putting it in the kitchen sink because I was afraid if I put it on the counter that the vibration would knock it on the floor.  So, I put it in the kitchen sink.  I also couldn't remember where I was suppose to spit out the toothpaste -- so I went to the trash can and spit it out there.  Later, I saw the toothbrush in the sink and thought \"why is the toothbrush in the sink and it is turned on?\"  I picked it up and turned it off, cleaned it off and put it away.2. I then had a dentist appointment.  The day before I had broken my glasses and made an eye doctor's appointment to be sure my prescription was still the same before ordering new glasses.  But the whole time I was at the denists getting my teeth cleaned I thought I was at the eye doctor's.  I couldn't figure out why this lady was messing around with my mouth, when they should be looking at my eyes.  It was obviously very confusing.3. On the way home from the dentist there was an accident and all the traffic was stopped for a long time.  I couldn't maneuver my way around it and couldn't make a u-turn because of the other traffic.  So, I just sat with my engine idling.  I noticed that a lot of people were turning off their engines to wait it out.  I thought I would do the same, however, I thought to myself that if I turned the engine off, I wasn't sure I could remember how to turn the engine back on and then what would I do?  I didn't want to call anyone and ask them because I just couldn't bring myself to do it, so I just sat with my car idling until the wreck was cleared up and then I was on my way home.All these things happened in one morning...and that is a bad day.",
        "title": "Bad Days"
    },
    {
        "content": "The last few days haven't been real good days for me.  The only way I can describe it is that I feel like I am a step behind in everything I am doing. Things don't seem to come into focus for me and I can't quite get right what I am trying to do.  One of the problems I have now is expressing myself clearly as to what I am feeling and I realize that what I just wrote probably doesn't make sense -- only to me.  It just seems like I am out of sync with what is going on around me.  Kind of like I am going in slow motion as the rest of the world whizzes by.  But, this too shall pass.....or I hope so.My friends still keep me going.  I enjoy hearing what everyone is doing and all of the accomplishments.  A good friend from Illinois just got a teaching job in England next fall and that is so terrific.  She always amazes me at what she does and what she has accomplished....I am so excited for her. It is so nice when great things happen to great people.",
        "title": "A Step Behind"
    },
    {
        "content": "Well, it is February and I realized I haven't posted in here for awhile.  Sorry about that everyone!  I've had a cold -- and although I have had it for a couple of days it seems like I have had it for weeks.  It's the kind of cold where you just want to sleep it off!  But, I'm out of the bed today for a little while anyway.  I have a Memory Walk Meeting this afternoon so I need to at least get myself cleaned up and out of the house for that.  I can rest the next two days!Our group that is working on the Memory Walk is great -- they are pretty much the same people that worked on it last year.  The bad thing is that I hate to commit myself to too much out in the future because I never know how much I'll be able to do in 6 or 9 months time.  You want to hope that you'll be able to do everything.....but you just can't count on it.  But, since we have so many good people on the committee I know it will go off without a hitch as it did last year.On the home front my son is still agonizing over law schools and probably will for a few more months.  On a lighter note for him, he went to Mardi Gras in New Orleans over the weekend.  I guess I need to clarify what \"going to Mardi Gras\" really meant in his case.  One of his roommates works for Delta so they got some cheap air fare to New Orleans.  They left on Sunday morning around 9 a.m., stayed up all night and then got on a plane early Monday morning to come back to Atlanta.  So, they weren't there for even 24 hours but I guess they got to \"experience Mardi Gras\" if that is what you call it!  I guess it would be nice to be young again and do that.  It would take me about a month to get over a trip like that!On February 14th my son has an audition in Atlanta for the game show Jeopardy.  It is something he has always wanted to do -- why not go for it I guess.  He's a lot braver than I would be.  He thinks that if he can get on the show it will help pay for law school.  I would like to think that, too!",
        "title": "February"
    },
    {
        "content": "The south was hit hard by an ice storm this weekend.  We lost our power on and off but there weren't many major power outages in our area which was good.  But, it made for a long weekend since it was hard to get out and move around.  But, it was beautiful outside looking at the ice on the trees and the streets.  I know that might sound kind of strange but it was pretty.The highlight of my weekend was that my son came home. Luckily he made it home before the ice starting forming.  I really enjoy our time together and it is nice that he spares a weekend here and there because he is so busy.  I worry alot about when he comes home what changes he sees in me if any. I also worry about the time when he is going to come home and I won't recognize him.....I hope that is a long way away.....but I can't help worry just the same.  That's going to become a reality at some point....as hard as that is to think about.",
        "title": "A long weekend"
    },
    {
        "content": "I know since I have posted here.  I haven't quite figured out what I want to write about these days.  Alot is going on and then it seems like nothing is going on!  I guess after the holidays everything seems to \"quiet down\", or at least get back to normalcy.I've started going to the gym on a regular basis and that has gotten me into my routine once again.  I realize how easy it is for me to do too much in a days time and I certainly pay the price sometimes.  I still get tired rather easily and that is frustrating.My son is looking at law schools and of course all of them are far away.  That has been on my mind a lot -- I know he will make the right decision as to where to go -- he's a smart kid.  So far he has been accepted to Stanford, Berkley and Harvard.  He is still waiting to hear from others -- I wish it was an easy decision for him but I know it won't be.  Of course, mom and dad stress out about it too, but isn't that to be expected!",
        "title": "It's been awhile"
    },
    {
        "content": "I've been pretty frustrated lately.  It goes in spurts thank goodness.  I'm forgetting more and more things -- like going to make coffee and I already made it, going shopping and not remembering what I bought, putting clothes away and not knowing where I put them, filing papers away and not being able to find them.  It's very frustrating.  I feel so stupid when I do stuff like that.  My husband's solution is \"write everything down\" -- but you cannot write every step down you take during the day.  We do tend to keep things in the same places all the time which helps but sometimes I just want to scream!!!!",
        "title": "Frustration"
    },
    {
        "content": "Hope everyone had a good holiday season.  It has been different for me --not working during this time of the year.  My son has been home from college for three weeks now and I have gotten to spend a lot of time with him.  It's been good -- but different.  I'm sure he finds it boring around the house spending it with the parents, but I'm glad he has done it.  I have a feeling these days will be few and far between from here on out.I was reminded this week that 2005 brings some milestones for our family.  In April our 25th wedding anniversary comes around, my son will be graduating with his Master's degree in May, my husband is looking at retiring this summer and I will turn 50 in October!  I hope my health will keep up with me so I can see all these things happen!",
        "title": "Happy New Year"
    }
]