[
    {
        "content": "Yes, it has been many long months since I have added anything to this blog.  The last few chemo treatments I had this summer did a number on me.  I was sailing along pretty well and then a big old truck seemed to come smashing into me.  After my chemo finally ended, I went in for surgery. Luckily, the chemo had done its job (it should have for what I went through!) and the tumor was pretty insignificant at the time of surgery.  A few weeks later I started radiation treatments.  On November 13th I will be finished with everything.......or that is the plan anyway.  I went for my original mammogram on April 1 (no joke) and 7 months later -- I am on the verge of finishing treatment.  Of course, follow up exams will be made and I will continue to meet with my oncologist but hopefully all the nasty stuff is behind me. This is definitely not how I wanted my year to go.Through all this my Alzheimer's has \"flared up\" with my chemo brain and my Alzheimer's brain combined I had some days where it was just easier to stay in bed -- and that I did.  But, the farther and farther away I get from my original chemo treatments the better that is.  And, we just finished our Walk To End Alzheimer's last week and our team raised over $15,000. I am so proud of everyone and so very thankful for all of my friends and family for getting me through all my health battles this year. I can never thank them enough.And of course, there is this guy -- turning 11 months old. Every time I was feeling really down or really sick I got a little dose of Ian and I started smiling. I know that is what grandchildren are all about.",
        "title": "Not Back To \"Normal\""
    },
    {
        "content": "Monday, I head back to the chemo chair.  At least I know what to expect now!But, my doctor was kind enough to delay my next treatment one week so I could visit family last week. My husband, brother and I went to the US Open Golf tournament for one day at Erin Hills in Wisconsin.  It is an amazing course -- one I would never want to play.  We were also able to visit with some cousins that live in Wisconsin that I have not seen in about 8 or 9 years.  I needed that visit.",
        "title": "Back to the Chemo Chair"
    },
    {
        "content": "A few months ago I came across an old friend on Facebook and re-connected.  We had just lost track of each other and it was so nice to hear from her again.  One of the first questions she asked me was \"Did your son ever open up his letters you wrote him on his birthdays\". I had forgotten that I shared that with her.  If you have followed my blog you know that I the day my son was born, I wrote him a letter.  I put it in the safety deposit box and every year after that I wrote a letter on his birthday and put it in the safety deposit box.  I think at some point he knew what I was doing but we didn't talk about it.  I really enjoyed writing that letter and added photos and different things. I would collect thoughts and stories all year and save them for that day I wanted to write \"the letter\". As the years went by I wasn't sure when I wanted to give them to him......on his 18th birthday, 21st birthday, graduation.....????? When I was diagnosed with Alzheimer's these letters took on a different meaning.  I wanted to share everything with him before I forgot everything.  Some years the letters were very hard to write.I finally decided that the night before Alan got married I would give him the letters. I purchased a brown leather case. We shared time that night and it was really hard for me to give him these letters.  And, he didn't want to take them from me.  We shared a few tears and I finally convinced him that it was the right time.  I think maybe he thought I would never write him another letter, or that I had given up on life or something.  My only condition to him was that -- he could read them when he wanted but that when he did read them I wanted to know that he had.  That was almost nine years ago.On Mother's Day this year, Alan gave me a letter.  The letter said he had read my letters the week before.  I didn't ask why now but I would suspect that my cancer scare brought him to it -- not knowing what my long term prognosis is going to be.  That was a hard day.So, Jan......the answer to your question is \"Yes, Alan has read his letters.\"",
        "title": "Letters"
    },
    {
        "content": "Last Monday, May 22nd, I have had my first chemo treatment.  In an update to my last post, the other tumors that were located in my body were benign and I was doing the \"happy dance\". I told friends later that I was so relieved to \"just have breast cancer\", that I never thought I would hear myself even mutter those words.So, Chemo started last Monday. Monday wasn't too bad but the ensuing days have added lots of new side effects, lots of sensations, lots of highs and lots of lows. But, this too will pass.  There are many many people much worse off than I am so I am thankful for everything that comes my way.  I went to purchase a wig. Not sure how much I am going to wear it, but by this time next week, I shouldn't have any hair. Right now it doesn't seem to bother me, but it probably will when I see it dropping to the ground in clumps.  The good thing is that I don't have another chemo appointment until June 19th. It was suppose to be earlier but we had planned a trip to visit family in Illinois and the doctor thought it would be good for me to go, so we will delay chemo for one week during that cycle.  After getting back on track I will have chemo through the first part of August, followed by surgery and then 5-7 weeks of radiation every day.This guy makes me smile -- he turned six months old this week.",
        "title": "May 28 th -- one week removed from chemo"
    },
    {
        "content": "Last week I was welcomed in Warner Robins by the NARFE state convention. (National Active and Retired Federal Employees) -- I was one of their keynote speakers and they were great.  Thanks to all of you for having me there -- I enjoyed my time and getting to know some of your members.  This organization gives very very generously to the Alzheimer's Association not only on a state level but on a national one as well.  We are very grateful for all they do.As I mentioned in my previous posts, I'm dealing with this breast cancer thing. Since then, a few things have changed.  My chemotherapy treatments that were suppose to start this week didn't. Last week I had a CT scan of my torso and a tumor was found in my liver.  In addition, a bone scan indicated there was a \"suspicious\" spot on my spine. Needless to say, these are not things we were prepared to hear.  Every time I go to the doctor I find more things I didn't want to hear and certainly weren't expecting to hear.So, tomorrow I sill have another CT scan of my abdomen and my pelvic are so they can get a better look at the liver tumor.  A few days after that (we hope) there will be a biopsy done on that tumor to see if it is malignant. I will also have an MRI on my spine to look closer at the spot there to determine what it is. We are in that \"hurry up and wait\" mode which is always pretty agonizing.  Our next doctor's appointment is next Thursday and we are hoping that by then the results of all of these tests are in and we can again get a course of treatment.  I hate to take more tests because they keep finding new things.All of this has been weighing heavily on my mind and my focus isn't clear. My friends and family have been there when I need them and I know they will continue to be. Please keep us in your prayers as we continue on this journey.",
        "title": "The saga continues"
    },
    {
        "content": "Since I lasted posted I have visited an oncologist regarding the breast cancer diagnosis.  Not a fun few hours for sure, but we have a plan now and if all stays true to that I will start chemotherapy on May 10th.One thing we are concerned about is \"chemo brain\" -- a side effect from the chemotherapy.  Short term memory can be hampered as well as other things such as lack of concentration and that 'foggy\" feeling.  I know those things all too well now, I am hoping they don't get much worse.  But there isn't anything we can do about it so we are hoping for the best.After 4 cycles of chemo (one week on, two weeks off - for a total of 12 weeks) then it is on to surgery.  After I recover from surgery we will be looking at radiation for 5-7 weeks (five days a week).It is going to be a long summer.This week I still have a few tests to take to prepare for the start of chemo.I also have an Alzheimer's speech I am giving in Warner Robins Georgia which is a couple of hours away.  It has been on the schedule for a long time and it is important that I do it.Then, I have family coming in for my great niece's graduation from Emory University. So, all the things going on this week will help with me trying to keep my  mind off things -- if you can really do that.Last night my husband and I attended a Billy Joel Concert in Atlanta.  I have never seen him in concert and it was a great show.  He sang for three hours straight and all great songs.  The show was held at the Suntrust Bank Baseball Field -- the new home of the Atlanta Braves.  We decided to stay the night in a hotel which was walking distance to the stadium so we didn't have to hassle with the parking and the commute at night.  That was perfect.  When we arrived at the hotel my daughter-in-law had brought by a little \"goody bag\" for us and in it my son left this note:So cute and clever.  Made me feel good after a long morning with the oncologist.",
        "title": "More Doctors"
    },
    {
        "content": "First of All --Isn't he cute?  Ian's first baseball game in Atlanta. I know I'm prejudiced -- but he is a bundle of joy.It's spring and the weather is beautiful in the south.  Lots of things are going on with festivals, graduations and outdoor sports.This post is going to be long and probably ramble a bit, but as I titled this, indulge me.  I have a few speaking engagements coming up for the Alzheimer's Association and I have been trying to make some changes in some of my presentations.  One of the things I talk a lot about is the difference in funding research for Alzheimer's disease and other diseases like heart disease, cancer, and diabetes.  Alzheimer's is the only disease in the top ten diseases that cause death, that has no cure.  Yet, funding is proportionally lower for Alzheimer's disease that the rest.  I literally preach that we need to make Alzheimer's a CAUSE and perhaps people would look at it differently.  I know I am probably preaching to the choir here as most of you are my dear friends and give generously of your time and give financially to my \"cause\".So, this week happened.  I was diagnosed with breast cancer.  Perhaps it hasn't sunk in yet, but my reaction to it hasn't been as devastating as I thought it would be.  We are in the initial phases or meeting with surgeons and doctors, etc. But, with breast cancer I know there is a chance for survival.  Unlike with Alzheimer's.  And, it is because of all the research, all the dollars that have been given and people speaking out about breast cancer that has made this happen.  I know many people that have had breast cancer and survived -- the treatment might not be great but the end result is. Those that have gone before me are my inspiration.Several years ago when I was speaking to a class at UGA I mentioned that at one point a doctor at Emory told me that he would hope that I would die from something other than Alzheimer's.  I have thought about that a lot.  When I said this to the students one student asked if I was faced with another devastating illness would I seek treatment.  I told her I didn't know the answer to that and would have to wait until that situation ever presented itself (if it did). Well, now here I am and yes, we will seek treatment because our chances are good and I can see a positive outcome.I'm hoping that in time our Alzheimer's cause will have the same outcome.  Please continue to speak up, give and encourage people to look at Alzheimer's as the DISEASE that it is and help us fight this dreaded disease.",
        "title": "Indulge Me"
    },
    {
        "content": "I had the pleasure of speaking to an OLLI group in Washington Georgia this week.  They were a very attentive group and I enjoyed sharing my story and information about Alzheimer's with them.  Thanks for the invite.My week has been an emotional one and one that hasn't gone too well. I cannot even begin to explain what has been going on right now so I won't. but, tomorrow I get to see Ian and I know that will brighten my week.",
        "title": "February 2017"
    }
]