[
    {
        "content": "I wouldn't say that I \"love\" Christmas like lots of people do.  I usually get a little down during the holiday season and don't really know why.  I guess I don't like the expectation of everyone thinking you should be happy for the holiday season when in fact you should try to be happy all the time!But what I do like about the holidays is the receiving of holiday cards.  If you know me, you know I like to receive cards, make cards and send cards.  So many people don't send holiday cards anymore and that is a shame to me.  But those that do, I love getting them, and I say thank you.  Even if there isn't a holiday letter inside explaining to me what everyone has been up to I still enjoy them.  I thank the Lord I have friends that still remember me and take the time to send that holiday greeting.  And, I love reading all the letters -- I know a lot of people make fun of them, but I do enjoy reading about all the wonderful things people are doing and the love they are sharing.Our family didn't have a lot of \"traditions\" at the holiday time when I grew up except maybe two that I remember.  My father was a pressman for the Peoria Journal Star (PJS), the daily newspaper in Peoria Illinois where I grew up.  He always worked nights.  But Christmas Day was the only day of the year, the PJS didn't publish.  So, my dad would always have Christmas Eve off from work.  We knew he would always be home that night.  In fact, my mother and father were married on Christmas Eve because of that very fact.  At the time, he was an apprentice and didn't get much time off at all, so they knew they were safe in planning a Christmas Eve wedding and that his friends from the newspaper could be at the wedding. Every year on Christmas Eve, it seemed as if everyone we knew came by the house and \"celebrated\" my parent's anniversary and Christmas Eve.  I don't know how it started, but every year, we could always count on seeing our friends, neighbors and relatives that one time of the year.  No one was sent invitations, everyone just showed up.  My mom always had lots of food and everyone brought their homemade goodies to share with everyone.  I don't remember my mom working for days getting things prepared......it just happened.  I'm sure she did, but don't they say that the sign of a good party is when it looks effortless?Another tradition that we had involved my dad.  He was an orphan growing up.  His mother had some problems in child birth after one of his siblings was born and could no longer care for my dad and his siblings.  They were put in an orphanage and all of the children were adopted out to different families except one who ended up staying in the orphanage until she was a young adult.  The family that adopted my family didn't end up raising him as he ran away and headed up to Illinois (he was born in the south). In adulthood, he ended up finding a sister and a brother and was able to actually reunite with his birth mother before she died.  But, having grown up an orphan he didn't exactly have many traditional Christmases.  He never asked for a lot, but he loved opening presents.  So, we would wrap everything and anything for my dad to unwrap on Christmas day.  He was a big fisherman so we would end up wrapping individual little hooks and fishing flys just so he would have a lot to open up.  It sounds silly, but he enjoyed opening all the presents as much as we enjoyed seeing him smile.My dad died the year before my son was born.  One of my biggest regrets in life is not having Alan sooner so my dad could have met him. They would have been buddies.Life's short.  Make your own traditions with your family and cherish the moments you have together.  The tragedy that unfolded recently in Connecticut should bring that home to everyone.",
        "title": "Christmas"
    },
    {
        "content": "This week I got to spend some one on one time with my beautiful daughter-in-law Jennifer Lee.  We went to see \"The Cake Boss\", at the Cobb Energy Center in Atlanta.  He gave us some cake decorating tips as well as shared his humor with us.  I had a great time spending time with Jen and having a girls night out. Thanks for going with me Jennifer!",
        "title": "Fun with Jen"
    },
    {
        "content": "It's a time to be grateful and I have a lot to be grateful for.  Thanks to my friends for sticking with me for the person that I have become.  I don't know what I would be without my friends and family.  We have so many material things that we sometimes overlook the most precious gift of all -- love and support.My family growing up wasn't the most functional of families so holidays were many times not the happiest times.  Thankfully, our small family hasn't gotten to that point and hopefully never will.  I'm grateful that Alan and Jen have moved back to the area and we can see each other more frequently.What are you grateful for this Thanksgiving?",
        "title": "Happy Thanksgiving"
    },
    {
        "content": "I promise I am not MIA.  I have had so many thoughts lately -- was going to sit down and write about them and as quickly as I thought about them, they left me.  I even wrote some of them down, and then couldn't find where I had written them.  November has been busy and I've been trying to keep up, but it's amazing to me how much gets by me these days.  I'm slowing down and everything else speeds up -- or at last that is what it seems like to me.  The holidays are fast approaching and I feel like a deer in the headlights.  I'm anxious in a bad way and can't really figure out why.  Hopefully, by the time I do, the feeling will be gone.",
        "title": "Not missing In Action"
    },
    {
        "content": "Thanks to TEAM ATHENS -- and everyone who contributed to this year's walk.  It was a beautiful day and I appreciate everyone's support!  Here are a few photos from the day!",
        "title": "2012 Walk To End Alzheimer's"
    },
    {
        "content": "I've written about my friend Lisa Genova before.  She is the author of the above named books.  I first met Lisa a few years ago when she wrote Still Alice -- about a young woman that had younger on-set Alzheimer's (YOAD).  A friend of mine also with younger on-set told me I needed to read the book as the lives of people with YOAD are widely misunderstood. Through him, I got to know Lisa.  In February of 2010 I met Lisa for the first time in Savannah.  She had just finished Left Neglected and was starting to work on Love Anthony.  She told me that Love Athony was about autism.  She was explaining to me how she was handling the subject and I couldn't quite get into my head how it was going to work.  A few weeks ago, Love Anthony came out.  I bought it but didn't pick it up until this weekend.  When I picked it up, I couldn't put it down.Without ruining the story or the ending for you, I wanted to say that Lisa has nailed this just like in her other two books.  The story involves two women whose lives are paralleled throughout the book, with them coming together at the end. One woman writes a book about autism, the other woman has a son that has autism.  When they meet, the woman who has the son tells the other woman that she has written the story of her son's life.  This was such a poignant moment for me, because when I read Still Alice, I said out loud to no one, \"this is the story of my life\".  I couldn't believe that she had captured this so eloquently and so on target.  So, when I read this in this book I thought it was very ironic for me.And, Lisa also gives a shout out to Athens, GA -- which certainly brought a smile to my face.I know I wrote about Left Neglected when it came out as well.  It's about a neurological condition called Left Neglect.  I had never heard of it and it just fascinated me when I read the book.If you want a good read, please go get Love, Anthony.  You will not be disappointed -- oh, and bring some tissues because you are going to need them.",
        "title": "Still Alice/Left Neglected/Love Anthony"
    },
    {
        "content": "As you can see, I was in Arizona last week.  Finally got to take the Grand Canyon off my bucket list.  Also visited Sedona Arizona as well.  What a beautiful state.The bottom photo is my childhood friend, Jan Mangis Thomas.  Jan and I grew up together in Bartonville Illinois.  We went to elementary school and high school together.  Jan has done a much better job of keeping up with everyone we went to school with than I have so it was nice to hear what everyone was doing!  Jan and her husband moved to Arizona a few years before I moved to Georgia.  We've known each other over 50 years and haven't seen each other in 40.  What a nice reunion at the end of a great trip.  Thanks to Jan and JP for dinner and old times!!!",
        "title": "Trip"
    },
    {
        "content": "For the past four days I've been in Arizona.  Yep, one more thing to check off the bucket list.  Earlier this week I went to see the Grand Canyon.  I can't describe it, pictures don't do it justice. I was overwhelmed by the size of it.  A mere person seems so insignificant when you see such a \"wonder of the world\".Now I am in Sedona -- home of the Red Rocks.  I didn't quite expect this -- I expected this type of view in Colorado, not Arizona.  I also have always wanted to go to the Red Rocks Amphitheatre in Colorada -- a natural amphitheatre made of the beautiful Red Rock.  I've just had a few hours to look at Sedona but expect to do much more today.Then, tomorow, I am catching up with an old childhood friend.  We went to elementary school and high school together.  A few years ago we caught up with each other on Facebook and have been staying in touch ever since.  She lives right outside of Phoenix and tomorrow we will be together for the first time in close to 40 years.  I'm anxious to see her.  Some friendships never die.....they just stay dormant for awhile and then will erupt when we make it possible.  Why don't you take a few minutes and reconnect with someone -- whether it be over the phone, through the internet or by a hand written note -- isn't that a novel idea these days?",
        "title": "Arizona"
    },
    {
        "content": "This past week, I had the good fortune to see a group of ladies that I have not seen in a long time.  Years ago we used to play tennis together and we were able to get 12 of us together to have lunch.  It was great to catch up and to see everyone again.  I wish we wouldn't have waited so long.It's finally started to cool down some in the south and it's finally nice to be outside.  Now, if I only had that screened in porch I've always wanted.......",
        "title": "Old Friends"
    },
    {
        "content": "is tomorrow, September 21st.  Join me in wearing purple for the cause!I know it has been awhile since I last blogged.  I've been busy.  Over the course of the last 10 days I have given 7 different talks to groups around Atlanta and Athens.  Today was my last one until October 9th. So, I am resting tonight.  Today's talk wasn't as good as I would have liked it to be -- I was pretty tired going in and I know that affected it.  But thanks to all who had me come and speak.  I really enjoyed meeting everyone, getting to go to new places and found some new friends.  What can be better than that?",
        "title": "Alzheimer's Action Day"
    },
    {
        "content": "Those \"foggy days\" keep coming. It's bad because I never really know when to expect them. Last week, I went to go play golf with my husband. On the way to the golf course I couldn't remember where we were going. I didn't say anything at the time, because I knew that eventually we would get somewhere, right? I did realize we were at a golf course though when we arrived. My husband paid and my husband handed me the scorecard since I'm always the one that keeps score -- or at least I try. I couldn't figure out where to put our names on the scorecard. I kept having to ask my husband \"how this thing worked\". He helped me through it. Once we were on the golf course, it wasn't very good. I couldn't concentrate, had to ask my husband what club to use. I couldn't keep track of the way the game was going. Needless to say, I had a very high score that day! But today, we went golfing again and things were much better === my score wasn't that much better, but my day wasn't so foggy! I guess I should be grateful I can still walk the course and enjoy the exercise.",
        "title": "Foggy days"
    },
    {
        "content": "My friends, the Comptons, took pity on me and took me fishing yesterday!  I was so excited to be going.  As you can see I caught a fish -- more than one actually -- this is small but there were some keepers.  I can't thank them enough for inviting me to go along.  I was going to call Joe Compton my \"fishing fairy godfather\" but I didn't think he would like that -- so let's just say he was a great captain of the boat (the boat has no name by the way) and a great sport to take me along.  I promised Suzanne I wouldn't post any photos of her -- so here is Joe and my catch!  Thanks again.",
        "title": "My Fishing Buddies"
    },
    {
        "content": "My Optum Health is a website for various medical topics and wellness.  Ginny Greene wrote a very nice article about me and I wanted to post a link to it.  I don't usually do that but she did a great job and I wanted to share it.  You can find it here:http://bit.ly/S2FtnwThanks Ginny for a great article.",
        "title": "New article"
    },
    {
        "content": "You have probably seen a lot of news lately a bout some research regarding Alzheimer's.  Here is a link to all the news from the recent Alzheimer's meeting in Vancouver that detailed many of the stories dealing with new drugs in the pipeline.http://www.alz.org/aaic/",
        "title": "Alz. in the news"
    },
    {
        "content": "I have to laugh at myself sometimes.  I \"tried\" to go fishing last week.  I think I have mentioned here that I wanted to go fishing as I used to fish with my dad years and years ago.  So, I wanted to do it again -- I guess in his honor -- I don't know.  My son bought me a new rod and reel for Mother's Day so I was all excited to give it a go.  My husband loathes fishing so I was all set to do this by myself.  Well, I am not going to go into the gory details, let me just say that it was pretty much a disaster.  First of all, I don't have a boat.  So, I called around to several area state parks and were told they had fishing boats to rent.  After finally getting all my gear ready I trekked off to the lake. The john boat I was renting was extremely heavy, the boat did not have oar locks on it so how is one person suppose to paddle a john boat?  Of course, there was no anchor and it just kept getting worse.  Like I said I am not going to go into all the gory details, other than to say I'm going to try to again -- but with a new strategy.  I will prevail over this....one way or another. Or I'll find someone to take pity on me and actually take me with them!!!  But I will conquer it!",
        "title": "I'm pretty pathetic"
    },
    {
        "content": "Father's Day in Atlanta with Jen and AlanHere is a photo of Alan and Jen with the dads, and then with the moms.They just bought a new house in Atlanta. we went over yesterday to see the house for the first time. We had seen the outside, but they just closed this week sotheyjust got the keys. The photos I'm posting here are from the posting of the house when it was for sale. It's a beautiful house and I know they will enjoy fixing it up and making it a home.I have always wanted a screened in back porch -- so their screened in porch iswhere I am going to be most of the time when I visit!The previous owners had a baby grand piano, but Jen's mom and dad have a baby grand piano they are giving Alan and Jen so I would think it may go in the same place.I attempted to make a cake that \"looked\" like their house --it wasn't great, but it wasn't good enough to show here but it served the purpose long enough for us to cut into it.",
        "title": "New House!"
    },
    {
        "content": "Back in July I posted this bucket list:SkydiveGo to AustraliaWin a tennis tournamentShoot a  hole in oneMeet Maria ShriverOwn a red Mazda MiataHave a screened in  porchBe skinnyMake a difference to someoneI've decided to revisit it since many have commented on it.List now:SkydiveGo to Australia - DONEWin a tennis tournament -DONE-- actually several people pointed out that I have won several tennis tournaments when I was younger -- so I guess this didn't really count.Shoot a  hole in oneMeet Maria Shriver - DONEOwn a red Mazda MiataHave a screened in  porchBe skinnyMake a difference to someone (this one is weighing pretty heavy on me right now)Visit the Grand CanyonGo fishing again - my son bought me a new rod and reel for Mother's Day so I'm ready!Travel to Europe againGo on a girls weekend somewhere funHave all of my girl friends over to my house at one time for coffeeHave more patience with myself and my familyLearn to sewHopefully someday become a grandparent -- but that is definitely out of my controlI need to work on some of these -- some I can make happen -- others we'll have to wait and see. What's on your bucket list?",
        "title": "Bucket List revisited"
    },
    {
        "content": "No I am not Missing in Action.  I just haven't gotten around to putting my thoughts down lately.  I can't seem to get everything organized in my brain -- I'll be back shortly.",
        "title": "MIA?"
    },
    {
        "content": "I've just returned from Illinois visiting family.  Alan hadn't been in four years so we made a quick visit over Mother's Day and it was great to see everyone.  All my great nieces and nephews are growing and I got to meet my best friend Pody's little grand daughter Jane for the first time.  Jane was one year old in March.  They just happened to be in the area over the weekend so I was so glad to meet her.This is my niece Nicola and my great niece Dakota.This is my great nephew Oliver with Alan and I.This is my great nephew Henry -- isn't that hair fabulous?And, this is Jane with her family -- dad Mark, mom Rachel, Alan granddad Rick, Grandma Pody and me.And, Alan and I went with my brother and sister in law to a minor league baseball game while in Peoria -- the Peoria Chiefs.  It would not be a proper visit with Alan anywhere to not go to a baseball game!",
        "title": "Illinois"
    },
    {
        "content": "For about the last year, I have been thinking about going fishing.  That probably sounds funny to most of you.  But, when I was young, my father pretty much fished every day of his life.  He would work the night shift as a pressman for the daily newspaper, come home, eat breakfast, go fishing and then take a nap.  He'd get up from his nap, eat dinner and go to work.  I loved going fishing with my dad because it was about the only time I saw him and it was alone time with him.  We would always get in an argument because my dad would be trolling the boat and if he caught a fish while trolling we would stop, put down anchor and fish there for awhile.  If I caught a fish while trolling he wouldn't stop but go somewhere else to fish.  We used to laugh about this all the time.My dad died about 29 years ago.  My big regret has always been that I had not had my son when my father died.  My dad would have loved Alan.  I see a lot of my dad in Alan and that makes me proud. I miss my dad.  My mom and I weren't that close and I guess dads and daughters are.  After my dad died I took one of his fishing rods and have it mounted in my living room.  It's a constant reminder of that constant person in my life.  I haven't been fishing in over 30 years and the more I think about my dad the more I want to go fishing.My brother visited about a month ago and he made the comment he wanted to go fishing.  I was so surprised he said that because I hadn't told him what I was thinking, and he wasn't the first one to volunteer to go fishing with dad.  He would go on occasion, but he certainly wasn't the first one in the boat.  And, I don't remember him cleaning fish with dad and I.  He probably did, but I don't remember that.  So, we had this conversation while he was here about fishing and I needed to buy a rod and reel because one way or another this summer I am going fishing.  I've said a few things to friends about wanting to go fishing and although they fish on a regular basis I haven't been given an invitation to go with them -- so I'll do it on my own.  And, maybe I'll even catch enough for my dinner.",
        "title": "Fishing"
    },
    {
        "content": "Last night there was a dinner to give out awards and as you can see Coach Summitt and her son were there to receive an award handed out by Maria Shriver.  Meredith Viera was the guest host and Jane Seymour was also on hand.Today we are heading to Capitol Hill to talk with our legislators about increased funding and support for Alzheimer's legislation.",
        "title": "Washington DC -- Part Two"
    },
    {
        "content": "I'm in the nation's capital this week for the annual Alzheimer's Association Advocacy Forum.  There are over 700 people here representing all fifty states and the District of Columbia.  Yesterday, I had a meeting with others with Early stage Alzheimer's and got to meet some new friends.  Some had ties to Atlanta in one way or another and I hope our paths will cross again.  Many at the meeting were there for the first time and I think it helped them to see so many of us \"like them\".Today we have a long day.  Breakfast starts at 6:45 with our first meeting at 7:30 and our last event starting tonight at 7:30 p.m.  A visit to Congressman John Lewis' office is scheduled for this afternoon and tomorrow we will be going to the Hill for meetings with our other legislators from Georgia to ask for their help on a variety of issues.  It will be a long two days but worth it. I'll try to post some photos tomorrow.",
        "title": "Washington DC"
    },
    {
        "content": "This blogspot that I am using keeps changing on me and I always get a different screen while trying to post.  I need someone to help me with it or I'm not going to be able to post any longer because it is too confusing. So, I might be absent for awhile but I'm going to keep trying.Next week I'm heading to Washington DC for the annual Alzheimer's Advocacy Conference.  I'm anxious to see old friends and to see what we are facing in the year to come with Alzheimer's funding as well as research is taking us.  Hopefully, there will be some good news on the horizon.In my last post, I spoke of some funerals that I had recently gone too.  Unfortunately, since then another person I know had his life cut short this past week.  A brain aneurysm took the life of a vibrant man in his 40's. A friend to everyone he met, he leaves and beautiful wife.  Oh so sudden, and oh so sad.  My heart goes out to Amy for her loss and to all of us who knew Jon.  The love they showed for each other was to be envied. You will be missed Jon -- may your rest in peace.Having said that -- I keep going back to how short life is.  Even if we live to a ripe old age are we doing everything we can to make it a happy life?  We need to, and while I think that -- I wish I was strong enough to take my own advice. But, sometimes, that is hard to do isn't it?",
        "title": "More multiple topics"
    },
    {
        "content": "This post is going to be long and it is going to jump around a lot, so hang in there with me. I've been making notes about some of the things I wanted to write about and the topics are all over the place. I can't come up with a way to string them all together, so I'll try to at least group my thoughts. This is one of those instances where I can't get everything to flow smoothly in my brain, so I'm doing the best I can today. Most of the time I just put it off because I can't get it to come out like I want -- but this time I'm going for it!I've been to two funerals in the past three weeks. Both lives cut way too short. The services were unique in their own way. But both services brought home to me that there is never enough time to be with your family and friends. One minister said \"Death ends a life, not a relationship\". But when I think of Alzheimer's I think just the opposite -- Alzheimer's ends a relationship, not a life. As the disease progresses it is harder and harder to have a \"normal\" relationship with those you love. It's constantly changing and much sooner than you would like -- the relationship becomes one sided with those afflicted inching away. I guess that is why I've always said \"I have the easy part\".The last funeral I attened was for a friend that had a terminal illness and knew she was dying. She had given her pastor instructions on what she wanted her memorial service to be like -- the hymns to be sung, the prayers to be said. As I was sitting there I couldn't help but think of my own family. We've talked about what we want to happen to us when we die but never about any type of service. After this particular service I was laughing with some friends about the fact that when I die no one will probably know. They asked me why and I told them that these days it costs money to put an obituary in the paper and anyone who knows my husband knows that he would never spend money like that! So, I've told them if they don't hear from me one way or another for a month or so they might want to check! In all seriousness, I'm going to give it some thought and try to steer my family in the right direction anyway. We've given a lot of other things thought. We've gotten all of our legal \"stuff\" worked out. And, as bad as this may sound to you, I've even selected photos and items I would like to have in my room if and when the time comes to place me in a home. I have to believe that if some things are important to me now that they will be then. Although I won't be able to communicate it.Friends -- I've talked a lot about firends and alzheimr's. How it was difficult for some of my friends after I was first diagnosed. Many just walked away. Some have retured and others have not. That's o.k. I'm meeting new friends and at this stage of my life I'm kind of surprised by that. You usully think of friends as being those life long friends from elementary, high school or college. But since I've been out of school for so long and live far away from my home town, I suppose its only right that my friends are somewhat local and easy to find time to visit with. My new friends intrigue me because some are much younger and some I have met by happenstance.It saddens me that several of my friendships I thought were pretty solid have gone by the wayside. I've tried to reach out to them on numerous occasions with no response. I would really like to know what happeneed. If I did something wrong I want to apologize even if the friendship is beyond repair. I want to know because I don't want to make the same mistake with others. It's o.k. if they don't want to be friends any longer -- I'd just like to know why. The thing that probably gets to me the most is I didn't see it coming. Sometimes you do. Sometimes you just drift apart. I didn't realize there was a problem with these friends. I hope some day I'll know and I hope in some way some of these people will work themselves back into my life -- before I can't remember them.Major meltdown -- A few weeks ago I was out at our local Target store. I hadn't been in there for awhile and it looked as if they were in the middle of a makeover. At first it didn't bother me, but after about fifteen minutes in the store and a cart half full -- I started to panic. I didn't know where things were, everything looked different and I just got disoriented. I literally froze in place. I knew I needed some help. My husband was out playing tennis so I couldn't call him. I checked my phone for my one number dialing and everyone on there didn't live in Athens (I have since changed my dialing numbers). Finally someone who knew me walked by and realized I was having some problems. I just needed to get out of the building and she helped me. I haven't been back since. After telling this story to several people they all asked me the same thing. When you are traveling and go into a store that is unfamiliar to you how does that affect you? My answer probably doesn't make a lot of sense to them -- but usually I am with someone and I'm not expecting merchandise to be in a certain place or on a certain shelf. The things that catch me off guard seems to be a trigger point for me.Money -- You would think by now I would just stop trying to make change. But every now and then I try to test myself on it -- it's simple right? A few days ago I was buying something and it came to a total of $26.10. It took me awhile to get the $26 counted out. I was so proud of myself. Then came the $.10. Although I could hear the clerk tell me I was ten cents short, I couldn't physically take the dime out of my wallet. I knew what I was suppose to do -- but the whole process couldn't make it from my brain to my fingers. This is just so frustrating -- I need to just stop testing myself. By the way -- I asked the clerk if he minded just taking the dime out of my wallet. Yes, he looked at me pretty strange and he did it....but hey....welcome to my world.",
        "title": "Lots to Say"
    },
    {
        "content": "",
        "title": "2012 Alzheimer's Facts and Figures"
    },
    {
        "content": "I just looked at my blog and realized that it has been some time since I last entered anything.  I certainly didn't mean it to be this long.  Since I last wrote I have been to Tallahassee Florida and to Macon to a good friend's mother's funeral (RIP Mrs. Livingston). I've spoken to a few groups, been to some meetings in Atlanta and now my brother is visiting from Illinois.  I've been busy. No excuse for not posting.  Will do so soon.",
        "title": "Been around"
    },
    {
        "content": "Although I'm sore from my adventure yesterday, today was much brighter because I got to have lunch with my friend Ruby. How can you not smile when you look at her?",
        "title": "A Good Day"
    },
    {
        "content": "First of all, if you haven't seen the new \"Facts and Figures\" out for Alzheimer's I hope you'll take a minute and visitwww.alz.org. The new information is pretty staggering over just a year ago. It shows how much more work we all have to do.This morning I was hit by a car -- not my car -- me! A lady hit me at a local grocery store parking lot and sent me into another car. Nothing broken, just sore tonight and I'm sure I'll have some bruises to show for it. But, the lady drove off! I know she had to know she hit me. There was a man there who helped me and by the time I got my brain in gear, she had gone and we didn't get her license plate.Then this afternoon I attempted to play golf. That wasn't a good idea -- let's just say that I had a nice walk on a beautiful day.Tomorrow will be better. I get to have lunch with some friends and their six month old little girl. I haven't seen her in a couple of months and I can't wait to hold her.",
        "title": "Interesting Day"
    },
    {
        "content": "I have heard lately from several people who have come to realize how important their parents are.  Taken their parents for granted all these years.  I don't think I realized it until I became a parent myself.  But, in the reverse, I hope that I don't take my son for granted -- I probably do but don't think about it.  I do appreciate when he calls me out of the blue or sends me an email without wanting something.  He's always been pretty good about that -- I am thankful for that.  I don't tell him often enough how much that means to me and I should.  We shouldn't wait to tell any of our friends or family how much they mean to us.  Don't take it for granted. Be proactive. Appreciate everyone you know-- they all have a part in your life, whether a major one or not.",
        "title": "Kids"
    },
    {
        "content": "I don't know if it is normal or not to havefriendscome in and out of your life.  I think perhaps it is but then I'm not sure.  I guess all friendships have their \"life cycle\" if you will.  After being first diagnosed a lot of my so called friends went away -- not being able to deal with it or not wanting to deal with it.  So, I guess I'm alwayssuspiciouswhen I don't hear from a friend for awhile or I try to contact them or reach out to them and I get no response.  How far do I take it?  Or am I guilty of the same thing.  If so, I want those to tell me so I can make it right.  I realize some times that a friendship has run its course, but it would be nice to know that rather than wondering what you did to alienate that person.  Maybe that is too much to ask -- maybe the sound of silence is all you need to know -- take your cue from it and move on.",
        "title": "Friends"
    },
    {
        "content": "Yes, it has definitely been awhile since I posted.  I have had so many things to post, just haven't been able to get them down into intelligible words for this post.Just returned from Nashville Tennessee where I was at the SEC Women's basketball tournament.  Our team didn't do too well, but it was a nice trip just the same.  Thanks to my \"keepers\" while I was there -- Ralph didn't take the trip with me but I have great friends who watch out for me. I appreciate that so much.I've had a lot of comments on the blog lately.  Some I have posted, others not.  I'm glad this is helping some or at least prompts some to ask some good questions and seek the answers.  With thsdisease you have to be dilligent as your doctos sometimes aren't.  It shouldn't be that way but it is.I've had several requests for speaking engagements coming up and I appreciate that.  Bringing a personal perspective to this does add a different dimensions than most speakers can bring. If that helps to bring another side of the story to many, that's good.  We need to do all we can to bring attention to Alzheimers.",
        "title": "New month"
    },
    {
        "content": "I had a date for lunch with my son yesterday. I was in Atlanta and he was free so we were able to have a little time for lunch. I'm so glad he is back close to home. I've missed that.",
        "title": "Date"
    },
    {
        "content": "I grew up in and around Peoria Illinois.  Yes, it is always the butt of many jokes, but it is also the world headquarters of Caterpillar Tractor Company -- known now as only Caterpillar.  Having said that it was interesting growing up in a \"one company\" town if you will.  If you weren't associated with \"CAT\" you didn't exist.  I remember once wanting to see a doctor and not being able to get in because I din't work for Cat.  I had my secretary (whose husband did work for Cat) call and make an appointment for herself and then I went.  I had to beg them to take me and they would only take cash money.  I had good insurance but they didn't want to deal with it.  I was lucky they even saw me at all.Then over 30 years ago I got married and we moved to Athens Georgia -- where the single employer here is the University of Georgia.  If you weren't associated with UGA you didn't exist.  I can honestly say that over the years that has changed and you don't feel quite as alienated as you used to -- or at least we don't.But now, Caterpillar announced today they are opening a plant here in Athens that will employ around 1,000 people.  It's great for the community, but how ironic is that?",
        "title": "Interesting story"
    },
    {
        "content": "at the Georgia Capitol was yesterday. Over 300 people were in Atlanta to help advocate for some issues that our legislature is dealing with regarding Alzheimer's. Just a few years ago when this even was started there were a hand full of people there. I was so proud of our contingency from all over the state that came.Everyone has their own unique story. And, after yesterday, I know that even when I cannot speak for myself, there will be a host of people out there advocating for me.Thanks to my family for coming and taking time out of their work days -- as well as my daughter-in-law's father. That meant so much to me. I appreciate everyone's support.I have lots to write about the visit and will do so when I get some photos to post from yesterday.Thanks to the Alzheimer's Association of Georgia for hosting us and helping us with our visits.",
        "title": "Alzheimer's Awareness Day"
    },
    {
        "content": "Some increased funding for Alzheimer's research was authorized by the federal government this week. I'm grateful for that, even though it is a modest step. You can read more here.http://yourlife.usatoday.com/health/medical/alzheimers/story/2012-02-07/Administration-boosts-funding-for-Alzheimers-research/52997920/1.",
        "title": "Funding from the Government"
    },
    {
        "content": "I've discussed the National Alzheimer's Project Act (NAPA) on several occasions. The president is working on the budget and we need to be sure that he stays committed to NAPA.Here is something from the Alzheimer's Association website -- if you clink on the link below you can sign the letter going to President Obama. It only takes a minute and we need your help.Alzheimer's can't wait. We need a federal commitment in order to change the course of Alzheimer's disease. Tell President Obama millions of families are counting on him to fulfill the potential of the National Alzheimer's Project Act when he releases his upcoming Budget Request to Congress.http://www.alz.org/petition/overview.asp?type=homepage_petition",
        "title": "Need Your Help"
    },
    {
        "content": "On Monday, February 13th -- you'll find me at the Georgia State Capitol to help promote Alzheimer's Awareness to our legislators. Will you join me? Many people are intimidated to go to the \"gold dome\" as we often call our capitol. They are intimidated by not knowing the process of talking to our legislators and afraid of saying the wrong thing. The great day about the Awareness Day at the Capitol is that if you feel uncomfortable talking, you don't have to -- you just need to be there. There will be others willing to talk on your behalf, but you showing up and adding to our numbers makes a difference. When legislators see the \"sea of purple\" (since you'll be given purple shirts to wear\" it makes a big impact on them. We want to make legislators aware that Alzheimer's isn't going to go away any time soon, and we need their help.The Georgia Alzheimer's office is currently working on several initiatives that we want our legistlators to know about. Items that will affect not only those living with the disease but certainly the hundreds of caregivers in Georgia. One of those things is a state Alzheimer's Plan. Currently, 19 states have state Alzheimer's plans. These plans help to guide how Alzheimer's is handled on a state basis and will work in conjunction with the National Alzheimer's Project Act that is currently being formed on a national level. The state plan can deal with all types of issues facing those dealing with Alzheimer's to help with respite care, programs and services and laws that protect our loved ones with Alzheimer's.Many initiatives need funding -- and although we know funding is in short supply these days, if we don't stay out in front of our legislators, then we will be forgotten.If you've never done anything like this before, please consider joining us. As a favor to me, and the other 200,000 people living with Alzheimer's in the state of Georgia. Numbers count. And we need you to help make a difference. Just your presence is something. Don't be intimidated -- you won't have to do anything you aren't comfortable with. But, if you are reading this blog, you probably have someone in your life you know with Alzheimer's and you can help us just by showing up on Feburary 13th.The day will start with lunch, then a walk to the capitol to meet with legislators and possibly the governor and end with dinner and a candlelight tribute on the steps of the capitol. You can come for all or part of it. I can't stress enough what an impact seeing hundreds of people wearing purple shirts in the capitol makes.You must register -- but it is simple and can be done online. There is also training if you so desire to learn about the iniatives that are going to be discussed. You can do that in person or online if you so choose. We just need to know if you are coming or not so we can plan for food and shirts for everyone. You can read more about here:http://act.alz.org/site/PageNavigator/georgiaadvocacy.html1Please make Alzheimer's a priority -- we need everyone's help!",
        "title": "Join me for Georgia Alzheimer's Awareness Day"
    },
    {
        "content": "This week the National Alzheimer's Project Act was discussed in Washington DC. This is one of the first of many meetings to bring this act to fruition. An article ran in the USA Today regarding the act and the work that is being done on it.You can read it here :http://yourlife.usatoday.com/health/medical/alzheimers/story/2012-01-16/US-launches-national-war-on-Alzheimers/52603476/1",
        "title": "National Alzheimer's Project Act - NAPA"
    },
    {
        "content": "I've written about my friend Lisa Genova, author of Still Alice and Left Neglected. January 20 is a big day for her -- she will be appearing on the Today Show that morning, she will be on Dr. Oz show that day and then that night she is part of a documentary on younger on-set Alzhiemer's.The documentary is \"To Not Fade Away\". It is on at 10:00 p.m. January 20. The bad part for me at least is, that it is airing on RLTV. RLTV is a network aimed at the \"over 50\" age group and stands for \"Redefine Life\". However, it is not in my area. To see if you get RLTV on your cable system, you can go to their website athttp://rl.tv/an put your zip code in. That will tell you whether or not you receive that channel and where to find it.Thanks to Lisa for all she does for our Alzheimer's community. She's working on a new book and I'll tell you more about that at another time.",
        "title": "January 20"
    },
    {
        "content": "I've had lots of comments lately. Many -- I'm not posting here.I'm glad the last post received some comments though -- and to one I too am sad this had to happen to Coach Summitt -- or anyone.It's just Tuesday and this has already been a bad week. Seems like I set out to do one thing and it doesn't go my way and the rest of the day goes down hill from there. I'm frustrating myself by not being able to do some things and that makes me mad. Learning new things is difficult and I get frustrated so easily. I think \"this can't be that hard\" and it isn't really -- I just can't grasp it. It is so maddening!!! And, if I do \"get it\" the answer to it was in front of my nose the whole time and although I could see it and read it -- I couldn't figure out what it was telling me. That disconnect in the brain can play lots of weird tricks on you!",
        "title": "Comments"
    },
    {
        "content": "The Southeastern Conference has posted on their site that there will be a \"We Back Pat Week\" in honor of Pat Summitt, University of Tennessee women's basketball coach who was recently diagnosed with younger on-set Alzheimer's. Thanks to the SEC and the basketball nation for recognizing her courageous stance to bring public awareness to this disease. You can get the link here:http://www.secdigitalnetwork.com/NEWS/tabid/473/Article/230304/sec-launches-we-back-pat-week.aspx",
        "title": "We Back Pat Week"
    },
    {
        "content": "Happy New Year Everyone!I was pretty disappointed in my lack of posts at the end of the year. I really wanted to do better. I would wake up in the middle of the night with the best ideas, plan it all out in my head and by morning, it was gone. I'm sure you're saying, why didn't you get up and write it down. I've tried that before, and when I do, I can't go back to sleep. So, I am giving up ideas for sleep is what it sounds like! Since my sleep is often given up to hot flashes (or \"power surges\" as one friend calls it) I don't like to give up much more!I was overwhelmed with our trip to Australia, and quite frankly it took a lot to get back to normal after that trip. It pretty much took the wind out of my sails if you will. But, it was worth every minute -- it just came at a bad time of the year, but it was the only time we could go and did I mention IT WAS WORTH IT?I don't usually do the traditional resolution thing at the new year. Why should you have to wait for a new year to make a change? If you need to make a change, you need to make a change. I'm not sure I'm up to \"changing\" things this year, that probably isn't within my power -- or at least the things I would like to change are not. But, I need to be better about some things. ....but don't we all.I want to be a better friend. I don't want to keep saying \"we shouldn't wait so long to get together\" -- I just need to make it happen. A few of my friends have kind of gone by the wayside this past year. That saddens me some. I wonder why that is. Do our friendships run in cycles? Do we just not work hard enough at it? Is it maybe the friendship wasn't meant to be? Has the friendship run its course? Am I to blame? I get the feeling people don't want to be around me as much anymore. That's kind of hard to come to terms with but what bothers me more is not knowing. If those that choose not to be friends any longer would just admit it or bring it to a close, rather than leaving that faint hint of welcome in their voice it would be so much better. I know that is hard to do, but I'd rather just know why it is the friendship has ended. We have invested a lot of time over the years and to just let something go without paying attention to it is sad. I don't know what else to say about that.Another thing I want to work on is to be better to myself. I need to pace myself better. I need to let things go more easily. It's hard to admit you can't do something that you could do all your life -- I just need to let go! I'd like to do more public speaking on behalf of Azlheimer's so if there is a group you think I could talk to -- let me know.I'm grateful for a lot last year. My family's health has stayed about the same (not gotten worse thankfully), there have been many new babies born to bring a smile to my face, my son and daughter-in-law have moved \"back home\", I got a new knee and lots of help from friends when I was going through that ordeal. I read Dr. Mary Cail's book, The All-Weather Friend’s Guide to Alzheimer’s Disease and everyone dealing with someone with Alzheimer's should read it. I've stayed active on Alzheimer's Association's boards. Our Walk to End Alzheimer's reached its targeted goal of $75,000 raised. And, of course, the aforementioned \"trip\".The bucket list got a little shorter this year, but I'm thinking of adding more things to it. There really can be no end to your bucket list if you really think about it -- there is always something you want to do. I've been very fortunate all in all. I'm still pretty active physically even though not as much mentally -- but I'm hanging in there.Thanks for all your support. I'm going to try to be better about blogging in this new year.",
        "title": "2012"
    }
]