[
    {
        "content": "To everyone reading this.  My friends and family keep me going and that is the best gift a person can have.  I love you all.",
        "title": "Happy Holidays"
    },
    {
        "content": "Our family just returned from a short stay in New York.  It was great fun.  We got to see some shows and enjoy New York during Christmas.  All the Christmas lights made the city sparkle.  It was cold -- but we were only there for a few days so we could take it!It was so nice to spend time as a family.  At times, things were a little confusing for me, but I still managed o.k.  I realize our \"family time\" is going to be more and more limited, both in terms of my health and the fact that my son is getting older and won't want to go with his parents on vacation.  But so far, he has managed to tag along and tolerate us having our family time.The best part of all is always the ice skating part.  I love to ice skate and my son laced up some skates and skated with me at Rockefeller Center.  It was just great.  I have always loved to skate and it doesn't matter how cold it is or what the conditions are, I just love to skate.  I guess growing up in Illinois helped with that as most Southerners don't seem to appreciate it as much as I do.We had very little bickering on this trip.  Not that we usually have a lot but there always seems to be those times when we argue over where we are going to eat, what we are going to do, how to get there, etc.  But, for some reason this trip was good in that regard.  It's strange that I think about that -- but I'm glad we didn't have that on this trip.It was a nice holiday present for me -- time with my family -- that's what I like most.",
        "title": "New York, New York"
    },
    {
        "content": "Last week my husband and I went to a one day conference on Alzheimer's in Atlanta.  It was really interesting and we got to catch up on the latest news in what is happening with research and the like.  But, it was the first time since I retired that I was in a \"classroom\" situation, listening and having to pay attention.  I was amazed at how bad I was at this!  I couldn't follow a lot of what was being said and I thought my head was going to explode after a couple of hours.  I'm glad I don't have to concentrate for long periods of time anymore!It's a couple of weeks before Christmas and here in the south it is still quite warm.  Our family is going to New York City next week just to \"play\" and it is suppose to be cold there -- I'm glad of that -- perhaps it will get us into the spirit of Christmas a little more.  And, I love to ice skate so I am looking forward to skating in Central Park and at Rockefeller Center.  It is so beautiful there with the Christmas tree and everything.  I'm glad I will get to enjoy this with my family.  That is what the holidays is really about -- spending time with the people you love. And, unfortunately, missing the ones you can't be with.",
        "title": "The holidays"
    },
    {
        "content": "Several years ago I met a couple of women who are big Kenny Rogers fans.  They contacted me when our venue was hosting Kenny Rogers for a two night concert.  Their names are not Thelma and Louise but I started calling them that because they have such a zest for life and a little crazy -- I say that affectionately.  When I started calling me them that they didn't even know who Thelma and Louise were so they watched the movie and called me and said \"But we didn't kill anyone!\" -- which is true of course, but they still remind me of Thelma and Louise.Last night I went to a Kenny Rogers concert with Thelma and Louise in Atlanta.  It is my second concert with them.  Last night marked their 896th concert of Kenny Rogers -- yes, 896.  It is rather amazing -- and they love him more today than they did years ago when they started going to concerts.Thelma and Louise are sisters and this is their passion (obviously) -- but they are so happy when they are doing it -- I can't imagine being that happy over something you have seen 896 times!  But that is what makes life interesting -- those types of people and thank God for them.  I love these women -- they have become friends in a short time.  I wish I had their enthusiasm for life!",
        "title": "Thelma and Louise"
    },
    {
        "content": "Tomorrow is Thanksgiving.  It is amazing how time flies isn't it?  My son is coming home tonight and staying for a few days.  That always seems to cheer me up.  I'm grateful he takes time for his family and always has.This hasn't been a real good week for me.  And, the bad thing is that when I have a bad time, it is very difficult for me to find the right words to tell somebody about it.  Usually my husband picks up on it and helps me along but he hasn't been doing that lately -- I think he is just missing the cues.  But, I can't tell him about it because I can't find the right words to express myself.  Never having had a problem with expressing myself before, this makes it even more difficult to deal with.  I guess it goes back to the \"aloneness\" of Alzheimer's -- you feel so alone because you can't communicate effectively.  I guess the upside to that is that if I can't tell anyone that I'm having a problem I'm less of a burden!Hope everyone has a great Thanksgiving.",
        "title": "Thanksgiving"
    },
    {
        "content": "Gosh -- next week is Thanksgiving.  The time certainly flies.  We have finally finished up pretty much everything on our Memory Walk and we brought in almost $30,000.  We are so pleased with the effort...and the good thing is everyone is on board again for next year.  This committee of ladies that worked on the event this year were so great and caring.  I just hope that I will be able to help in some capacity -- I hate to make too many committments too far out because I don't know what kind of shape I'll be in at that time.The holidays mean more to me now and I know that everyone says that we take everything for granted.....and we do.  That is a real shame isn't it?  It seems like something bad has to happen in order for you to realize that.  And, I really don't want presents I want time with my friends and family.  That is the most important thing to me.",
        "title": "Thanksgiving"
    },
    {
        "content": "Well, our Memory Walk is history.  The day was truly amazing.  Seeing all those people come together for our cause was very touching and humbling to me.  We had hoped for about 300 people and we came close to that.  The Alz. Office is counting our money but we are hopeful that we reached our $20,000 goal.  The weather turned out great and the walk was awesome.I can't thank everyone enough for the hours they put into making this happen along with everyone who donated money.  Thanks to all of you reading this that made that happen!One thing that struck me is that strangers called me during the week after seeing the publicity in the paper and asked if they could come out and volunteer.  I know people volunteer all the time but to have people just call, without knowing anyone else or doing it with a group is amazing to me.  Maybe I don't give people enough credit -- because like I said, I know people volunteer all the time, but it usually a case where they are tied to the cause or have family or friends involved and they want to help.  But that wasn't the case with some of those that showed up to work today -- they just wanted to help.One of my friends had surgery on her foot and she came to the walk in a motorized wheelchair so she could \"walk\" with us.  The funny thing about it is, that she had the surgery two weeks ago and never told me.  We talk on the phone but we don't see each other very often.  She didn't tell me because she knew that I was working hard on the walk and she knew (or she thought anyway) that I would be over there helping her and worrying about her and not working on the  Memory Walk.  You can imagine how surprised I was when she showed up in a wheelchair.  That's friendship.  And, that's friendship you don't find real often.I am truly fortunate to have such wonderful people in my life.  My friends and family pitched in where ever they saw something that needed to be done and I cannot express my gratitude enough.When we find out how much money we raised I will let you know.  Thanks again for your love and support.",
        "title": "2004 Memory Walk"
    },
    {
        "content": "I hope everyone is planning to vote next week -- or if you get the chance to vote early as some states have that option.  It's important to vote -- please do!Our Memory Walk is in a little over a week.  Things are picking up and I am so appreciative of everyone's efforts for the Walk.  Since it is the first time the walk is going to be in our town in several years, we are hoping for a nice showing.  We hope to build from this first year.This week I spoke to a support group in a neighboring town.  I am always so impressed with the groups that I speak with.  This group has dealt with Alzheimer's in a very personal way by caring for those with the disease.  I admire them so.  I have said before that I think this disease is much harder on the care givers than those of us that suffer with the disease.  We all have our problems, but the patience these people possess is amazing.  Thank God for those people.",
        "title": "A Busy Time"
    },
    {
        "content": "Well, I said I would be better about writing in here but I realize it has been a couple of weeks.  Sorry about that.  I have been busy with the Memory Walk and working for my friends House campaign.  It has been fun, but exhausting.  I have probably taken on more than I can handle but in a few short weeks it will be over and then I am not taking any new projects on until after the first of the year -- if then!I had our Memory Walk team over for a cook out last week and it was nice to get everyone together.  They have all worked so hard in collecting money for the walk.  It means so much to me and there will never be a way I can thank them adequately for going above and beyond.  The walk will be good this year.  It will be smaller than I think we wanted it to be but I might be surprised. The newspaper is doing a feature story on the walk on November 2 (election day -- be sure to vote) so I hope that raises some awareness of the walk as well.My son turned 21 this week.  Turning 49 didn't bother me much -- but now I feel really old since he is 21.  He has turned out pretty well and we are proud of all he does.",
        "title": "Back Again"
    },
    {
        "content": "Today is my 49th birthday.  It has been a rather emotional day -- upon waking this morning I received word that a dear friend had passed away from pancreatic cancer.  We knew that it wouldn't be long for her but it is still difficult.  Earlier in the week, a business associate that I had worked with for over 15 years passed away with cancer.  His memorial service is tomorrow.  Just about a month ago I was faced with two others passing away within a week of each other.  I'm much more emotional than I used to be so these types of things hit me harder than I expect them to.But, the bright side of my day was that my boy came home from college to surprise me for my birthday -- that is all I wanted for my birthday was to see my son -- and I didn't think it was going to happen for a lot of reasons.  But, it did, and that made me very very happy.",
        "title": "Up and Down Day"
    },
    {
        "content": "Have you ever had a panic attack?  It is not a fun thing.  I've been experiencing some lately and it is awful.  I remember a long time ago talking to someone with early on set Alzheimer's and she told me that she couldn't leave the house or get around a lot of people because she would get panic attacks.  I had them years ago and they went away -- now I guess they're back although not too bad!  What fun life is.The weather has started to turn cooler here and it so nice to be outside.  I also feel like working around the house a little more -- you don't get so hot.  I realize how much I have neglected the house over the years -- I'm glad my husband was there to pick up the slack.  I'm going to try to do better.  If I could accomplish one big chore a day it would be great -- but I haven't been that ambitious.Back to the doctor today for my three month check up.  I suspect everything will be o.k. -- we'll see.",
        "title": "Panic Attacks"
    },
    {
        "content": "Yes, it has been almost a month since I wrote in this blog -- thanks to the many that have reminded me in the last few weeks.  I always think that what I write in here is so negative that people don't want to read it...so I'll try to be better.I am working on our Memory Walk -- it has been a bit of a struggle getting everyone to buy into here in Athens.  It is different than most of the \"walks\" in Athens, because most people just register the day of, pay their $10 or $15 to walk and it is over.  Since this is more of a fund raising issue, it doesn't work quite that way and it is just getting people to change their mind set.  It will turn out fine -- it is just change for many people.I have 15 or so people on my team this year and that is good.  I hope collectively we can raise $3,000. Last year we raised over $2,000.  However, many of the people on my team are forming their own teams this year since the walk is in Athens, so we may have to try a little harder.I go back to the neurologist next week.  Hopefully he will think I am doing better -- I certainly feel a lot better by not working.  I feel like I can contribute a little more to home life these days.A lady in Atlanta called me this weekend -- she is 53 and was just diagnosed.  She still works and is doing well -- she really just wanted to find out a little more about my situation and what she thought she might be facing.  She feels that she can continue to work for awhile and that is good as long as she can do it.I'm going to quit for now, but I promoise -- cross my heart -- to be back more often.",
        "title": "OK, OK"
    },
    {
        "content": "I know that I have discussed how much I enjoy playing tennis and how at times it is hard because of all the noise on the courts.  People talking and yelling distract me and it is hard to focus on the game at hand.Well, about a week and a half ago, I was out playing tennis with my husband and something a little different happened to me.  I was playing and I could not figure out what I was doing out there.  I was getting mad because all I knew was that my husband was on the other side of the court hitting balls at me.  I was trying to bat them down because I didn't want them to hit me -- I was totally unaware that I was out there to play a game -- I just couldn't figure out why my husband was hitting balls at me.Then I looked around at the other courts and saw the same thing happening on the courts and couldn't figure out why people would intentionally be hitting balls at each other because someone was going to get hurt!  After about ten or fifteen minutes I just broked down crying on the court because I couldn't understand why my husband would want to hurt me by hitting balls at me.  After a time out on the court for me to cry I regrouped, figured it out and when on to play.  And, after my husband played easy on me for a few games, I ended up beating him -- but he really won -- because he had to put up with me!",
        "title": "Tennis"
    },
    {
        "content": "The week started off kind of quiet with the son off to college.  I am always sad when he leaves (even though it is quieter) and even though he is only a little over an hour down the road at school it seems like he is a lot farther away.  I can't imagine when he goes off to law school next year what that will feel like.  I always worry about how he will see me the next time he comes home -- will he notice changes in me, will he be surprised with what he sees?  I guess I worry too much.  There's not much he can do about it anyway.I think I have somewhat of a routine going these days.  I'm better in the morning and since I have always been a morning person that is probably a good thing!  So, getting errands and such done in the morning and settling into \"home\" things in the afternoon seems to work for me right now.  Things come up that throw me off but I seem to be doing o.k. with everything for the moment.One thing I have noticed lately is that talking on the telephone is a little more difficult for me.  It's not the talking part, it is taking what the other person is saying, understanding what they are saying and putting the right words together for a response.  I am sure that sometimes the person on the other end thinks I'm not paying attention, but it takes me longer to put into words what I want to say.  I tend to lose the flow of the conversation if it is a long one and then I know my answers probably don't make much sense.  I ask a lot of questions on the phone,probably repeating myself several times in the process.  I remember before I was on my medication I asked those that I worked with that the preferred method of communication with me now was either putting a note in my box or email.  That way I could go back and look at it several times if I needed to.  It's hard to do that with a conversation.",
        "title": "The Week"
    },
    {
        "content": "Last week my son and I did a radio interview.  It turned out really well.  Leeza Gibbons was on with us and she was talking about her Leeza's Place that she has started.  She was very delightful and she was very accommodating.  She stayed with us for the whole hour and that was not something I was expecting her to do.Today, as I write this Fox 5 from Atlanta is here doing an interview on our family.  They are actually shooting me typing this.  The interviews are hard and although they can sometimes seem effortless it takes a lot of energy out of me and I know my family when doing these.  Sometimes we don't like to talk about the disease because it is not always pleasant to talk about -- but I know we have to for everyone's sake -- it is just not that easy to do sometimes.  I have thrusted my family in the spotlight for two years now and they don't seem to mind.  My husband is particularly shy so I know that it is a stretch for him, but he does it.  He knows how important it is to spread the word.Many have asked about my retirement and how it is going.  It certainly is different but I am enjoying not having to work the long hours and deal with the stress.  I still have my moments, though.  I'm trying to work myself into a routine.  And, my friends are pretty good about not \"overdoing it\" on me.  I get lots of calls to do things but when I have to say no because I'm just not up to it my friends know that it is because I have a hard time with it on that day and it isn't a reflection on not wanting to do things with them.  I hope they keep remembering that!  My friends get me through my tough days and it is great to know they are out there when I need them.Alan goes back to school this weekend.  It is going to be strange not having him around -- but then it will certainly be more quiet!",
        "title": "The Media"
    },
    {
        "content": "Tomorrow my son and I are doing a local radio show.  I have done the show on numerous occasions some about my job, but the last two years I have been on to talk about Alzheimer's.  Tomorrow will be my son's first time on a radio program.  He has stepped out in the limelight on my disease with television and newspaper reporters, but not radio.  I'm proud of him for doing it -- he knows how important it is and I appreciate it.  Also on the program with us tomorrow will be television personality Leeza Gibbons.  She has started \"Leeza's Place\" for those with Alzheimer's.  Her grandmother passed away with the disease and now her mother has it.  I don't know what it must be like to be children of those with the disease and wondering whether they will get it or not.  I know how bad I feel thinking that I may have passed this on -- but the question out there remains whether you want to know or not.  There are pros and cons to both sides of that story.I am enjoying my retirement.  Of course, as I have probably stated before, I have to be careful to pace myself.  So far, I'm doing pretty good.  I am taking time to do some things around the house but one of the most important projects that I am doing is re-doing photo albums and scrapbooking.  It takes a lot of time but I want to do these things for my son in particular. I'm beginning to forget more and more and I want to capture the memories while I still have them.",
        "title": "This and That"
    },
    {
        "content": "So far, retirement is pretty good.  I love not having to get up in the morning and get dressed for work.  I still get up early out of habit, but it's nice to know that I don't have to.I'm enjoying my peaceful time at home.  People keep asking me what I am doing to stay busy, because if you know me, you know that I am always doing something.  However, that has changed.  I'm not the same person anymore.  My personality has changed and of course my thought processes have changed as well.  I don't need to be busy every second of every day.  That is why I retired.....to have some time to be able to deal with life.  I honestly do not know how I worked every day -- I know I wasn't keeping up, but the energy it took was so exhausting.  I didn't realize how tired I was until I stopped working.My life is different now.  It's hard for people to understand that about me.  But that is o.k., they don't have to.I do have a few projects I am working on and I have had to tell a lot of people \"no\", which I didn't used to do.  But I know my limits -- I can't do the things I used to do -- eventually others will figure this out as well.  I want to do as much as I can, but that is a lot different than what it used to be.I have a lot of friends that are concerned about me in my retirement.  Right now I'm doing fine and it makes my happy that they care about me.",
        "title": "Retirement"
    },
    {
        "content": "A friend of mine passed away last week.  She had been ill for a long time -- in and out of remission of a disease.  She was one of the first people that we met when we moved here almost 25 years ago.  Her memorial service was today and I sat there hoping that when it comes to be my turn that it will be as nice.  She had a lot of friends that loved her. She was only 54 years old. That's sad.I was also reminded at the service how my memory is fading.  There were so many people there and I couldn't remember their names or realize how I should know them.  That has always been one of my strong points and that is something I am going to have to get used to.  The medication I am on has been good at helping but I know it isn't the cure! Don't I wish that it was.",
        "title": "Death"
    },
    {
        "content": "Well it has been so long since I wrote in here, that I went to edit my post and found that I had deleted it, so I had to start all over!I am officially retired now and since it hasn't been but two weeks since this has happened I only feel like I am on vacation.  I'm sure that will change shortly!I went back to the doctor last week and he wants me to increase my medicine a little.  That is always a bummer.  And, it will be important for me to establish a routine now that I am home.  That might be the most difficult thing for me to do!We went on a short vacation to Toronto last week.  It was nice getting away with the family.  It does really exhaust me because I have to be so attentive all the time and it really wears me out.  I did get pretty confused on the subway, tram and bus system, but that is what my family is for these days -- to help me maneuver.  We did have a great time and the trip was just long enough.  It is so important we do these trips because I'm not sure how long I will be able to travel like that.I promise to be better about putting in some posts -- now that I am a lady of leisure!",
        "title": "Retirement"
    },
    {
        "content": "I know I wrote in here a few weeks ago that I was dreading my retirement party.  Well, the party was yesterday and it turned out great.  It was a little overwhelming but I got through it.  I think my biggest surprise is that my brother travelled from Illinois to be here to surprise me.  My son knew that he was coming but I didn't.  I was so surprised.  The staff at work did a good job in keeping it low key and not a lot of speeches.  It was truly a humbling experience seeing all the folks that came out to wish me well.  It was awesome.  I will write more later.",
        "title": "Retirement Party"
    },
    {
        "content": "It's been said many times that Alzheimer's is a disease of loneliness.  Loneliness in the sense that others don't realize what you are going through, loneliness in the sense that people around you don't know how to act or react so they don't and loneliness in the fact that you feel all alone -- no one can really do anything to help you. If you were ever the last one picked in gym class you can probably understand this. I see my friends and family going on about their lives and I can't participate or I sense they don't want me to because I can't contribute.  I don't blame them...they aren't being cruel....it's just life these days.",
        "title": "Loneliness"
    },
    {
        "content": "died yesterday at the age of 93.  He had Alzheimer's.  I was always kind of indifferent to President Reagan never really feeling one way or another about him.  When he announced 10 years ago he had the early stages of Alzheimer's, I remember feeling sorry for his family and wondering what they would have to go through in the years ahead.  Needless to say, his death has had a bigger impact on me than I thought it would.  I don't think I need to say anymore.On a lighter note, some friends came from Illinois to see us this week.  They drove the 12 hours or so, stayed a day, went to Atlanta for a day and drove home.   That's friendship.  It means so much to me that I have friends like that. It's hard for me to see them leave because I don't know when I will see them again or if by the time I do see them again whether I will remember them or not.  So, I try to cherish the time I have with everyone not knowing what lies ahead.As retirement approaches at the end of this month, my list of things I want to do grows longer.  That's probably a good thing.",
        "title": "President Reagan"
    },
    {
        "content": "I know.  This is getting more and more difficult to write.  It's not that I don't have things to share it is just I don't think anyone would find them interesting!It's Memorial Day Weekend and things are kind of quiet.  I have one more month to work with only one more major concert to do.  You have no idea how much I am looking forward to at least getting this last concert done!  It's getting so hard to do and I just want it to be over.  In a little more than a week it will be and hopefully with not many problems.On a brighter and much more different note, there will be an Alzheimer's Memory Walk in Athens this year.  A lovely individual has stepped forward to organize it and I hope I can be of some help.  I have wanted to do one here but knew that I couldn't organize it.  It's a massive undertaking and we are fortunate to have a lot of peole step forward to help.  It will be Saturday, November 6th and I'm looking forward to it.",
        "title": "It's been awhile"
    },
    {
        "content": "OK -- I started logging into this Blog page to write something and they have changed the whole format of how you do things.......and then expect me to understand it.  So, I'm hoping this posts o.k. -- change is not a good thing for someone with Alzheimer's.Yes, it has been awhile since I posted.  Finally getting back to somewhat of a routine after Alan's graduation.  He hasn't been home much since he graduated because he has been working alot.  But, it sure is different with another person around the house when you are not used to it.  It is hard for me when he and his dad are talking and the television is on -- I can't filter through everything and it sounds like just lots of loud noises in my head.My office wants to give me a retirement party at the end of June.  That is really bothering me.  All the people, all the emotions, all the fuss.  I just want to \"go quietly into the night\", but that isn't going to happen.  These kinds of things are very dfficult for me and it will be hard.  I know I am obsessing about it and I need to stop thinking about it because it is a month away.  I was hoping to influence the party someway that it could be very low key but I think it is getting out of hand.  More on that later I'm sure.",
        "title": "Change!"
    },
    {
        "content": "I know it has been awhile since I entered something in here.  My son's college graduation was this weekend and my two brothers from Illinois came down for it.  It was awesome to see them and I am so glad they could come.  I don't spend a lot of time with them, but when I enter retirement I am hoping that I will be able to visit them more often.  But, the weekend was pretty tiring for me.  I actually \"did pretty well\" the whole weekend, not getting too confused but I really tried to stay focus most of the time and it is exhausting.I found going back to work on Monday pretty hard.  That whole \"working the mind\" stuff didn't go so well.  Since I was tired, I made a lot of stupid mistakes and stayed pretty much in my office and out of harm's way.  I feel like I hibernate most of the time, trying not to venture out of my office much just because it is too difficult to get back on track once I do.  So, I do better in my quiet office, all by myself.My office wants to have a retirement party for me and I have been fighting it.  I don't want a party but they are determined to have one whether I want one or not.  So, I have decided to give in and I figure that if I can be part of the planning that I can maybe steer it my way -- not too much fanfare.  I just want to go \"quietly into the night\", but that is obviously not going to happen if I don't have something to say about it.  I have a hard time around a lot of people and I will sometimes feel like a panic attack is coming on because of all the noise and trying to sort everything out.  I just get too confused and I am easily overwhelmed.  I know they know that and will take that into account when planning the party but I am still very uncomfortable about the whole thing.  I certainly don't feel like a deserve a party and just don't want a fuss.  However, I have specifically asked for no one to bring gifts and if people would like to make a donation to the Alzheimer's Association that would be great.......perhaps there is an upside to this!  I know they mean well and I appreciate the thought......I am just not very comfortable with it.  I guess I have about a month to get used to the idea and we'll see what happens.  I'm sure you will be reading more about this as we get closer and I get more anxious!",
        "title": "Graduation"
    },
    {
        "content": "There's a lot going on in my life right now and it is overwhelming to me.  It's at times like this that I'm not sure my medicine is working, but I know it must be or I probably wouldn't be able to function.I keep thinking that \"once I get past this weekend\" or \"once I finish this project\" I'll feel better and I probably will -- it's just that all of those \"things\" seem to be coming at me at once.My son graduates from Georgia Tech this weekend at the top of his class.  And, he did it in three years.  Pretty amazing -- he is a pretty amazing kid.  You can imagine how proud I am of him.  My brothers are coming to visit for the graduation and I'm really happy about that.  On the other hand, I'm nervous because it is out of my routine and I don't do so well with new things.  But having my family around me makes a difference and I can get through one of the proudest moments of my life so far.",
        "title": "Confusing"
    },
    {
        "content": "Yes, I know it has been awhile.  Writing in this blog is harder than I thought it would be.  I've been thinking alot about change lately.  Change is inevitable I know, but sometimes you don't notice it until it comes at you in big chunks.  Change is sometimes good, sometimes bad.  Change affects many people. And changes in other people's lives affect our lives.  In the past week and in the weeks and months ahead, these things have or will be happening --- my son will be graduating from college, I will be retiring, a dear friend is moving several states away, another friend has just dealt with a scare from cancer, and another friend is running for political office.  That's a lot of change.",
        "title": "Change"
    },
    {
        "content": "having three days off of work.  I feel so much better when I don't work.  The pressure and the constant \"drain on my brain\" takes such a toll on me.  We were off on Good Friday and then I had the weekend.  I didn't do much and I probably should have, but I didn't.  On Friday I did run some errands and had a little bit of a hard time doing them myself, but I paced myself and I didn't do everything I wanted to, but I was proud of what I did get done.  They are doing a lot of construction work around our neighborhood and it gets me very confused because everything looks different.  So, I try to avoid that area as much as possible.  It's weird how something that simple can throw me off. It's back to work now -- only a few more months left. I'm making more mistakes at work -- that's not a good thing.  I feel like I have enough people watching over what I am doing now that if I do make a mistake someone will catch it.  Let's hope so at least.",
        "title": "It's been Great"
    },
    {
        "content": "I'm \"home alone\" for a few days as my husband is traveling on business.  It's been awhile since I have been home alone.  I know my husband worries about me while he is gone -- that I take my pills, that I remember to feed the cats, etc.  As long as I stay on my schedule and don't wander from my routine too much I'm o.k.  I don't go far from home though!  I have plenty to keep me busy around the house.  I just hate the thought of anyone having to worry about me.",
        "title": "By myself"
    },
    {
        "content": "Last year I went to the Alzheimer's Public Policy Forum in Washington DC.  It was very educational, enlightening but very draining.  It was the first one I went to and it opened my eyes.  The conference was held again last week but I didn't go.  I wanted to, but I know how hard it was for my husband last year to go with me and I wasn't sure I wanted to put him through that again this year.  But, I went on line to see what had happened on the Alzheimer's website.  I am so encouraged with what everyone is doing to help the cause.  On the website there are transcripts of testimonies that people gave that are very touching.  One in particular was from an \"email pen pal\" of mine, John, who spoke about his lovely wife who was diagnosed with AD and how he has been caring for her and his devotion to her.  What love he has for her and how I admire him.  It's individuals like John that make a difference in this world.",
        "title": "Alzheimer's Public Policy Forum"
    },
    {
        "content": "I've always had a passion for tennis.  When I was growing up I was a big tomboy.  My brothers were into all types of sports and I wanted to be too.  They wouldn't let me play baseball with them so I would take my tennis racket and hit the ball against a wall while they played baseball.  I did this for hours -- or so it seemed.  Over the years I have played a lot of tennis.  And, admittedly so, I am a tennis snob.  Hate to lose, love to win, only want to play with good players, etc., etc., etc.  I know how selfish this sounds, but at least I can admit it.  I like to think that I am anEXtennis snob.  I hope so, but I guess you would have to ask someone else to be certain.  Today, I went out and played.  I haven't played in about 6 months.I was shocked at how bad my concentration level is now.  I know I have mentioned the stuff about how noise bothers me and makes it hard to concentrate.  When I was playing tennis there were people on other courts talking, some children out playing behind the courts and a family pulling a wagon over a wooden bridge.  I couldn't concentrate on hitting the ball.  My brain could not put into place the steps you need to actually hit the ball.  I just had to stop until the noise quieted a little.  I didn't ACT devastated but deep down inside I was.  Another of the things I am passioniate about in my life has become an obstacle.  Of course, I'm not going to quit playing tennis.  I just have to pick quieter times to play.On a brighter note, my son called from college this week and told us he had won an award at Georgia Tech which is the highest academic honor you can win.  All of those nominated have 4.0 grade averages and then all of the other things they do plays a part in the award.  I'm so proud of him. It's moments like this that I can share with him that make me the happiest.",
        "title": "Tennis and My Son"
    },
    {
        "content": "Me, my family and my doctor have finally decided it is time for me to retire.  It has been a hard decision to come by but I know that it is best for me.  Not being able to do my job and not being able to have a somewhat \"normal\" life at the same time has become impossible.I let the staff where I work know today that I will retire at the end of June.  It gives me a few months to get things in order.  I was going to wait until May to tell them, but rumors began rumbling around the office and I decided that it was better they hear it from me than from rumors.This is definitely a crossroad in my life.  Having to admit that I can't do my job is hard. I know that the quality of my life will be much better when I'm not working.  I have accepted it -- it is much harder for those around me to accept.  They don't have to live with this everyday --I do.  And, I know when the idea of it wears a little on them, they, too will know this is the best thing for me.",
        "title": "Retiring"
    },
    {
        "content": "There was a news clip on NBC tonight about a family that has several members suffering from Alzheimer's.  It's a different family than I have discussed in this blog earlier.  But, they are having testing and research done on their family to see if they can help find a cure.  I wish I could do more. If I knew what to do I would do it.",
        "title": "Families with Alzheimer's"
    },
    {
        "content": "I don't \"get out\" much these days....and it is on purpose.  I used to be the one that always wanted to be on the go, but now I am much more laid back and content on staying somewhere where it is quiet, not confusing, and peaceful.  But yesterday, we went to see my son and his girlfriend and went to see a Broadway show.  It was really great -- I was actually able to follow the story line!  Then we went out to dinner.  At dinner, I excused myself to go to the bathroom and then realized after I was in there that I wasn't sure where I was!  There goes that routine again!  Anyway, after a few minutes of trying to get my bearings I tried venturing out to realize I was in a restaurant.  I located our table and the faces were familiar.  Eventually, I was understanding where I was and what I was doing -- but it is a little scary when those things happen.  Luckily, they don't happen very often!",
        "title": "Getting Out"
    },
    {
        "content": "since I have written I know.  I apologize -- but I forgot my password to get into this thing!  So what else is new!  The past few weeks have seemed like a whirlwind to me.  Lots of things have happened and I can't go into detail about them just yet, but hopefully it will calm my life a bit.  Stay tuned.I spoke to a great group of people this week.  I do a couple of speeches a month usually and I always think it does me more good than it does those I speak to.  The people are really receptive to what I have to say about Alzheimer's and I hope that I am able to put a different face on the disease for them.  It's hard to know what to say....sometimes I think I scare people.....but it comes from my heart and that is all I can do.  I wish I could do more.Thanks for checking on this site.  I appreciate your comments and your feedback.  I promise to get better about writing on a more frequent basis.",
        "title": "It's been awhile"
    },
    {
        "content": "I've been totally useless this weekend.  I've not gotten out of the house but to go to the grocery store.  I don't know why -- but I just didn't feel like doing much. Some times you just have those days.  I worked around the house but felt pretty useless other than that.My son comes home for Spring Break this week.  That always perks me up.  He always cheers me up.",
        "title": "The weekend"
    },
    {
        "content": "I went to the doctor yesterday.  I wasn't having a good day so I had a pretty good feeling that my \"tests\" weren't going to be real positive.  And, they weren't.  I didn't do very well on my mini mental test he gives me.  It's very frustrating.  I have to cut back on the hours I'm working.  My husband went with me and we discussed my work situation and the possibility of how long I will be able to continue to work.  It's getting much more difficult for me.  I think we have pretty much come to the conclusion that my working days are limited. That's a hard thing to accept, but there comes a point where you have to embrace it....and I'm pretty close to that.Sometimes I feel as if the disease is taking hold of my neck and choking me!  I want to choke it right back!When I got home last night I received a package from a friend of mine, Pody, in Illinois.  It was a scarf that she had knitted for me.  The funny thing about it is that if you knew Pody, the word knitting, would never be used in the same sentence as her name.  However, she has taken up knitting and she sent me a sample of her work.  I really love it and I love the fact that she thought to send it to me.  Friends are great that way -- it seems like they are always there for me when I need them the most -- even when they live far away!",
        "title": "The doctor's visit"
    },
    {
        "content": "Sometimes I don't realize what a toll work takes on me until I have a day off.  That's probably not a good thing.",
        "title": "Work"
    },
    {
        "content": "Friends are so great.  They take your mind off of things. They laugh with you. They love you for you.  I'm so thankful I have friends.",
        "title": "Friends"
    },
    {
        "content": "Yesterday was not a good day.  I couldn't remember my cat's name.  I have found that watching movies or reading books is something I don't do well.  I can't keep up with the story line of the movies and I can't remember what I've read from page to page.  It's frustrating.  Last night my husband was watching \"The Hours\" which is suppose to be a good movie.  I thought I could follow it -- but was lost in the first fifteen minutes.  I'm not very good company when watching movies because I ask a lot of stupid questions.  So I just don't watch.",
        "title": "Not a Good Day"
    },
    {
        "content": "I'm so unproductive these days.  Work has been really hard this week -- lots of things to deal with outside of the norm -- which of course, throws me off my routine -- and we know what that does.  Staying focused has been extremely difficult.  I have my good weeks and my bad weeks.  I think I'm still trying to recover from the long Willie Nelson day.  My short term memory is getting a little worse.  I know people are noticing more and more but they don't want to say anything to me!",
        "title": "Unproductive"
    },
    {
        "content": "It is amazing to me how being tired affects your brain.  I never used to notice this unless I had been going at full speed for several weeks and then things came crashing done on me.  However, since it takes so much energy to concentrate and focus with Alzheimer's, I get tired and totally exhausted a lot quicker than I used to.  We had Willie Nelson in for a show on Sunday night so it was a long day and dealing with everything took its toll on me.  On Monday, I was in meetings all day and today I'm just running on empty.  At least my brain is -- thank God I'm on medication because I cannot imagine what I would be like if I wasn't.",
        "title": "Exhaustion"
    },
    {
        "content": "Several people have called me lately to ask me why I haven't written anything in my blog.  The problem is I think of all kinds of things to post here, but then I have second thoughts.  I don't want this to sound so depressing or always talk about the difficulties I face, but that is what is on my mind most of the time.  Work has been extremely hard this week and at one point, I was so confused I wanted to call my husband and ask him to come and get me so I could go home and snuggle up in a warm bed and take a nap.  Nothing was making sense and I didn't know what to do about it.  My brain had turned to jello and it was melting!  Somehow, I regrouped and made it through the day but it was tough.  I've mentioned before that routine is very important to me and I have bad days when my routine is out of kilter.  Having this cast on my foot has definitely changed my routine and perhaps that is contributing to my difficult times of late.I had a confrontation on the phone with our cell phone provider and I was so confused by what she was saying that I know that I was not getting across to her.  I knew exactly what I needed to say but the words could not come out and I got very frustrated.  The whole situation was frustrating but I felt taken advantage of.  Another instance where I felt this way was when I went into a drugstore to buy a lot of things and I had a bunch of coupons.  When I was being checked out I knew that the clerk had not rung it up properly to take into account my coupons and the sales items, but I couldn't explain it to her.  It was all in my head, but I couldn't get it out properly.  I felt like a senior citizen being scammed by a con artist. There was absolutely nothing I could do to make the situation right because I didn't have the capability of communicating the right way.  That is also a good reason not to go shopping by myself -- which I don't do very often.But, I was able to enjoy a weekend with my son home and celebrated my husband's 60th birthday yesterday.  Those are the nice things I hope I can remember.",
        "title": "This is Hard"
    },
    {
        "content": "Well, this week has been the pits.  I can't adjust to having this cast on my foot.  My husband is right in saying that this cast is bothering me much more than it should.  I hate to be dependent on people and I think I'm looking at my future with Alzheimer's and knowing how much more dependent I will be on my family as my illness progresses. That's not fair to them and there isn't anything I can do about it.  It will be much worse than dealing with someone with a cast on their foot!  The thought of that depresses me greatly.....my family doesn't deserve that.",
        "title": "The Week"
    },
    {
        "content": "This month's issue of the in-flight magazine has an article about the Alzheimer's Association in it.  It's a great article --if it had not been for them and their support I'm not sure that I would be doing as well as I am.  If anyone is reading this that has Alzheimer's and has not contacted the association do it now.  There is a link on my page -- it will not only help you but your family as well.My son is coming home from college this weekend.  I've been really down about this stupid cast on my foot --he always brightens my world when I get to see him.  I know I'll feel much better by Monday.",
        "title": "Delta Sky Magazine"
    },
    {
        "content": "When I was in the hospital this weekend I had to put on my form \"Alzheimer's\" when they asked about current medical conditions.  I'd never had to do that before and that is pretty weird. Anyway, when the doctor came in to see me he said \"You have a little bit of early on set Alzheimer's going on, huh?\" I said yes, and he said \"Well, you look like its not bothering you too bad\" or something to that affect.  How does he know that from just looking at me for 5 seconds before he said it?  I looked awful already -- no make up, didn't mess with my hair, had just gotten up in the morning and then he said that.  Most doctors don't have a clue what you go through when you have Alzheimer's.  Many Alzheimer's patients complain about people saying \"you look great --you must be doing great\".  That really wears thin after awhile.  I know they mean well and they don't know what to say.  But......As you can tell, I'm probably not having a good day.",
        "title": "Doctors"
    },
    {
        "content": "I had to go to the hospital this morning.  It's a short story.....my foot started to hurt mid-week and by this morning it really hurt.  Decided to go to the hospital to have it checked out only to come home with a cast on my foot -- a stress fracture.  A couple of weeks on crutches and then we'll see. But, I was really confused at the hospital.  I was so glad Ralph was with me. I was able to answer all the questions but I know if Ralph had not been with me I would have had a panic attack or I guess if truth be known if Ralph hadn't been around I probably wouldn't have even gotten to the hospital would I?  I'm so grateful for my husband, my family.....and friends.",
        "title": "Confusion Reigns"
    },
    {
        "content": "I've certainly been in a funk lately.  I have no desire to do anything .....don't want to go to work, don't want to get out of bed, don't want to socialize, nothing.  I'm sure it is depression but I hate it when this happens.  I just don't feel of much use to anyone so I'm pretty miserable to be around.  The other night I was on my way home from work and couldn't make it home.  I got disoriented and had to call my husband to come rescue me.  I hate to be dependent on people. And knowing that dependency looms large in my future is depressing.",
        "title": "In a Funk"
    },
    {
        "content": "I have been pretty unproductive the last week.  I seem to be really tired and just not in the mood to do much.  That comes and goes but I hate it when I just can't pull myself up to do much.  I find it hard to contribute anything to cnversations and I just really need some quiet time.  It is hard to get thoughts to pop in my head actually.  That sounds weird I'm sure but there just isn't anything there much of the time! That makes it pretty diffiicult to work.I have been playing with my son's game boy for several years.  I have myself believing that it helps \"keep my mind active\".  However, last night I forgot how to play the game.",
        "title": "A new week"
    },
    {
        "content": "It's hard to know what to post here sometimes.  It seems like everything I write is somewhat depressing.....but my life isn't that depressing.  I'm still amazed by the things that I can do and sometimes only mildly annoyed at what I can't do.   Friday was a bad day at work so having Saturday off was so nice.  I have to go to work today but I don't have to think much so that is good.  My brain needs more rest now than it used to.",
        "title": "Random Thoughts"
    },
    {
        "content": "Last night on PBS, there was a special called \"The Forgetting\" about Alzheimer's Disease.  It was a wonderful show.  I thought I would have a hard time watching it but I didn't.  I hope a lot of people saw it -- it was very informative and was discussed in laymen's terms.  I admire all the families on the show that shared their story with us.One of the families, the Noonan's, have a history with AD.  One of the family members, Julie Noonan Lawson has been communicating with me on and off for the past year or so via email.  It was nice to put a face to her email address.  How brave her family is and how I admire her.  Since the program was taped Julie has lost her sister Fran (who has highlighted in the show) to AD and another brother has been diagnosed.  There are 10 children in her family and Fran was the 4th member of her family to die of Alzheimer's.  I cannot imagine what her family has and is going through.  I know how tough it is on my family with just me to worry about.  They are my heroes in coming forward with their story and sharing their lives with the nation on this show.I could certainly relate to a lot in the show and I hope that my family will watch it. Although my husband did not watch it with me, I hope he and my son will both watch the tape of it.  It's more for them than for me.  I hate what this disease does to families -- it's much harder on them than the patients.  I only wish they didn't have to go through it.",
        "title": "The Forgetting"
    },
    {
        "content": "Last night on television there was a story about face transplants.  They talked to doctors that feel this is possible for people who have been severely burned or with birth malformities.  I told my husband it would be nice if they could transplant a new brain in me.  I feel like the scarecrow in the Wizard of Oz that needs a brain.",
        "title": "Transplants"
    },
    {
        "content": "I had to work this morning.  We had an event in the building and my job was to take tickets for the event.  There were only 300 or so people for the event so that was no problem.  Except that some people tried to give me money for tickets, while I was taking up tickets.  Then people wanted to carry on a conversation with me while I was taking tickets.  I was doing well to say Good morning to people as I was tearing their tickets.  I didn't figure on the fact that people would want to do anything else other than give me their ticket.  That really confused me.  Then, I had to pull box office reports and figure out the client's bill.  I hadn't intended on doing that either.  So it was a tough day.  I can't do math in my head any longer and I can't do three things at once any longer. So I was doomed from the beginning of the morning.  I had to have people go back over what I was doing and I don't like to do that.  It shows my vulnerability I guess.  And, I feel stupid.  I went to a conference where others with Alzheimer's were speaking and that is one of the things one of them said is \"How it makes you feel stupid\".  It's hard to get past that thought when you know you can do something or you used to be able to do something and now you can't.  That's pretty frustrating.The good side of today was that I got to see my son.  He's the best thing that ever happened to me. And, although he's all grown up (you are at 20 you know) he'll always be \"my little boy\" and yes, he hates me saying that.  We went to Atlanta to see him today for lunch.  I really miss him and I worry about the day when I will no longer be able to recognize him and how that will make him feel.  Although it was raining outside today, the sun always shines in my heart when I see him.",
        "title": "An Interesting Day"
    },
    {
        "content": "I'm still trying to get back into the groove of work after my trip.  Regrouping is something I don't do well anymore.  The mounds of paper are still stacked on my desk.  It may take a third person to go through and sort things for me, but I'm going to give it a try today and see what happens.  I've always prided myself on being organized -- it's much harder to do now.  It's very confusing.  On a good day, I can do it.  Perhaps I'll have a good day today.My life is now described as \"good days\" and \"bad days\".  I sometimes call my \"bad days\", \"bad brain days\" -- which is more accurate.  I have more good days than bad days but this week a string of bad days made for a bad week. Hopefully, with some rest this weekend, I'll do better next week.",
        "title": "Getting Back to Work"
    },
    {
        "content": "Yes, I'm back and the trip was much harder than I had anticipated.  But, for all the wrong things I was worried about!  The level of concentration I had to keep for such a long time was probably the hardest and most wearing on me.  You don't realize how hard it is to think! I guess that is one of those things we take for granted until it becomes a hardship......like a right handed person breaking their right hand and all of a sudden realizing how difficult life can be!I know the city pretty well, so I wasn't worried about getting around.  I prefer to walk in New York instead of taking cabs.  I was very frustrated when I found that even though the streets are numbered I had a hard time getting around.  One day I had four appointments.  I was staying at 6th and 53rd.  My first meeting of the morning was at 6th and 45th Street.  My second appointment of the day was 7th and 46th Street.  Pretty easy to get from one place to the next, right?  Well, not for me.  I was totally confused and found myself having to walk back to the hotel at 6th and 53rd and starting all over to get to 7th and 46th.  That was pretty frustrating.  I felt really stupid.....I knew what I had to do to get there but I couldn't do it -- so I started all over!  I did the same thing for the next two appointments of the day -- went back to the hotel in between each one because I couldn't get from point A to point B.  But, I got around to where I needed to go and on time......so I shouldn't be complaining.  I figured out how to do it.......eventually.  Dealing with Alzheimer's is just dealing with your life a different way.  When you can't do something you figure out how to do it differently.  That's hard to do and I don't know how long I'll be able to do that -- think of the alternative way to do things-- but hopefully it will be awhile before that happens.The noise was pretty overwhelming in New York, but I knew that was going to be a problem.  Everything is noisy in New York.........cabs honking, sirens wailing, people talking loud.  I was prepared for that though.  I just wasn't prepared for some of the other things that happened and, I'm too tired to go into those things!I'm exhausted from the trip. It took a lot more out of me than it should have.  I've been back for two days and I'm still exhausted.  Tackling emails, mail, meetings and phone calls when I got back was awful.  It is hard for me to compartmentalize things so when I got back to work and saw the mass of paper that had accumulated on my desk while I was gone I was overwhelmed.  I still haven't been able to put it into piles of what to do or what to throw away.  It's too much.  I haven't figured out an alternative way to do that yet.......but I'm trying.",
        "title": "The Trip"
    },
    {
        "content": "I'm going to New York City today.  I think I have mentioned this before -- I'm not anxious about the trip to New York City.  What I'm anxious about is all the \"noise\" in New York City.  I'm going there on business and I have been going for many years.  I know the city quite well and feel comfortable in getting around the city.  But the noise confuses me.  Being in crowded restaurants, city noises, cabs honking, sirens blaring, all can get me pretty confused.It's strange how noise affects how I think but in talking with others with Early On Set Alzheimer's this is something we all deal with.  The only way I can describe it is that the noise turns into \"white noise\" in my brain and I can't filter things out.  That gets me confused.  I'll have to try to stay focused and be sure I have everything written down as to where I'm going and what I'm doing.  I'll be fine.",
        "title": "New York City"
    },
    {
        "content": "Driving to work today the moon was just beautiful.  It was full and bright.  No clouds in the sky.  Sometimes we don't stop long enough to enjoy the beautiful things in life.",
        "title": "The Moon"
    },
    {
        "content": "There is a saying that says \"You can never be too rich or too thin\" -- well I think the saying should be \"You can never have too many friends\" -- because I certainly have great friends and I don't know what I would do without them.  I count every one of them as a blessing -- and sometimes they get counted twice!A friend of mine that I have known for almost thirty years sent me a necklace for Christmas.  It is simple but beautiful. It's on a delicate chain and it says love on it on one side and a chinese symbol on the other side that I assume means love as well.   For a long time I have noticed friends wearing a special necklace that someone close to them gave them and they never take it off -- kind of like a wedding ring.  Well, since I have gotten this necklace I haven't taken it off.  I'm sure that when he sent it to me he didn't know how much it would mean to me -- but it came at a time when I needed a boost and this was it.  He's a great friend as are all of my friends.",
        "title": "Friends"
    },
    {
        "content": "Yesterday I went to the Georgia/Georgia Tech Men's basketball game.  Although the game was exciting (Georgia won in double overtime) it was extremely hard.  I've mentioned before that noise is a real problem for me.  Well, I thought I could handle it -- but I couldn't.  I've been doing well with the women's basketball games I regularly attend but they are definitely not as loud as the men's games.  It was hard for me to keep focused despite the closeness of the game and after the game I was mentally exhausted.  It was a quiet night in our house last night because I couldn't carry on a conversation, or follow anything on television -- it just wasn't in the cards.  I guess I'll settle for watching men's basketball on television!I'm going to New York in a few days on business.  I am quite familiar with the city so the trip itself does not bother me -- although I know that I have to write everything down and be sure that I have proper identification on me in case something were to happen.  But, the business end of the trip does bother me somewhat.  First of all, it is very difficult for me to get ready to go.  I'm not as organized as I once was -- and that probably isnt' even a fair statement.  I actually know what I have to do to get ready, but I find that it is more difficult for me to pull things together.  It is like when I am having a \"bad brain day\" (as I am fond of calling my bad days) and having to prepare dinner.  I know what I want to cook but I can't get it all to come together --when to time out things so they will all be done at the same time.  I know what needs to be done but I can't get there without assistance.  It's rather frustrating.  But I have started to get ready for the New York trip but it is just taking a lot longer than I had planned.  I used to be able to spend a couple of days putting my work stuff together and one evening packing.  I've been working on this process for over two weeks -- perhaps by Wednesday I will have it all put together!",
        "title": "This and That"
    },
    {
        "content": "It's been a long time for me to be off work -- almost 10 days.  I don't usually do that but what a difference it has made for me.  I didn't realize what so much concentrating to get through a day of work was \"costing\" me.  I haven't had to really think and stay focused for long periods of time during my time off and it has been like a burden off my shoulders.  I did work some from home and during that brief time period during the day I would be o.k., but I do realize what a heavy weight it is on me.  I went to lunch with my family and some friends today and the noise in the restaurant was quite a bit for me to handle. One of my biggest challenges is sorting the noise in my brain.  It is extremely hard for me to concentrate and carry on a conversation with lots going on around me. Thankfully, my friends and family know this -- and bless their hearts they still want to be with me!  Gone are the days when Kris' monopolizes the conversation (that's probably a good thing for them).Having my son home from college while I have been home has been great.  I really appreciate the times we have together.  Although it takes some getting used to having him being back at home.  It is harder for me when he is home because of all the extra noise that is generated.  I have a difficult time while watching television or listening to the radio when people are talking.  I tend to leave the room and find some some quieter place.  I forget when he is not here that my husband knows that we can't converse while doing something else -- so we don't.  Or we turn the \"noise\" off.  Simple things like this are easy to forget -- but it's just an obstacle we deal with.  It's not life threatening and knowing what you need to do when it gets a little distracting helps.  My family doesn't take offense to it -- they have learned to live it.  I love them for that. Alan returns to school tomorrow -- that makes me sad.By the way -- don't ever give anyone you love with Alzheimer's a jigsaw puzzle for Christmas.",
        "title": "The Holidays are almost over"
    },
    {
        "content": "Well this seems to be my first initial post.  I have thought long and hard about what to put here and I keep changing my mind or I forget what I was going to post.  Nevertheless, it is what it is.  Christmas has come and gone and today is New Year's Day.  I've always been a little down over the holidays but as the years past I seem to get more down.  I realize that next year at this time I might not be able to remember what Christmas is about or to enjoy time with my family.  I've been off this week from work and I didn't realize how tired I was.  You don't realize the toll something takes on you until you take a break.  I worked a lot over the course of December and with my new medication I think I can be the same old person that I was.  I realize how silly that is........but one can always dream.  I count my blessings every day and my family and friends are at the top of my list. Happy New Year everyone.",
        "title": "Christmas and New Years"
    }
]